#pragma once
/***********************************************************************
 * Module:   IAngleAxisMinorTick.h
 * Author:   杨鹏辉
 * Modified: 2022年7月1日 15:02:44
 * Purpose:  坐标轴次刻度线相关设置。
 *           注意：次刻度线无法在类目轴（type: 'category'）中使用。
 ***********************************************************************/
#include "Common/IEnum.h"
#include "Options/Common/ILineStyle.h"

namespace IIChart
{
	namespace AngleAxis
	{
		/*@class
		***********************************************************************
		* 类  名: IAngleAxisMinorTick
		* 修  改: 2022年7月1日 15:02:44
		* 功  能: 坐标轴次刻度线相关设置。
		-----------------------------------------------------------------------
		* 作  者:  YangPenghui 2022-10-26;
		************************************************************************/
		class IAngleAxisMinorTick
		{
		public:
			/*@function
			******************************************************************
			功  能：是否显示次刻度线。
			参  数：<bValue>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetShow(bool bValue) = 0;
			virtual bool GetShow() const = 0;

			/*@function
			******************************************************************
			功  能：次刻度线分割数，默认会分割成 5 段。
			参  数：<nValue>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetSplitNumber(int nValue) = 0;
			virtual int  GetSplitNumber() const = 0;

			/*@function
			******************************************************************
			功  能：坐标轴刻度的长度。
			参  数：<nValue>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetLength(int nValue) = 0;
			virtual int  GetLength() const = 0;

			/*@function
			******************************************************************
			功  能：坐标轴刻度线样式
			参  数：<无>;
			返回值：<ILineStyle*>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual ILineStyle* GetLineStyle() = 0;
		};
	}
	
}
