#pragma once
/***********************************************************************
 * Module:   IVisualMapPieceComponent.h
 * Author:   杨鹏辉
 * Modified: 2022年7月1日 15:02:44
 * Purpose:  分段式视觉映射组件每一段的特别的样式
 ***********************************************************************/
#include "Common/IEnum.h"
#include "Common/ICallback.h"
#include "Options/Common/IRich.h"
#include "Options/Common/IColor.h"

namespace IIChart
{
	namespace VisualMap
	{
		/*@class
		***********************************************************************
		* 类  名: IVisualMapPieceComponent
		* 修  改: 2022年7月1日 15:02:44
		* 功  能: VisualMap 中可选的视觉元素，可以同时存在多个。
		-----------------------------------------------------------------------
		* 作  者:  YangPenghui 2022-10-26;
		************************************************************************/
		class IVisualMapPieceComponent
			: public IBaseArrayElement
		{
		public:
			
			/*@function
			******************************************************************
			功  能：设置 标记的图形。
			参  数：<eValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetSymbol(ESymbol eValue) = 0;
			virtual ESymbol GetSymbol() const = 0;

			/*@function
			******************************************************************
			 功  能：用图片设置 标记的图形
			 参  数：<wzValue>图片的 URL 或 dataURI也可以是 Path;本接口参数只能是以下几种形式：
					 1. 图片链接：
					 'image://http://example.website/a/b.png'
					 2. dataURI：
					 'image://data:image/gif;base64,R0lGODlhEAAQAMQAAORHHOVSKudfOulrSOp3WOyDZu6QdvCchPGolfO0o/XBs/fNwfjZ0frl3/zy7////wAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAACH5BAkAABAALAAAAAAQABAAAAVVICSOZGlCQAosJ6mu7fiyZeKqNKToQGDsM8hBADgUXoGAiqhSvp5QAnQKGIgUhwFUYLCVDFCrKUE1lBavAViFIDlTImbKC5Gm2hB0SlBCBMQiB0UjIQA7'
					 3. 矢量路径：（可以参考 https://www.w3.org/TR/SVG/paths.html#PathData）
					 'path://M30.9,53.2C16.8,53.2,5.3,41.7,5.3,27.6S16.8,2,30.9,2C45,2,56.4,13.5,56.4,27.6S45,53.2,30.9,53.2z M30.9,3.5C17.6,3.5,6.8,14.4,6.8,27.6c0,13.3,10.8,24.1,24.101,24.1C44.2,51.7,55,40.9,55,27.6C54.9,14.4,44.1,3.5,30.9,3.5z M36.9,35.8c0,0.601-0.4,1-0.9,1h-1.3c-0.5,0-0.9-0.399-0.9-1V19.5c0-0.6,0.4-1,0.9-1H36c0.5,0,0.9,0.4,0.9,1V35.8z M27.8,35.8 c0,0.601-0.4,1-0.9,1h-1.3c-0.5,0-0.9-0.399-0.9-1V19.5c0-0.6,0.4-1,0.9-1H27c0.5,0,0.9,0.4,0.9,1L27.8,35.8L27.8,35.8z'
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetSymbolImage(const wchar_t* wzValue) = 0;
			virtual wchar_t* GetSymbolImage() const = 0;

			/*@function
			******************************************************************
			功  能：标记的大小，可以设置成诸如 10 这样单一的数字
			参  数：<nSize>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetSymbolSize(int nSize) = 0;
			virtual int GetSymbolSize() const = 0;

			/*@function
			******************************************************************
			功  能：标记的大小，高度
			参  数：<nSize>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetSymbolSize(int nHeight, int nWidth) = 0;
			virtual void GetSymbolSize(int& nHeight, int& nWidth) = 0;

			/*@function
			******************************************************************
			功  能：创建颜色对象
			注  意：此功能除了可以设置纯色外，还可以设置渐变色和纹理填充;
			参  数：<无>;
			返回值：<IColor*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IColor* CreateColor() = 0;

			/*@function
			 ******************************************************************
			 功  能：视觉通道的颜色值。
			 注  意：此接口用于【线性映射】模式;
					线性映射 中此值会转换成数组形式，如：
					color: '#333' 会转成 color: ['#333', '#333']
			 参  数：<wzValue> 为 nullptr 或 L"" 时将不显示任何颜色，支持以下方式的颜色值：
							  1. 可以使用 RGB 表示，比如 'rgb(128, 128, 128)'\
							  2. 如果想要加上 alpha 通道，可以使用 RGBA，比如 'rgba(128, 128, 128, 0.5)'
							  3. 可以使用十六进制格式，比如 '#ccc'
							  4. 可以使用 CSS3 预定义的颜色名称，如'red'，'SlateGray';
			 返回值：<无>;
			 ------------------------------------------------------------------
			 作  者:  YangPenghui 2022-10-26;
			 ******************************************************************/
			virtual void SetColor(const wchar_t* wzValue) = 0;
			virtual wchar_t* GetColor() const = 0;

			/*@function
			******************************************************************
			功  能：以 RGBA 方式设置视觉通道的颜色值。
			参  数：<略>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetColor(int nR, int nG, int nB, float nTransparent = 1) = 0;
			virtual void GetColor(int* pnR, int* pnG, int* pnB, float* pnTransparent) = 0;

			/*@function
			******************************************************************
			功  能：设置图形的颜色，此方式除可设置纯色外还可以设置为渐变色和纹理填充;
			参  数：<pValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetColor(IColor* pValue) = 0;

			/*@function
			******************************************************************
			功  能：视觉通道的颜色透明度,取值范围是 [0, 1]。同 Opacity
			注  意：此接口用于【线性映射】模式;
			参  数：<fValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetColorAlpha(float fValue) = 0;
			virtual float  GetColorAlpha() const = 0;

			/*@function
			******************************************************************
			功  能：视觉通道的透明度,取值范围是 [0, 1]。视觉通道的值的 Array 形式表示,
					 例如，我们设置了 [visualMap.min, visualMap.max] 为 [0, 100]，
					 并且我们有 series.data: [50, 10, 100]。我们想将其映射到范围为 [0.4, 1]
					 的 opacity 上，从而达到用透明度表达数值大小的目的。那么 visualMap 组件
					 会对 series.data 中的每一个 dataValue 做线性映射计算，得到一个 opacityValue。
					 最终得到的 opacityValues 为 [0.7, 0.44, 1]。
			 注  意：此接口用于【线性映射】模式;
			 参  数：<fValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetOpacity(float fValue) = 0;
			virtual float  GetOpacity() const = 0;

			/*@function
			******************************************************************
			功  能：视觉通道的颜色明暗度,取值范围是 [0, 1]。同Opacity
			参  数：<fValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetColorLightness(float fValue) = 0;
			virtual float  GetColorLightnes() const = 0;

			/*@function
			******************************************************************
			功  能：视觉通道的颜色饱和度,取值范围是 [0, 1]。同Opacity
			参  数：<fValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetColorSaturation(float fValue) = 0;
			virtual float  GetColorSaturation() const = 0;

			/*@function
			******************************************************************
			功  能：视觉通道的颜色的色调,取值范围是 [0, 360]。为 0 时不绘制该图形。
			参  数：<nValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetColorHue(int nValue) = 0;
			virtual int  GetColorHue() const = 0;
		};
	}
}
