#pragma once
/***********************************************************************
 * Module:  IVisualMapRange.h
 * Author:  杨鹏辉
 * Modified: 2022年7月1日 15:02:44
 * Purpose: 指定范围的视觉元素。（用户可以和 visualMap 组件交互，用鼠标或触摸选择范围）
 * 
 * ✦ 关于视觉通道 ✦
 * > 可以有任意几个的『视觉通道』定义（如 color、symbolSize 等）。这些视觉通道，会被同时采用。
 * > 一般来说，建议使用 透明度（opacity） ，而非 颜色透明度（colorAlpha） （他们细微的差异在
 *   于，前者能也同时控制图元中的附属物（如 label）的透明度，而后者只能控制图元本身颜色的透明度）。
 * 视觉映射的方式：支持两种方式：线性映射、查表映射。
 * 
 * 如何设定为线性映射？以下情况时，会设定为 线性映射：
 * > 当 visualMap 为 visualMap-continuous 时，或者
 * > 当 visualMap 为 visualMap-piecewise 且 未设置 visualMap-piecewise.categories 时。
 * 
 * 线性映射 表示 series.data 中的每一个值（dataValue）会经过线性映射计算，从 [visualMap.min, visualMap.max] 
 * 映射到设定的 [visual value 1, visual value 2] 区间中的某一个视觉的值（下称 visual value）。
 * 
 * ✦ 视觉通道 -- 查表映射 ✦
 * 查表映射 表示 series.data 中的所有值（dataValue）是可枚举的，会根据给定的映射表查表得到映射结果。
 * 
 * 
 ***********************************************************************/
#include "Common/IEnum.h"
using namespace std;

namespace IIChart
{
	namespace VisualMap
	{
		/*@class
		*************************************************************************
		* 类  名: IVisualMapRange
		* 修  改: 2022年7月1日 15:02:44
		* 功  能: 定义 选择/未选择范围 的视觉元素
		-----------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		************************************************************************/
		class IVisualMapRange // OK
		{
		public:

			 /*@function
			 ******************************************************************
			 功  能：视觉通道的颜色值。
			 注  意：此接口用于【线性映射】模式;
			        线性映射 中此值会转换成数组形式，如：
			   	    color: '#333' 会转成 color: ['#333', '#333']
			 参  数：<wzValue> 为 nullptr 或 L"" 时将不显示任何颜色，支持以下方式的颜色值：
							  1. 可以使用 RGB 表示，比如 'rgb(128, 128, 128)'\
							  2. 如果想要加上 alpha 通道，可以使用 RGBA，比如 'rgba(128, 128, 128, 0.5)'
							  3. 可以使用十六进制格式，比如 '#ccc'
							  4. 可以使用 CSS3 预定义的颜色名称，如'red'，'SlateGray';
			 返回值：<无>;
			 ------------------------------------------------------------------
			 作  者:  YangPenghui 2022-10-26;
			 ******************************************************************/
			virtual void SetColor(const wchar_t* wzValue) = 0;

			/*@function
			 ******************************************************************
			 功  能：视觉通道的颜色值。
			 参  数：<wzStartValue> 为 nullptr 或 L"" 时将不显示任何颜色，支持以下方式的颜色值：
									1. 可以使用 RGB 表示，比如 'rgb(128, 128, 128)'\
									2. 如果想要加上 alpha 通道，可以使用 RGBA，比如 'rgba(128, 128, 128, 0.5)'
									3. 可以使用十六进制格式，比如 '#ccc'
									4. 可以使用 CSS3 预定义的颜色名称，如'red'，'SlateGray';
			         <wzEndValue>   同wzStartValue
			 注  意：此接口用于【线性映射】模式;
			 返回值：<无>;
			------------------------------------------------------------------
			 作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetColor(const wchar_t* wzStartValue, const wchar_t* wzEndValue) = 0;

			/*@function
			******************************************************************
			 功  能：视觉通道的颜色值。意思就是以这三个点作为基准，形成一种『渐变』的色带，
			         数据映射到这个色带上。例如：['#333', '#78ab23', 'blue']
					 与 visualMap.min 相等的值会映射到 '#333'，
					 与 visualMap.max 相等的值会映射到 'blue'。
					 对于 visualMap.min 和 visualMap.max 中间的其他点，
					 以所给定的 '#333', '#78ab23', 'blue' 这三个颜色作为基准点进行分段线性插值，得到映射结果。
			 注  意：此接口用于【线性映射】模式;
			 参  数：<wzStartValue> 为 nullptr 或 L"" 时将不显示任何颜色，支持以下方式的颜色值：
									1. 可以使用 RGB 表示，比如 'rgb(128, 128, 128)'\
									2. 如果想要加上 alpha 通道，可以使用 RGBA，比如 'rgba(128, 128, 128, 0.5)'
									3. 可以使用十六进制格式，比如 '#ccc'
									4. 可以使用 CSS3 预定义的颜色名称，如'red'，'SlateGray';
			         <wzMiddleValue>   同wzStartValue;
					 <wzEndValue>   同wzStartValue;
			 返回值：<无>;
			------------------------------------------------------------------
			 作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetColor(const wchar_t* wzStartValue, const wchar_t* wzMiddleValue, const wchar_t* wzEndValue) = 0;

			/*@function
			******************************************************************
			 功  能：视觉通道的颜色值。
			 注  意：此接口用于【查表映射】模式;
			 参  数：<wzCategorie> 单个类目名字,当为 nullptr 或 L""时都代表L"";
					 <wzValue> 为 nullptr 或 L"" 时将不显示任何颜色，支持以下方式的颜色值：
								1. 可以使用 RGB 表示，比如 'rgb(128, 128, 128)'\
								2. 如果想要加上 alpha 通道，可以使用 RGBA，比如 'rgba(128, 128, 128, 0.5)'
								3. 可以使用十六进制格式，比如 '#ccc'
								4. 可以使用 CSS3 预定义的颜色名称，如'red'，'SlateGray';
			 返回值：<无>;
			------------------------------------------------------------------
			 作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetColorEx(const wchar_t* wzCategorie, const wchar_t* wzValue) = 0;

			/*@function
			******************************************************************
			* 功  能：用于查表的颜色值，数组须和 categories 数组等长,每个数组项和 categories 数组项一一对应;
			* 注  意：此接口用于【查表映射】模式;
			* 参  数：<wzValue> 使用“,”分隔的颜色值，单个值支持以下方式的颜色值：
								1. 可以使用 RGB 表示，比如 'rgb(128, 128, 128)'\
								2. 如果想要加上 alpha 通道，可以使用 RGBA，比如 'rgba(128, 128, 128, 0.5)'
								3. 可以使用十六进制格式，比如 '#ccc'
								4. 可以使用 CSS3 预定义的颜色名称，如'red'，'SlateGray';
			* 返回值：<无>;
			------------------------------------------------------------------
			 作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetColorEx(const wchar_t* wzValue) = 0;

			/*@function
			******************************************************************
			* 功  能：用于查表的颜色值，数组须和 categories 数组等长,每个数组项和 categories 数组项一一对应;
			* 注  意：此接口用于【查表映射】模式;
			* 参  数：<vctValue> 颜色值, 单个值支持以下方式的颜色值：
								1. 可以使用 RGB 表示，比如 'rgb(128, 128, 128)'\
								2. 如果想要加上 alpha 通道，可以使用 RGBA，比如 'rgba(128, 128, 128, 0.5)'
								3. 可以使用十六进制格式，比如 '#ccc'
								4. 可以使用 CSS3 预定义的颜色名称，如'red'，'SlateGray';
			* 返回值：<无>;
			------------------------------------------------------------------
			 作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetColorEx(const std::vector<wstring>& vctValue) = 0;

			/*@function
			******************************************************************
			* 功  能：用于查表的颜色值，数组须和 categories 数组等长,每个数组项和 categories 数组项一一对应;
			* 注  意：此接口用于【查表映射】模式;
			* 参  数：<pQueue> 使用字符串表示颜色的数据;单个值支持以下方式的颜色值：
								1. 可以使用 RGB 表示，比如 'rgb(128, 128, 128)'\
								2. 如果想要加上 alpha 通道，可以使用 RGBA，比如 'rgba(128, 128, 128, 0.5)'
								3. 可以使用十六进制格式，比如 '#ccc'
								4. 可以使用 CSS3 预定义的颜色名称，如'red'，'SlateGray';
			* 返回值：<无>;
			------------------------------------------------------------------
			 作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetColorEx(IQueue* pQueue) = 0;

			/*@function
			******************************************************************
			* 功  能：清除设置的颜色通道
			* 参  数：<无>;
			* 返回值：<无>;
			------------------------------------------------------------------
			 作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void ClearColor() = 0;

			/*@function
			******************************************************************
			 功  能：视觉通道的图元的图形类别。
					 线性映射 中此值会转换成数组形式，就像颜色值一样，如：
					 color: '#333' 会转成 color: ['#333', '#333']
			 注  意：此接口用于【线性映射】模式;
			 参  数：<eValue>;
			 返回值：<无>;
			------------------------------------------------------------------
			 作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetSymbol(ESymbol eValue) = 0;

			/*@function
			******************************************************************
			 功  能：用图片设置 视觉通道的图元的图形
			 注  意：本接口参数只能是以下几种形式：
					 1. 图片链接：
					 'image://http://example.website/a/b.png'
					 2. dataURI：
					 'image://data:image/gif;base64,R0lGODlhEAAQAMQAAORHHOVSKudfOulrSOp3WOyDZu6QdvCchPGolfO0o/XBs/fNwfjZ0frl3/zy7////wAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAACH5BAkAABAALAAAAAAQABAAAAVVICSOZGlCQAosJ6mu7fiyZeKqNKToQGDsM8hBADgUXoGAiqhSvp5QAnQKGIgUhwFUYLCVDFCrKUE1lBavAViFIDlTImbKC5Gm2hB0SlBCBMQiB0UjIQA7'
					 3. 矢量路径：（可以参考 https://www.w3.org/TR/SVG/paths.html#PathData）
					 'path://M30.9,53.2C16.8,53.2,5.3,41.7,5.3,27.6S16.8,2,30.9,2C45,2,56.4,13.5,56.4,27.6S45,53.2,30.9,53.2z M30.9,3.5C17.6,3.5,6.8,14.4,6.8,27.6c0,13.3,10.8,24.1,24.101,24.1C44.2,51.7,55,40.9,55,27.6C54.9,14.4,44.1,3.5,30.9,3.5z M36.9,35.8c0,0.601-0.4,1-0.9,1h-1.3c-0.5,0-0.9-0.399-0.9-1V19.5c0-0.6,0.4-1,0.9-1H36c0.5,0,0.9,0.4,0.9,1V35.8z M27.8,35.8 c0,0.601-0.4,1-0.9,1h-1.3c-0.5,0-0.9-0.399-0.9-1V19.5c0-0.6,0.4-1,0.9-1H27c0.5,0,0.9,0.4,0.9,1L27.8,35.8L27.8,35.8z'
			 参  数：<wzValue>图片的 URL 或 dataURI也可以是 Path;
			 返回值：<无>;
			------------------------------------------------------------------
			 作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetSymbol(const wchar_t* wzValue) = 0;

			/*@function
			******************************************************************
			 功  能：视觉通道的图元的图形类别。
			 参  数：<eStartValue>;
					 <eEndValue>
			 注  意：此接口用于【线性映射】模式;
			 返回值：<无>;
			------------------------------------------------------------------
			 作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetSymbol(ESymbol eStartValue, ESymbol eEndValue) = 0;

			/*@function
			******************************************************************
			 功  能：用图片设置 视觉通道的图元的图形
			 注  意：本接口参数只能是以下几种形式：
					 1. 图片链接：
					 'image://http://example.website/a/b.png'
					 2. dataURI：
					 'image://data:image/gif;base64,R0lGODlhEAAQAMQAAORHHOVSKudfOulrSOp3WOyDZu6QdvCchPGolfO0o/XBs/fNwfjZ0frl3/zy7////wAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAACH5BAkAABAALAAAAAAQABAAAAVVICSOZGlCQAosJ6mu7fiyZeKqNKToQGDsM8hBADgUXoGAiqhSvp5QAnQKGIgUhwFUYLCVDFCrKUE1lBavAViFIDlTImbKC5Gm2hB0SlBCBMQiB0UjIQA7'
					 3. 矢量路径：（可以参考 https://www.w3.org/TR/SVG/paths.html#PathData）
					 'path://M30.9,53.2C16.8,53.2,5.3,41.7,5.3,27.6S16.8,2,30.9,2C45,2,56.4,13.5,56.4,27.6S45,53.2,30.9,53.2z M30.9,3.5C17.6,3.5,6.8,14.4,6.8,27.6c0,13.3,10.8,24.1,24.101,24.1C44.2,51.7,55,40.9,55,27.6C54.9,14.4,44.1,3.5,30.9,3.5z M36.9,35.8c0,0.601-0.4,1-0.9,1h-1.3c-0.5,0-0.9-0.399-0.9-1V19.5c0-0.6,0.4-1,0.9-1H36c0.5,0,0.9,0.4,0.9,1V35.8z M27.8,35.8 c0,0.601-0.4,1-0.9,1h-1.3c-0.5,0-0.9-0.399-0.9-1V19.5c0-0.6,0.4-1,0.9-1H27c0.5,0,0.9,0.4,0.9,1L27.8,35.8L27.8,35.8z'
			 参  数：<wzValue>图片的 URL 或 dataURI也可以是 Path;
			 返回值：<无>;
			------------------------------------------------------------------
			 作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetSymbol(const wchar_t* wzStartValue, const wchar_t* wzEndValue) = 0;

			/*@function
			******************************************************************
			 功  能：视觉通道的图元的图形类别。例如：['circle', 'rect', 'diamond']
					 与 visualMap.min 相等的值会映射到 'circle'，
					 与 visualMap.max 相等的值会映射到 'diamond'。
					 对于 visualMap.min 和 visualMap.max 中间的其他点，
					 会根据他们和 visualMap.min 和 visualMap.max 的数值距离，
					 映射到 'circle', 'rect', 'diamond' 中某个值上。
			 注  意：此接口用于【线性映射】模式;
			 参  数：<eStartValue>;
					 <eMiddleValue>;
					 <eEndValue> ;
			 返回值：<无>;
			------------------------------------------------------------------
			 作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetSymbol(ESymbol eStartValue, ESymbol eMiddleValue, ESymbol eEndValue) = 0;

			/*@function
			******************************************************************
			 功  能：用图片设置 视觉通道的图元的图形
			 注  意：本接口参数只能是以下几种形式：
					 1. 图片链接：
					 'image://http://example.website/a/b.png'
					 2. dataURI：
					 'image://data:image/gif;base64,R0lGODlhEAAQAMQAAORHHOVSKudfOulrSOp3WOyDZu6QdvCchPGolfO0o/XBs/fNwfjZ0frl3/zy7////wAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAACH5BAkAABAALAAAAAAQABAAAAVVICSOZGlCQAosJ6mu7fiyZeKqNKToQGDsM8hBADgUXoGAiqhSvp5QAnQKGIgUhwFUYLCVDFCrKUE1lBavAViFIDlTImbKC5Gm2hB0SlBCBMQiB0UjIQA7'
					 3. 矢量路径：（可以参考 https://www.w3.org/TR/SVG/paths.html#PathData）
					 'path://M30.9,53.2C16.8,53.2,5.3,41.7,5.3,27.6S16.8,2,30.9,2C45,2,56.4,13.5,56.4,27.6S45,53.2,30.9,53.2z M30.9,3.5C17.6,3.5,6.8,14.4,6.8,27.6c0,13.3,10.8,24.1,24.101,24.1C44.2,51.7,55,40.9,55,27.6C54.9,14.4,44.1,3.5,30.9,3.5z M36.9,35.8c0,0.601-0.4,1-0.9,1h-1.3c-0.5,0-0.9-0.399-0.9-1V19.5c0-0.6,0.4-1,0.9-1H36c0.5,0,0.9,0.4,0.9,1V35.8z M27.8,35.8 c0,0.601-0.4,1-0.9,1h-1.3c-0.5,0-0.9-0.399-0.9-1V19.5c0-0.6,0.4-1,0.9-1H27c0.5,0,0.9,0.4,0.9,1L27.8,35.8L27.8,35.8z'
			 参  数：<wzValue>图片的 URL 或 dataURI也可以是 Path;
			 返回值：<无>;
			------------------------------------------------------------------
			 作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetSymbol(const wchar_t* wzStartValue, const wchar_t* wzMiddleValue, const wchar_t* wzEndValue) = 0;

			/*@function
			******************************************************************
			 功  能：[视觉通道的图元的图形]。
			 注  意：此接口用于【查表映射】模式;
			 参  数：<wzCategorie> 单个类目名字,当为 nullptr 或 L""时都代表L"";
					 <wzValue> 可以为图片链接或dataURI或矢量路径;
			 返回值：<无>;
			------------------------------------------------------------------
			 作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetSymbolEx(const wchar_t* wzCategorie, const wchar_t* wzValue) = 0;

			/*@function
			******************************************************************
			 功  能：[视觉通道的图元的图形]。
			 注  意：此接口用于【查表映射】模式;
			 参  数：<wzCategorie> 单个类目名字,当为 nullptr 或 L""时都代表L"";
					 <wzValue> 可以为图片链接或dataURI或矢量路径;
			 返回值：<无>;
			------------------------------------------------------------------
			 作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetSymbolEx(const wchar_t* wzCategorie, ESymbol eValue) = 0;

			/*@function
			******************************************************************
			* 功  能：用于查表的[视觉通道的图元的图形]，数组须和 categories 数组等长,每个数组项和 categories 数组项一一对应;
			* 注  意：此接口用于【查表映射】模式;
			* 参  数：<vctValue> [视觉通道的图元的图形];
			* 返回值：<无>;
			------------------------------------------------------------------
			 作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetSymbolEx(const std::vector<wstring>& vctValue) = 0;

			/*@function
			******************************************************************
			* 功  能：用于查表的[视觉通道的图元的图形]，数组须和 categories 数组等长,每个数组项和 categories 数组项一一对应;
			* 注  意：此接口用于【查表映射】模式;
			* 参  数：<pQueue> 使用字符串表示的[视觉通道的图元的图形]数据;
			* 返回值：<无>;
			------------------------------------------------------------------
			 作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetSymbolEx(IQueue* pQueue) = 0;

			/*@function
			******************************************************************
			* 功  能：用于查表的[视觉通道的图元的图形]，数组须和 categories 数组等长,每个数组项和 categories 数组项一一对应;
			* 注  意：此接口用于【查表映射】模式;
			* 参  数：<vctValue> [视觉通道的图元的图形];
			* 返回值：<无>;
			------------------------------------------------------------------
			 作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetSymbolEx(const std::vector<ESymbol>& vctValue) = 0;

			/*@function
			******************************************************************
			* 功  能：清除设置的[视觉通道的图元的图形]
			* 参  数：<无>;
			* 返回值：<无>;
			------------------------------------------------------------------
			 作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void ClearSymbol() = 0;
			
			/*@function
			******************************************************************
			 功  能：视觉通道的图元的大小。
			 注  意：此接口用于【线性映射】模式;
			 参  数：<fValue>;
			 返回值：<无>;
			------------------------------------------------------------------
			 作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetSymbolSize(int nValue) = 0;

			/*@function
			******************************************************************
			 功  能：视觉通道的图元的大小
			 注  意：此接口用于【线性映射】模式;
			 参  数：<fStart> 起始大小;
					 <fEnd> 终值大小;
			 返回值：<无>;
			------------------------------------------------------------------
			 作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetSymbolSize(int nStart, int nEnd) = 0;

			/*@function
			******************************************************************
			 功  能：视觉通道的图元的大小。
			 注  意：此接口用于【查表映射】模式;
			 参  数：<wzCategorie> 单个类目名字,当为 nullptr 或 L""时都代表L"";
					 <wzValue> 图元的大小;
			 返回值：<无>;
			------------------------------------------------------------------
			 作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetSymbolSizeEx(const wchar_t* wzCategorie, int nValue) = 0;

			/*@function
			******************************************************************
			* 功  能：用于查表的图元的大小，数组须和 categories 数组等长,每个数组项和 categories 数组项一一对应;
			* 注  意：此接口用于【查表映射】模式;
			* 参  数：<wzValue> 使用“,”分隔的图元的大小整数值;
			* 返回值：<无>;
			------------------------------------------------------------------
			 作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetSymbolSizeEx(const wchar_t* wzValue) = 0;

			/*@function
			******************************************************************
			* 功  能：用于查表的图元的大小，数组须和 categories 数组等长,每个数组项和 categories 数组项一一对应;
			* 注  意：此接口用于【查表映射】模式;
			* 参  数：<vctValue> 图元的大小;
			* 返回值：<无>;
			------------------------------------------------------------------
			 作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetSymbolSizeEx(const std::vector<int>& vctValue) = 0;

			/*@function
			******************************************************************
			* 功  能：用于查表的颜色值，数组须和 categories 数组等长,每个数组项和 categories 数组项一一对应;
			* 注  意：此接口用于【查表映射】模式;
			* 参  数：<pQueue> 使用字符串表示图元的大小的数据;
			* 返回值：<无>;
			------------------------------------------------------------------
			 作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetSymbolSizeEx(IQueue* pQueue) = 0;

			/*@function
			******************************************************************
			* 功  能：清除设置的颜色通道
			* 参  数：<无>;
			* 返回值：<无>;
			------------------------------------------------------------------
			 作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void ClearSymbolSize() = 0;
						
			/*@function
			******************************************************************
			 功  能：视觉通道的透明度,取值范围是 [0, 1]。
			 注  意：此接口用于【线性映射】模式;
			 参  数：<fValue>;
			 返回值：<无>;
			------------------------------------------------------------------
			 作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetOpacity(float fValue) = 0;

			/*@function
			******************************************************************
			功  能：视觉通道的透明度,取值范围是 [0, 1]。视觉通道的值的 Array 形式表示,
			        例如，我们设置了 [visualMap.min, visualMap.max] 为 [0, 100]，
				 并且我们有 series.data: [50, 10, 100]。我们想将其映射到范围为 [0.4, 1] 
				 的 opacity 上，从而达到用透明度表达数值大小的目的。那么 visualMap 组件
				 会对 series.data 中的每一个 dataValue 做线性映射计算，得到一个 opacityValue。
				 最终得到的 opacityValues 为 [0.7, 0.44, 1]。
			注  意：此接口用于【线性映射】模式;
			参  数：<fValue>;
				 <fEnd>;
			返回值：<无>;
			------------------------------------------------------------------
			 作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetOpacity(float fStart, float fEnd) = 0;

			/*@function
			******************************************************************
			 功  能：视觉通道的图元的透明度。
			 注  意：此接口用于【查表映射】模式;
			 参  数：<wzCategorie> 单个类目名字,当为 nullptr 或 L""时都代表L"";
					 <wzValue> 图元的透明度;
			 返回值：<无>;
			------------------------------------------------------------------
			 作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetOpacityEx(const wchar_t* wzCategorie, float fValue) = 0;

			/*@function
			******************************************************************
			* 功  能：用于查表的图元的透明度，数组须和 categories 数组等长,每个数组项和 categories 数组项一一对应;
			* 注  意：此接口用于【查表映射】模式;
			* 参  数：<wzValue> 使用“,”分隔的图元的透明度值;
			* 返回值：<错误码>;
			------------------------------------------------------------------
			 作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetOpacityEx(const wchar_t* wzValue) = 0;

			/*@function
			******************************************************************
			* 功  能：用于查表的图元的透明度，数组须和 categories 数组等长,每个数组项和 categories 数组项一一对应;
			* 注  意：此接口用于【查表映射】模式;
			* 参  数：<vctValue> 图元的透明度;
			* 返回值：<无>;
			------------------------------------------------------------------
			 作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetOpacityEx(const std::vector<float>& vctValue) = 0;

			/*@function
			******************************************************************
			* 功  能：用于查表的透明度，数组须和 categories 数组等长,每个数组项和 categories 数组项一一对应;
			* 注  意：此接口用于【查表映射】模式;
			* 参  数：<pQueue> 使用字符串表示图元的透明度的数据;
			* 返回值：<无>;
			------------------------------------------------------------------
			 作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetOpacityEx(IQueue* pQueue) = 0;

			/*@function
			******************************************************************
			* 功  能：清除设置的透明度通道
			* 参  数：<无>;
			* 返回值：<无>;
			------------------------------------------------------------------
			 作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void ClearOpacity() = 0;

			/*@function
			******************************************************************
			 功  能：视觉通道的颜色透明度,取值范围是 [0, 1]。同Opacity
			 注  意：此接口用于【线性映射】模式;
			 参  数：<fValue>;
			 返回值：<无>;
			------------------------------------------------------------------
			 作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void  SetColorAlpha(float fValue) = 0;

			/*@function
			******************************************************************
			 功  能：视觉通道的颜色透明度,取值范围是 [0, 1]。同Opacity
			 注  意：此接口用于【线性映射】模式;
			 参  数：<fValue>;
					 <fEnd>;
			 返回值：<无>;
			------------------------------------------------------------------
			 作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void  SetColorAlpha(float fStart, float fEnd) = 0;

			/*@function
			******************************************************************
			 功  能：视觉通道的图元的颜色透明度。
			 注  意：此接口用于【查表映射】模式;
			 参  数：<wzCategorie> 单个类目名字,当为 nullptr 或 L""时都代表L"";
					 <wzValue> 图元的颜色透明度;
			 返回值：<无>;
			------------------------------------------------------------------
			 作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetColorAlphaEx(const wchar_t* wzCategorie, float fValue) = 0;

			/*@function
			******************************************************************
			* 功  能：用于查表的图元的颜色透明度，数组须和 categories 数组等长,每个数组项和 categories 数组项一一对应;
			* 注  意：此接口用于【查表映射】模式;
			* 参  数：<wzValue> 使用“,”分隔的图元的颜色透明度值;
			* 返回值：<错误码>;
			------------------------------------------------------------------
			 作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetColorAlphaEx(const wchar_t* wzValue) = 0;

			/*@function
			******************************************************************
			* 功  能：用于查表的图元的颜色透明度，数组须和 categories 数组等长,每个数组项和 categories 数组项一一对应;
			* 注  意：此接口用于【查表映射】模式;
			* 参  数：<vctValue> 图元的颜色透明度;
			* 返回值：<无>;
			------------------------------------------------------------------
			 作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetColorAlphaEx(const std::vector<float>& vctValue) = 0;

			/*@function
			******************************************************************
			* 功  能：用于查表的颜色透明度，数组须和 categories 数组等长,每个数组项和 categories 数组项一一对应;
			* 注  意：此接口用于【查表映射】模式;
			* 参  数：<pQueue> 使用字符串表示图元的颜色透明度的数据;
			* 返回值：<无>;
			------------------------------------------------------------------
			 作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetColorAlphaEx(IQueue* pQueue) = 0;

			/*@function
			******************************************************************
			* 功  能：清除设置的颜色透明度通道
			* 参  数：<无>;
			* 返回值：<无>;
			------------------------------------------------------------------
			 作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void ClearColorAlpha() = 0;

			/*@function
			******************************************************************
			 功  能：视觉通道的颜色明暗度,取值范围是 [0, 1]。同Opacity
			 注  意：此接口用于【线性映射】模式;
			 参  数：<fValue>;
			 返回值：<无>;
			------------------------------------------------------------------
			 作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void  SetColorLightness(float fValue) = 0;

			/*@function
			******************************************************************
			 功  能：视觉通道的颜色明暗度,取值范围是 [0, 1]。同Opacity
			 注  意：此接口用于【线性映射】模式;
			 参  数：<fValue>;
					 <fEnd>;
			 返回值：<无>;
			------------------------------------------------------------------
			 作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void  SetColorLightness(float fStart, float fEnd) = 0;

			/*@function
			******************************************************************
			 功  能：视觉通道的图元的颜色明暗度。
			 注  意：此接口用于【查表映射】模式;
			 参  数：<wzCategorie> 单个类目名字,当为 nullptr 或 L""时都代表L"";
					 <wzValue> 图元的颜色明暗度;
			 返回值：<无>;
			------------------------------------------------------------------
			 作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetColorLightnessEx(const wchar_t* wzCategorie, float fValue) = 0;

			/*@function
			******************************************************************
			* 功  能：用于查表的图元的颜色明暗度，数组须和 categories 数组等长,每个数组项和 categories 数组项一一对应;
			* 注  意：此接口用于【查表映射】模式;
			* 参  数：<wzValue> 使用“,”分隔的图元的颜色明暗度值;
			* 返回值：<错误码>;
			------------------------------------------------------------------
			 作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetColorLightnessEx(const wchar_t* wzValue) = 0;

			/*@function
			******************************************************************
			* 功  能：用于查表的图元的颜色明暗度，数组须和 categories 数组等长,每个数组项和 categories 数组项一一对应;
			* 注  意：此接口用于【查表映射】模式;
			* 参  数：<vctValue> 图元的颜色明暗度;
			* 返回值：<无>;
			------------------------------------------------------------------
			 作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetColorLightnessEx(const std::vector<float>& vctValue) = 0;

			/*@function
			******************************************************************
			* 功  能：用于查表的颜色明暗度，数组须和 categories 数组等长,每个数组项和 categories 数组项一一对应;
			* 注  意：此接口用于【查表映射】模式;
			* 参  数：<pQueue> 使用字符串表示图元的颜色明暗度的数据;
			* 返回值：<无>;
			------------------------------------------------------------------
			 作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetColorLightnessEx(IQueue* pQueue) = 0;

			/*@function
			******************************************************************
			* 功  能：清除设置的颜色明暗度通道
			* 参  数：<无>;
			* 返回值：<无>;
			------------------------------------------------------------------
			 作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void ClearColorLightness() = 0;

			/*@function
			******************************************************************
			 功  能：视觉通道的颜色饱和度,取值范围是 [0, 1]。同Opacity
			 注  意：此接口用于【线性映射】模式;
			 参  数：<fValue>;
			 返回值：<无>;
			------------------------------------------------------------------
			 作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void  SetColorSaturation(float fValue) = 0;

			/*@function
			******************************************************************
			 功  能：视觉通道的颜色饱和度,取值范围是 [0, 1]。同Opacity
			 注  意：此接口用于【线性映射】模式;
			 参  数：<fValue>;
					 <fEnd>;
			 返回值：<无>;
			------------------------------------------------------------------
			 作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void  SetColorSaturatio(float fStart, float fEnd) = 0;

			/*@function
			******************************************************************
			 功  能：视觉通道的图元的颜色饱和度。
			 注  意：此接口用于【查表映射】模式;
			 参  数：<wzCategorie> 单个类目名字,当为 nullptr 或 L""时都代表L"";
					 <wzValue> 图元的颜色饱和度;
			 返回值：<无>;
			------------------------------------------------------------------
			 作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetColorSaturationEx(const wchar_t* wzCategorie, float fValue) = 0;

			/*@function
			******************************************************************
			* 功  能：用于查表的图元的颜色饱和度，数组须和 categories 数组等长,每个数组项和 categories 数组项一一对应;
			* 注  意：此接口用于【查表映射】模式;
			* 参  数：<wzValue> 使用“,”分隔的图元的颜色饱和度值;
			* 返回值：<错误码>;
			------------------------------------------------------------------
			 作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetColorSaturationEx(const wchar_t* wzValue) = 0;

			/*@function
			******************************************************************
			* 功  能：用于查表的图元的颜色饱和度，数组须和 categories 数组等长,每个数组项和 categories 数组项一一对应;
			* 注  意：此接口用于【查表映射】模式;
			* 参  数：<vctValue> 图元的颜色饱和度;
			* 返回值：<无>;
			------------------------------------------------------------------
			 作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetColorSaturationEx(const std::vector<float>& vctValue) = 0;

			/*@function
			******************************************************************
			* 功  能：用于查表的颜色饱和度，数组须和 categories 数组等长,每个数组项和 categories 数组项一一对应;
			* 注  意：此接口用于【查表映射】模式;
			* 参  数：<pQueue> 使用字符串表示图元的颜色饱和度的数据;
			* 返回值：<无>;
			------------------------------------------------------------------
			 作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetColorSaturationEx(IQueue* pQueue) = 0;

			/*@function
			******************************************************************
			* 功  能：清除设置的颜色饱和度通道
			* 参  数：<无>;
			* 返回值：<无>;
			------------------------------------------------------------------
			 作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void ClearColorSaturation() = 0;

			/*@function
			******************************************************************
			 功  能：视觉通道的颜色色调,取值范围是 [0, 360]。同Opacity
			 注  意：此接口用于【线性映射】模式;
			 参  数：<nValue>;
			 返回值：<无>;
			------------------------------------------------------------------
			 作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void  SetColorHue(int nValue) = 0;

			/*@function
			******************************************************************
			 功  能：视觉通道的颜色色调,取值范围是 [0, 360]。同Opacity
			 注  意：此接口用于【线性映射】模式;
			 参  数：<nStart>;
					 <nEnd>;
			 返回值：<无>;
			------------------------------------------------------------------
			 作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void  SetColorHue(int nStart, int nEnd) = 0;

			/*@function
			******************************************************************
			 功  能：视觉通道的图元的颜色色调。
			 注  意：此接口用于【查表映射】模式;
			 参  数：<wzCategorie> 单个类目名字,当为 nullptr 或 L""时都代表L"";
					 <wzValue> 图元的颜色色调;
			 返回值：<无>;
			------------------------------------------------------------------
			 作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetColorHueEx(const wchar_t* wzCategorie, int nValue) = 0;

			/*@function
			******************************************************************
			* 功  能：用于查表的图元的颜色色调，数组须和 categories 数组等长,每个数组项和 categories 数组项一一对应;
			* 注  意：此接口用于【查表映射】模式;
			* 参  数：<wzValue> 使用“,”分隔的图元的颜色色调值;
			* 返回值：<错误码>;
			------------------------------------------------------------------
			 作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetColorHueEx(const wchar_t* wzValue) = 0;

			/*@function
			******************************************************************
			* 功  能：用于查表的图元的颜色色调，数组须和 categories 数组等长,每个数组项和 categories 数组项一一对应;
			* 注  意：此接口用于【查表映射】模式;
			* 参  数：<vctValue> 图元的颜色色调;
			* 返回值：<无>;
			------------------------------------------------------------------
			 作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetColorHueEx(const std::vector<int>& vctValue) = 0;

			/*@function
			******************************************************************
			* 功  能：用于查表的颜色色调，数组须和 categories 数组等长,每个数组项和 categories 数组项一一对应;
			* 注  意：此接口用于【查表映射】模式;
			* 参  数：<pQueue> 使用字符串表示图元的颜色色调的数据;
			* 返回值：<无>;
			------------------------------------------------------------------
			 作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetColorHueEx(IQueue* pQueue) = 0;

			/*@function
			******************************************************************
			* 功  能：清除设置的颜色色调通道
			* 参  数：<无>;
			* 返回值：<无>;
			------------------------------------------------------------------
			 作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void ClearColorHue() = 0;

		};
	}
}