#pragma once
/***********************************************************************
 * Module:  IVisualMapTarget.h
 * Author:  杨鹏辉
 * Modified: 2022年7月1日 15:02:44
 * Purpose: 目标系列 的视觉样式
 ***********************************************************************/
#include <vector>
#include <string>
#include "Common/ICallback.h"
#include "Options/Common/ICategoryData.h"
#include "Options/GeneralOptions/VisualMap/IVisualMapRange.h"

namespace IIChart
{
	namespace VisualMap
	{
		/*@class
		***********************************************************************
		* 类  名: IVisualMapTarget
		* 修  改: 2022年7月1日 15:02:44
		* 功  能: [目标系列] 的视觉样式
		-----------------------------------------------------------------------
		* 作  者:  YangPenghui 2022-10-26;
		************************************************************************/
		class IVisualMapTarget
		{
		public:

			/*@function
			******************************************************************
			功  能：定义 [在选中范围中] 的视觉元素。（用户可以和 visualMap 组件交互，用鼠标或触摸选择范围）
			参  数：<无>;
			返回值：<IVisualMapRange*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IVisualMapRange* GetInRange() = 0;

			/*@function
			******************************************************************
			功  能：定义 [在选中范围外] 的视觉元素。（用户可以和 visualMap 组件交互，用鼠标或触摸选择范围）
			参  数：<无>;
			返回值：<IVisualMapRange*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IVisualMapRange* GetOutOfRange() = 0;
		};
	}
	
}