#pragma once
/***********************************************************************
 * Module:  IGaugeType.h
 * Author:  杨鹏辉
 * Modified: 2022年7月1日 15:02:44
 * Purpose: 仪表盘
 ***********************************************************************/
#include "Common/IEnum.h"
#include "Common/IFixedQueue.h"
#include "Common/ICallback.h"
#include "Options/Common/IEncode.h"
#include "Options/Common/IBaseArrayElement.h"
#include "Options/Common/ICompactTooltip.h"
#include "Options/GeneralOptions/Series/Gauge/IGaugeTypeAxisLine.h"
#include "Options/GeneralOptions/Series/Gauge/IGaugeTypeData.h"

#include "Options/GeneralOptions/Series/Gauge/IGaugeTypeProgress.h"
#include "Options/GeneralOptions/Series/Gauge/IGaugeTypeSplitLine.h"
#include "Options/GeneralOptions/Series/Gauge/IGaugeTypeAxisTick.h"
#include "Options/GeneralOptions/Series/Gauge/IGaugeTypeAxisLabel.h"
#include "Options/GeneralOptions/Series/Gauge/IGaugeTypePointer.h"
#include "Options/GeneralOptions/Series/Gauge/IGaugeTypeAnchor.h"
#include "Options/GeneralOptions/Series/Gauge/IGaugeTypeItemStyleEx.h"
#include "Options/GeneralOptions/Series/Gauge/IGaugeTypeEmphasis.h"
#include "Options/GeneralOptions/Series/Gauge/IGaugeTypeTitle.h"
#include "Options/GeneralOptions/Series/Gauge/IGaugeTypeDetail.h"
#include "Options/GeneralOptions/Series/Gauge/IGaugeTypeMarkPoint.h"
#include "Options/GeneralOptions/Series/Gauge/IGaugeTypeMarkLine.h"
#include "Options/GeneralOptions/Series/Gauge/IGaugeTypeMarkArea.h"

namespace IIChart
{
	namespace Gauge
	{
		/*@class
		*************************************************************************
		* 类  名: IGaugeType
		* 修  改: 2022年7月1日 15:02:44
		* 功  能: 仪表盘。
		-----------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		************************************************************************/
		class IGaugeType : public IBaseArrayElement
		{
		public:

			/*@function
			*******************************************************************
			功  能:  系列类型;
			参  数:  <无>;
			返回值:  <L"GaugeType">;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual wchar_t* GetType() const = 0;

			/*@function
			*******************************************************************
			功  能:  组件 ID。默认不指定。指定则可用于在 option 或者 API 中引用组件;
			参  数:  <wzValue>;
			返回值:  <无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetId(const wchar_t* wzValue) = 0;
			virtual wchar_t* GetId() const = 0;

			/*@function
			*******************************************************************
			功  能:  系列名称，用于tooltip的显示，legend 的图例筛选，
					 在 setOption 更新数据和配置项时用于指定对应的系列;
			参  数:  <wzValue>;
			返回值:  <无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetName(const wchar_t* wzValue) = 0;
			virtual wchar_t* GetName() const = 0;

			/*@function
			*******************************************************************
			功  能:  从调色盘 option.color 中取色的策略，
			参  数:  <eValue>可取值为：
							 'series'：按照系列分配调色盘中的颜色，同一系列中的所有数据都是用相同的颜色；
							 'data'：按照数据项分配调色盘中的颜色，每个数据项都使用不同的颜色。
			返回值:  <无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetColorBy(EColorBy eValue) = 0;
			virtual EColorBy GetColorBy() const = 0;

			/*@function
			******************************************************************
			功  能：所有图形的 zlevel 值。
			注  意: zlevel用于 Canvas 分层，不同zlevel值的图形会放置在不同的 Canvas 中，
					Canvas 分层是一种常见的优化手段。我们可以把一些图形变化频繁（例如有动画）的
					组件设置成一个单独的zlevel。需要注意的是过多的 Canvas 会引起内存开销的增大，
					在手机端上需要谨慎使用以防崩溃。
					zlevel 大的 Canvas 会放在 zlevel 小的 Canvas 的上面。
			参  数: <nLevel> ;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetZLevel(int nLevel) = 0;
			virtual int  GetZLevel() const = 0;

			/*@function
			******************************************************************
			功  能：组件的所有图形的z值。控制图形的前后顺序。z值小的图形会被z值大的图形覆盖。
			注  意: z相比zlevel优先级更低，而且不会创建新的 Canvas。
			参  数: <nLevel> ;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetZ(int nLevel) = 0;
			virtual int  GetZ() const = 0;

			/*@function
			*******************************************************************
			功  能:  饼图的中心（圆心）坐标，数组的第一项是横坐标，第二项是纵坐标。
					 支持设置成百分比，设置成百分比时第一项是相对于容器宽度，第二项是相对于容器高度。
			参  数:  <nX>;
					 <nY>;
					 <bIsPercentage>;
			返回值:  <无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetCenter(int nX, int nY, bool bIsPercentage = false) = 0;
			virtual void GetCenter(int* pnX, int* pnY, bool* pbIsPercentage) = 0;

			/*@function
			*******************************************************************
			功  能:  饼图的半径。支持设置成百分比，设置成百分比时第一项是相对于
					 容器宽度，第二项是相对于容器高度。
			参  数:  <nValue>;
					 <bIsPercentage>为 true 时，表示外半径为可视区尺寸（容器高宽中较小一项）;
			返回值:  <无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetRadius(int nValue, bool bIsPercentage) = 0;
			virtual void GetRadius(int* pnValue, bool* pbIsPercentage) = 0;

			/*@function
			*******************************************************************
			 功  能：是否启用图例 hover 时的联动高亮。
			 参  数：<eValue>;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetLegendHoverLink(bool bValue) = 0;
			virtual bool GetLegendHoverLink() const = 0;

			/*@function
			*******************************************************************
			 功  能：仪表盘起始角度。圆心 正右手侧为0度，正上方为90度，正左手侧为180度。
			 参  数：<nValue>;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetStartAngle(int nValue) = 0;
			virtual int  GetStartAngle() const = 0;

			/*@function
			*******************************************************************
			 功  能：仪表盘结束角度。
			 参  数：<nValue>;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetEndAngle(int nValue) = 0;
			virtual int  GetEndAngle() const = 0;

			/*@function
			*******************************************************************
			 功  能：仪表盘刻度是否是顺时针增长。
			 参  数：<nValue>;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetClockwise(bool bValue) = 0;
			virtual bool GetClockwise() const = 0;

			/*@function
			*******************************************************************
			功  能：实例化单个数据项，通过此方式可以灵活定制要添加的数据的详图样式，使显示更为细腻丰富。
			注  意：此接口创建的数据项可以作为IFixedQueue的元素
					-- 使用完后需要调用 Release 释放相资源;
					-- IFixedQueue中的元素将由其自动进行内存回收管理;
			参  数：<nValue/fValue> 数据值;
			        <wzName> 数据项名称;
			返回值：IGaugeTypeData*;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IGaugeTypeData* CreateData() = 0;
			virtual IGaugeTypeData* CreateData(int nValue, const wchar_t* wzName = nullptr) = 0;
			virtual IGaugeTypeData* CreateData(float fValue, const wchar_t* wzName = nullptr) = 0;

			/*@function
			*******************************************************************
			* 功  能：清除所有的数据;
			* 参  数：<无>;
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void ClearData() = 0;

			/*@function
			*******************************************************************
			* 功  能：清除指定行的数据;
			* 参  数：<nRowIndex> 指定的行号，第一行为 0;
			* 返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int ClearRow(int nRowIndex) = 0;

			/*@function
			*******************************************************************
			* 功  能：以JSON格式设置此系列数据，原有数据将会被替换。例如：
			* 一维数据格式：
			*     "[7.2, 8.8, 18, 57]"
			* 二维数据格式：
			*     "[[12, 14], [34, 50], [56, 30], [10, 15], [23, 10]]"
			* 注  意：原有的数据将会被替换;
			*         此方法增加的数据元素可是JSON对象,例如：
			*     "[
			*         12,
			*         34,
			*         {value:56, label: {},itemStyle:{}},
			*         57
			*     ]"
			* 参  数：<wzJson> JSON格式的数据;
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetDataWithJson(const wchar_t* wzJson) = 0;

			/*@function
			*******************************************************************
			* 功  能：以 JSON格式显示已添加的数据;
			* 参  数：<无>;
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual wchar_t* GetDataAsJson() = 0;

			/*@function
			*******************************************************************
			* 功  能：向系列中添加数据，新加的数据将在原来数据的后面;
			* 参  数：<nValue/fValue> 数据值;
			*         <wzName> 数据项名称;
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int AddData(IGaugeTypeData* pData) = 0;
			virtual void AddData(int nValue, const wchar_t* wzName = nullptr) = 0;
			virtual void AddData(float fValue, const wchar_t* wzName = nullptr) = 0;

			/*@function
			*******************************************************************
			* 功  能：向系列中添加数据，新加的数据将在原来数据的后面;
			* 注  意：-- 当只有一个轴为类目轴（axis.type 为 'category'）的时候，
			*            使用此类方法增加数据
			*         -- 此方法增加的数据只是一个一组数组;
			*         -- 由于原有的数据没有被消除，此方法会使显示的数据量一直增大
			*            如果没有同时增加相应的坐标轴类目数据 data，图表的显示会出问题;
			* 参  数：<pQueue> 其中的数据类型可同时支持 int | float | wstring | object;
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int AddData(const std::vector<int>& vctValues) = 0;
			virtual int AddData(const std::vector<float>& vctValues) = 0;
			virtual int AddData(const std::vector<std::wstring>& vctValues) = 0;
			virtual int AddData(IFixedQueue* pQueue) = 0;
			virtual int AddData(int* pnValue, int nCount) = 0;
			virtual int AddData(float* pfValue, int nCount) = 0;

			/*@function
			******************************************************************
			* 功  能：向系列中添加数据，新加的数据将在原来数据的后面;
			* 参  数：<wzValue> 以“,”隔开的数据，也可以Json数组，或是Json对象数组;例如：
			*                  1. L"['2012', '2013', '2014', '2015']" // Json 字符串数组;
			*                  2. L"[\"2012\", \"2013\", \"2014\", \"2015\"]" // Json字符串数组;
			*                  3. L"12, 44, 55, 66, 2"
			*                  4. L"'2015', '2016', '2017'"
			*                     L"43.3, 85.8, 93.7"
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int AddData(const wchar_t* wzValue) = 0;

			/*@function
			*******************************************************************
			* 功  能：给系列赋值，系列原来的数据将被覆盖掉;
			* 参  数：<nValue/fValue> 数据值;
			*         <wzName> 数据项名称;
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetData(IGaugeTypeData* pData) = 0;
			virtual void SetData(int nValue, const wchar_t* wzName = nullptr) = 0;
			virtual void SetData(float fValue, const wchar_t* wzName = nullptr) = 0;

			/*@function
			*******************************************************************
			* 功  能：给系列赋值，系列原来的数据将被覆盖掉;
			* 注  意：此方法增加的数据只是一个一组数组;
			* 参  数：<vctValues> 新的数据;
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetData(const std::vector<int>& vctValues) = 0;
			virtual int SetData(const std::vector<float>& vctValues) = 0;
			virtual int SetData(const std::vector<std::wstring>& vctValues) = 0;

			/*@function
			*******************************************************************
			* 功  能：给系列赋值，此值为一个一维数组;
			* 注  意：系列原来的数据将被覆盖掉;
			*         此接口可以方便的实现动态图表显示;
			* 参  数：<pQueue> 其中的数据类型可同时支持 int | float | wstring;
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetData(IFixedQueue* pQueue) = 0;

			/*@function
			******************************************************************
			* 功  能：给系列赋值，系列原来的数据将被覆盖掉;
			* 参  数：<wzValue> 以“,”隔开的数据，也可以Json数组，或是Json对象数组;例如：
			*                  1. L"['2012', '2013', '2014', '2015']" // Json数组;
			*                  2. L"[\"2012\", \"2013\", \"2014\", \"2015\"]" // Json数组;
			*                  3. L"12, 44, 55, 66, 2"
			*                  4. L"'2015', '2016', '2017'" // 每个值为字符串
			*                     L"43.3, 85.8, 93.7"       // 每个值为数字
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetData(const wchar_t* wzValue) = 0;

			/*@function
			*******************************************************************
			* 功  能：取数据拥有的行数;
			* 注  意：此行数据元素个数需要与已添的保持一致，否则图表无法正常显示;
			* 参  数：<无>;
			* 返回值：<行数>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int GetDataRowCount() = 0;

			/*@function
			*******************************************************************
			* 功  能：取数据拥有的行数;
			* 注  意：此行数据元素个数需要与已添的保持一致，否则图表无法正常显示;
			* 参  数：<无>;
			* 返回值：<每行数据元素个数>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int GetDataRowElementCount() = 0;

			/*@function
			*******************************************************************
			* 功  能：向系列中添加一行数据;
			* 注  意：此行数据元素个数需要与已添的保持一致，否则图表无法正常显示;
			* 参  数：<vctValues> 添加的数据;
			* 返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int AddRowData(const std::vector<int>& vctValues) = 0;
			virtual int AddRowData(const std::vector<float>& vctValues) = 0;
			virtual int AddRowData(const std::vector<std::wstring>& vctValues) = 0;
			virtual int AddRowData(IFixedQueue* pQueue) = 0;

			/*@function
			******************************************************************
			* 功  能：向系列中添加一行数据;
			* 参  数：<wzValue> 以“,”隔开的数据，也可以Json数组，或是Json对象数组;例如：
			*                  1. L"['2012', '2013', '2014', '2015']" // Json数组;
			*                  2. L"[\"2012\", \"2013\", \"2014\", \"2015\"]" // Json数组;
			*                  3. L"12, 44, 55, 66, 2"
			*                  4. L"'2015', '2016', '2017'" // 每个值为字符串
			*                     L"43.3, 85.8, 93.7"       // 每个值为数字
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int AddRowData(const wchar_t* wzValue) = 0;

			/*@function
			*******************************************************************
			* 功  能：向系列中添加一行数据;
			* 注  意：此行数据元素个数需要与已添的保持一致，否则图表无法正常显示;
			* 参  数：<pnValue> 添加的数据的首地址;
			*         <nCount>  添加的数据的个数;
			* 返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int AddRowData(int* pnValue, int nCount) = 0;
			virtual int AddRowData(float* pfValue, int nCount) = 0;

			/*@function
			*******************************************************************
			* 功  能：设置指定行的数据，此行原来的数据会被替换掉；
			* 注  意：此行数据元素个数需要与已添的保持一致，否则图表无法正常显示;
			* 参  数：<nRowIndex> 指定行的行号;
			*         <vctValues> ;
			* 返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetRowData(int nRowIndex, const std::vector<int>& vctValues) = 0;
			virtual int SetRowData(int nRowIndex, const std::vector<float>& vctValues) = 0;
			virtual int SetRowData(int nRowIndex, const std::vector<std::wstring>& vctValues) = 0;

			/*@function
			*******************************************************************
			* 功  能：设置指定行的数据，此行原来的数据会被替换掉；
			* 注  意：此行数据元素个数需要与已添的保持一致，否则图表无法正常显示;
			*         此接口可以方便的实现动态图表;
			* 参  数：<nRowIndex> 指定行的行号;
			*         <pQueue> 其中的数据类型可同时支持 int | float | wstring;
			* 返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetRowData(int nRowIndex, IFixedQueue* pQueue) = 0;

			/*@function
			******************************************************************
			* 功  能：设置指定行的数据，此行原来的数据会被替换掉；
			* 注  意：此行数据元素个数需要与已添的保持一致，否则图表无法正常显示;
			* 参  数：<wzValue> 以“,”隔开的数据，也可以Json数组，或是Json对象数组;例如：
			*                  1. L"['2012', '2013', '2014', '2015']" // Json 字符串数组;
			*                  2. L"[\"2012\", \"2013\", \"2014\", \"2015\"]" // Json 字符串数组;
			*                  3. L"12, 44, 55, 66, 2"
			*                  4. L"'2015', '2016', '2017'" // 每个值为字符串
			*                     L"43.3, 85.8, 93.7"       // 每个值为数字
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetRowData(int nRowIndex, const wchar_t* wzValue) = 0;

			/*@function
			*******************************************************************
			* 功  能：设置指定行的数据，此行原来的数据会被替换掉；
			* 注  意：此行数据元素个数需要与已添的保持一致，否则图表无法正常显示;
			* 参  数：<nRowIndex> 指定行的行号;
			*         <pnValue> 添加的数据的首地址;
			*         <nCount>  添加的数据的个数;
			* 返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetRowData(int nRowIndex, int* pnValue, int nCount) = 0;
			virtual int SetRowData(int nRowIndex, float* pfValue, int nCount) = 0;

			/*@function
			******************************************************************
			功  能：最小的数据值，映射到 minAngle。
			参  数: <nValue> ;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetMin(int nValue) = 0;
			virtual int  GetMin() const = 0;

			/*@function
			******************************************************************
			功  能：最大的数据值，映射到 minAngle。
			参  数: <nValue> ;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetMax(int nValue) = 0;
			virtual int  GetMax() const = 0;

			/*@function
			******************************************************************
			功  能：仪表盘刻度的分割段数
			参  数: <nValue> ;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetSplitNumber(int nValue) = 0;
			virtual int  GetSplitNumber() const = 0;

			/*@function
			******************************************************************
			功  能：仪表盘轴线相关配置
			参  数: <无> ;
			返回值：<IGaugeTypeAxisLine*>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IGaugeTypeAxisLine* GetAxisLine() = 0;

			/*@function
			******************************************************************
			功  能：展示当前进度
			参  数: <无> ;
			返回值：<IGaugeTypeProgress*>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IGaugeTypeProgress* GetProgress() = 0;

			/*@function
			******************************************************************
			功  能：分隔线样式
			参  数: <无> ;
			返回值：<IGaugeTypeSplitLine*>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IGaugeTypeSplitLine* GetSplitLine() = 0;

			/*@function
			******************************************************************
			功  能：刻度样式
			参  数: <无> ;
			返回值：<IGaugeTypeAxisTick*>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IGaugeTypeAxisTick* GetAxisTick() = 0;

			/*@function
			******************************************************************
			功  能：刻度标签
			参  数: <无> ;
			返回值：<IGaugeTypeAxisLabel*>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IGaugeTypeAxisLabel* GetAxisLabel() = 0;

			/*@function
			******************************************************************
			功  能：仪表盘指针
			参  数: <无> ;
			返回值：<IGaugeTypePointer*>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IGaugeTypePointer* GetPointer() = 0;

			/*@function
			******************************************************************
			功  能：表盘中指针的固定点
			参  数: <无> ;
			返回值：<IGaugeTypeAnchor*>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IGaugeTypeAnchor* GetAnchor() = 0;

			/*@function
			******************************************************************
			功  能：仪表盘指针样式
			参  数: <无> ;
			返回值：<IGaugeTypeItemStyle*>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IGaugeTypeItemStyle* GetItemStyle() = 0;

			/*@function
			******************************************************************
			功  能：高亮的仪表盘指针样式
			参  数: <无> ;
			返回值：<IGaugeTypeEmphasis*>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IGaugeTypeEmphasis* GetEmphasis() = 0;

			/*@function
			******************************************************************
			功  能：仪表盘标题
			参  数: <无> ;
			返回值：<IGaugeTypeTitle*>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IGaugeTypeTitle* GetTitle() = 0;

			/*@function
			******************************************************************
			功  能：仪表盘详情，用于显示数据。
			参  数: <无> ;
			返回值：<IGaugeTypeDetail*>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IGaugeTypeDetail* GetDetail() = 0;

			/*@function
			******************************************************************
			功  能：图表标注
			参  数: <无> ;
			返回值：<IGaugeTypeMarkPoint*>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IGaugeTypeMarkPoint* GetMarkPoint() = 0;

			/*@function
			******************************************************************
			功  能：图表标线
			参  数: <无> ;
			返回值：<IGaugeTypeMarkLine*>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IGaugeTypeMarkLine* GetMarkLine() = 0;

			/*@function
			******************************************************************
			功  能：图表标域，常用于标记图表中某个范围的数据，例如标出某段时间投放了广告。
			参  数: <无> ;
			返回值：<IGaugeTypeMarkArea*>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IGaugeTypeMarkArea* GetMarkArea() = 0;

			/*@function
			******************************************************************
			功  能：图形是否不响应和触发鼠标事件，默认为 false，即响应和触发鼠标事件。
			参  数: <bValue> ;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetSilent(bool bValue) = 0;
			virtual bool GetSilent() const = 0;

			/*@function
			******************************************************************
			功  能：是否开启动画;
			参  数: <bValue>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetAnimation(bool bValue) = 0;
			virtual bool GetAnimation() const = 0;

			/*@function
			******************************************************************
			功  能：是否开启动画的阈值，当单个系列显示的图形数量大于这个阈值时会关闭动画;
			参  数: <nValue>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetAnimationThreshold(int nValue) = 0;
			virtual int  GetAnimationThreshold() const = 0;

			/*@function
			******************************************************************
			功  能：初始动画的时长;
			参  数: <nValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetAnimationDuration(int nValue) = 0;
			virtual int  GetAnimationDuration() const = 0;

			/*@function
			******************************************************************
			功  能：设置 初始动画的时长 的 JavaScript 回调函数
			注  意：可以通过每个数据返回不同的时长实现更戏剧的初始动画效果，例如：
					animationDuration: function (idx) {
						// 越往后的数据时长越大
						return idx * 100;
					}
			参  数：<wzValue> JavaScript 函数字符串，不能为空;
			返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetAnimationDurationJSFun(const wchar_t* wzValue) = 0;

			/*@function
			******************************************************************
			功  能：设置 初始动画的时长 的回调函数
			注  意：可以通过每个数据返回不同的时长实现更戏剧的初始动画效果，例如：
			参  数：<pCallback> ;
			返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetAnimationDurationCallback(AnimationDurationCallback* pCallback) = 0;

			/*@function
			******************************************************************
			功  能：初始动画的缓动效果;
			参  数: <eValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetAnimationEasing(EAnimationEasing eValue) = 0;
			virtual EAnimationEasing GetAnimationEasing() const = 0;

			/*@function
			******************************************************************
			功  能：初始动画的延迟;
			参  数: <nValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetAnimationDelay(int nValue) = 0;
			virtual int  GetAnimationDelay() const = 0;

			/*@function
			******************************************************************
			功  能：设置 初始动画的延迟 的 JavaScript 回调函数
			注  意：可以通过每个数据返回不同的 delay 时间实现更戏剧的初始动画效果。例如：
					animationDelay: function (idx) {
						// 越往后的数据延迟越大
						return idx * 100;
					}
			参  数：<wzValue> JavaScript 函数字符串，不能为空;
			返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetAnimationDelayJSFun(const wchar_t* wzValue) = 0;

			/*@function
			******************************************************************
			功  能：设置 初始动画的延迟 的回调函数
			注  意：可以通过每个数据返回不同的时长实现更戏剧的初始动画效果
			参  数：<pCallback> ;
			返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetAnimationDelayCallback(AnimationDelayCallback* pCallback) = 0;

			/*@function
			******************************************************************
			功  能：数据更新动画的时长
			注  意：可以通过每个数据返回不同的时长实现更戏剧的初始动画效果
			参  数：<nValue> ;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetAnimationDurationUpdate(int nValue) = 0;
			virtual int  GetAnimationDurationUpdate() const = 0;

			/*@function
			******************************************************************
			功  能：设置 数据更新动画的时长 的 JavaScript 回调函数
			注  意：可以通过每个数据返回不同的时长实现更戏剧的更新动画效果。例如：
					animationDurationUpdate: function (idx) {
						// 越往后的数据延迟越大
						return idx * 100;
					}
			参  数：<wzValue> JavaScript 函数字符串, 不能为空;
			返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetAnimationDurationUpdateJSFun(const wchar_t* wzValue) = 0;

			/*@function
			******************************************************************
			功  能：数据更新动画的时长
			注  意：以通过每个数据返回不同的 delay 时间实现更戏剧的初始动画效果。
			参  数：<nValue> ;
			返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetAnimationDurationUpdateCallback(AnimationDurationUpdateCallback* pCallback) = 0;

			/*@function
			******************************************************************
			功  能：数据更新动画的缓动效果
			参  数：<eValue> ;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetAnimationEasingUpdate(EAnimationEasing eValue) = 0;
			virtual EAnimationEasing GetAnimationEasingUpdate() const = 0;

			/*@function
			******************************************************************
			功  能：数据更新动画的延迟
			参  数：<nValue> ;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetAnimationDelayUpdate(int nValue) = 0;
			virtual int  GetAnimationDelayUpdate() const = 0;

			/*@function
			******************************************************************
			功  能：设置 数据更新动画的延迟 的 JavaScript 回调函数
			注  意：可以通过每个数据返回不同的 delay 时间实现更戏剧的更新动画效果。例如：
					animationDelayUpdate: function (idx) {
						// 越往后的数据延迟越大
						return idx * 100;
					}
			参  数：<wzValue> JavaScript 函数字符串;
			返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetAnimationDelayUpdateJSFun(const wchar_t* wzValue) = 0;

			/*@function
			******************************************************************
			功  能：数据更新动画的延迟
			注  意：以通过每个数据返回不同的 delay 时间实现更戏剧的初始动画效果。
			参  数：<nValue> ;
			返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetAnimationDelayUpdateCallback(AnimationDelayUpdateCallback* pCallback) = 0;

			/*@function
			******************************************************************
			功  能：本系列特定的 tooltip 设定。
			参  数: <无> ;
			返回值：<ICompactTooltip*>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual ICompactTooltip* GetTooltip() = 0;
			
		};
	}

	
}
