#pragma once
/***********************************************************************
 * Module:   IGaugeTypeMarkAreaEmphasis.h
 * Author:   杨鹏辉
 * Modified: 2022年7月1日 15:02:44
 * Purpose:  标域高亮样式。
 ***********************************************************************/
#include "Common/IEnum.h"
#include "Options/GeneralOptions/Series/Gauge/IGaugeTypeItemStyle.h"
#include "Options/GeneralOptions/Series/Gauge/IGaugeTypeMarkAreaLabel.h"

namespace IIChart
{
	namespace Gauge
	{
		/*@class
		*************************************************************************
		* 类  名: IGaugeTypeMarkAreaEmphasis
		* 修  改: 2022年7月1日 15:02:44
		* 功  能: 标域高亮样式。高亮的规则跟随所在系列。
		-----------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		************************************************************************/
		class IGaugeTypeMarkAreaEmphasis
		{
		public:

			/*@function
			*******************************************************************
			功  能：是否关闭高亮状态
			注  意：关闭高亮状态可以在鼠标移到图形上，tooltip 触发，或者图例联动的时候不再触发高亮效果。
					在图形非常多的时候可以关闭以提升交互流畅性
			参  数：<bValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetDisabled(bool bValue) = 0;
			virtual bool GetDisabled() const = 0;

			/*@function
			*******************************************************************
			 功  能：标域高亮时标签的样式
			 参  数：<无>;
			 返回值：<IGaugeTypeMarkAreaLabel*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IGaugeTypeMarkAreaLabel* GetLabel() = 0;

			/*@function
			*******************************************************************
			 功  能：标域高亮时的图形样式
			 参  数：<无>;
			 返回值：<IGaugeTypeItemStyle*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IGaugeTypeItemStyle* GetItemStyle() = 0;
		};
	}
	
}
