#pragma once
/***********************************************************************
 * Module:  IGaugeTypeAxisLineLineStyle.h
 * Author:  杨鹏辉
 * Modified: 2022年7月1日 15:02:44
 * Purpose: 仪表盘轴线样式。
 ***********************************************************************/
#include "Common/IEnum.h"

namespace IIChart
{
	namespace Gauge
	{
		/*@class
		*************************************************************************
		* 类  名: IGaugeTypeAxisLineLineStyle
		* 修  改: 2022年7月1日 15:02:44
		* 功  能: 仪表盘轴线样式。
		-----------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		************************************************************************/
		class IGaugeTypeAxisLineLineStyle
		{
		public:

			/*@function
			*******************************************************************
			 功  能：清除 仪表盘的轴线颜色。
			 参  数：<bValue>;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void ClearColor() = 0;

			/*@function
			*******************************************************************
			 功  能：仪表盘的轴线可以被分成不同颜色的多段。每段的结束位置和颜色可以通过一个数组来表示。
			         color[i][0] 的值代表整根轴线的百分比，应在 0 到 1 之间；color[i][1] 是对应的颜色。
			 参  数：<fValue> 整根轴线的百分比，应在 0 到 1 之间;
			         <wzValue> 用 RGB、RGBA、16进制三种字符串形式设置颜色
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void AddColor(float fValue, const wchar_t* wzValue) = 0;
			virtual void AddColor(float fValue, int nR, int nG, int nB, float fTransparent = 1) = 0;

			/*@function
			*******************************************************************
			 功  能：线宽。
			 参  数：<nValue>;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetWidth(int nValue) = 0;
			virtual int  GetWidth() = 0;

			/*@function
			*******************************************************************
			 功  能：清除 仪表盘的轴线阴影颜色。
			 参  数：<bValue>;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void ClearShadowColor() = 0;

			/*@function
			*******************************************************************
			 功  能：仪表盘的轴线阴影颜色可以被分成不同颜色的多段。每段的结束位置和颜色可以通过一个数组来表示。
					 color[i][0] 的值代表整根轴线的百分比，应在 0 到 1 之间；color[i][1] 是对应的颜色。
			 参  数：<fValue> 整根轴线的百分比，应在 0 到 1 之间;
					 <wzValue> 用 RGB、RGBA、16进制三种字符串形式设置颜色
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void AddShadowColor(float fValue, const wchar_t* wzValue) = 0;
			virtual void AddShadowColor(float fValue, int nR, int nG, int nB, float fTransparent) = 0;

			/*@function
			*******************************************************************
			 功  能：图形阴影的模糊大小。该属性配合 shadowColor,shadowOffsetX, shadowOffsetY 一起设置图形的阴影效果。
			 参  数：<nValue>;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetShadowBlur(int nValue) = 0;
			virtual int GetShadowBlur() const = 0;

			/*@function
			*******************************************************************
			 功  能：阴影水平方向上的偏移距离。
			 参  数：<nValue>;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetShadowOffsetX(int nValue) = 0;
			virtual int GetShadowOffsetX() const = 0;

			/*@function
			*******************************************************************
			 功  能：阴影垂直方向上的偏移距离。
			 参  数：<nValue>;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetShadowOffsetY(int nValue) = 0;
			virtual int GetShadowOffsetY() const = 0;

			/*@function
			*******************************************************************
			 功  能：图形透明度。支持从 0 到 1 的数字，为 0 时不绘制该图形。
			 参  数：<fValue>;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetOpacity(float fValue) = 0;
			virtual float GetOpacity() const = 0;

		};
	}
}