#pragma once
/***********************************************************************
 * Module:   IGaugeTypeMarkLineEmphasis.h
 * Author:   杨鹏辉
 * Modified: 2022年7月1日 15:02:44
 * Purpose:  标线的高亮样式。
 ***********************************************************************/
#include "Options/GeneralOptions/Series/Gauge/IGaugeTypeLineStyle.h"
#include "Options/GeneralOptions/Series/Gauge/IGaugeTypeLabel.h"

namespace IIChart
{
	namespace Gauge
	{
		/*@class
		*************************************************************************
		* 类  名: IGaugeTypeMarkLineEmphasis
		* 修  改: 2022年7月1日 15:02:44
		* 功  能: 标线的高亮样式
		-----------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		************************************************************************/
		class IGaugeTypeMarkLineEmphasis
		{
		public:

			/*@function
			*******************************************************************
			 功  能：是否关闭高亮状态
			 注  意：关闭高亮状态可以在鼠标移到图形上，tooltip 触发，或者图例联动的时候不再触发高亮效果。
					 在图形非常多的时候可以关闭以提升交互流畅性
			 参  数：<无>;
			 返回值：<IGaugeTypeLabel*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetDisabled(bool bValue) = 0;
			virtual bool GetDisabled() const = 0;

			/*@function
			*******************************************************************
			 功  能：标线高亮时标签的样式
			 参  数：<无>;
			 返回值：<IGaugeTypeLabel*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IGaugeTypeLabel* GetLabel() = 0;

			/*@function
			*******************************************************************
			 功  能：标线高亮时标线条的样式
			 参  数：<无>;
			 返回值：<IGaugeTypeLineStyle*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IGaugeTypeLineStyle* GetLineStyle() = 0;
		};
	}
	
}
