#pragma once
/***********************************************************************
 * Module:  IGaugeTypeData.h
 * Author:  杨鹏辉
 * Modified: 2022年7月1日 15:02:44
 * Purpose: 系列中的数据内容数组。数组项可以为单个数值，如：
 *          [12, 34, 56, 10, 23]
 *          如果需要在数据中加入其它维度给 visualMap 组件用来映射到颜色等其它图形属性。
 *          每个数据项也可以是数组，如：
 *          [[12, 14], [34, 50], [56, 30], [10, 15], [23, 10]]
 *          这时候可以将每项数组中的第二个值指定给 visualMap 组件。
 * 
 *          更多时候我们需要指定每个数据项的名称，这时候需要每个项为一个对象：
			[{
				// 数据项的名称
				name: '数据1',
				// 数据项值8
				value: 10
			}, {
				name: '数据2',
				value: 20
			}]
  
           需要对个别内容指定进行个性化定义时：
			[{
				name: '数据1',
				value: 10
			}, {
				// 数据项名称
				name: '数据2',
				value : 56,
				//自定义特殊 tooltip，仅对该数据项有效
				tooltip:{},
				//自定义特殊itemStyle，仅对该item有效
				itemStyle:{}
			}]
 ***********************************************************************/
#include "Common/IEnum.h"
#include "Options/Common/IBaseArrayElement.h"
#include "Options/GeneralOptions/Series/Gauge/IGaugeTypeTitle.h"
#include "Options/GeneralOptions/Series/Gauge/IGaugeTypeItemStyle.h"
#include "Options/GeneralOptions/Series/Gauge/IGaugeTypeDetail.h"

namespace IIChart
{
	namespace Gauge
	{
		/*@class
		*************************************************************************
		* 类  名: IGaugeTypeData
		* 修  改: 2022年7月1日 15:02:44
		* 功  能: 系列中的数据内容数组。数组项可以为单个数值
		-----------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		************************************************************************/
		class IGaugeTypeData : virtual public IBaseArrayElement
		{
		public:

			/*@function
			******************************************************************
			功  能：数据项名称。
			参  数：<wzValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetName(const wchar_t* wzValue) = 0;
			virtual wchar_t* GetName() const = 0;

			/*@function
			******************************************************************
			功  能：单个数据项的整数类型数值。
			        （注意：单个数据项，只会一种类型的数值，不会两种类型同时存在）
			参  数：<wzValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetValue(int nValue) = 0;
			virtual void GetValue(int* pnValue) = 0;

			/*@function
			******************************************************************
			功  能：单个数据项的小数类型数值。
					（注意：单个数据项，只会一种类型的数值，不会两种类型同时存在）
			参  数：<wzValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetValue(float fValue) = 0;
			virtual void GetValue(float* pfValue) = 0;

			/*@function
			*******************************************************************
			 功  能：仪表盘标题。
			 参  数：<无>;
			 返回值：<IGaugeTypeTitle*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IGaugeTypeTitle* GetTitle() = 0;

			/*@function
			*******************************************************************
			 功  能：仪表盘详情，用于显示数据。。
			 参  数：<无>;
			 返回值：<IGaugeTypeDetail*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IGaugeTypeDetail* GetDetail() = 0;

			/*@function
			*******************************************************************
			 功  能：数据项的指针样式。
			 参  数：<无>;
			 返回值：<IGaugeTypeItemStyle*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IGaugeTypeItemStyle* GetItemStyle() = 0;

		};
	}

}