#pragma once
/***********************************************************************
 * Module:  IAxisTick.h
 * Author:  杨鹏辉
 * Modified: 2022年7月1日 15:02:44
 * Purpose:  坐标轴刻度相关设置。
 ***********************************************************************/
#include "Common/IEnum.h"
#include "Options/GeneralOptions/Series/Gauge/IGaugeTypeLineStyle.h"

namespace IIChart
{
	namespace Gauge
	{
		/*@class
		*************************************************************************
		* 类  名: IGaugeTypeAxisTick
		* 修  改: 2022年7月1日 15:02:44
		* 功  能: 刻度样式。
		-----------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		************************************************************************/
		class IGaugeTypeAxisTick
		{
		public:

			/*@function
			*******************************************************************
			 功  能：是否显示刻度。
			 参  数：<bValue>;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetShow(bool bShow) = 0;
			virtual bool GetShow() const = 0;

			/*@function
			*******************************************************************
			 功  能：分隔线之间分割的刻度数。
			 参  数：<nValue>;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetSplitNumber(int nValue) = 0;
			virtual int  GetSplitNumber() const = 0;

			/*@function
			*******************************************************************
			 功  能：分隔线线长。支持相对半径的百分比。
			 参  数：<nValue>;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetLength(int nValue, bool bIsPercentage) = 0;
			virtual void GetLength(int* pnValue, bool* pbIsPercentage) const = 0;

			/*@function
			*******************************************************************
			 功  能：分隔线与轴线的距离。
			 参  数：<nValue>;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetDistance(int nValue) = 0;
			virtual int  GetDistance() const = 0;

			/*@function
			*******************************************************************
			 功  能：分隔线的样式。
			 参  数：<无>;
			 返回值：<IGaugeTypeLineStyle*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IGaugeTypeLineStyle* GetLineStyle() = 0;
		};
	}

	
}
