#pragma once
/***********************************************************************
 * Module:  IGaugeTypeProgress.h
 * Author:  杨鹏辉
 * Modified: 2022年7月1日 15:02:44
 * Purpose: 展示当前进度。
 ***********************************************************************/
#include "Common/IEnum.h"
#include "Options/GeneralOptions/Series/Gauge/IGaugeTypeItemStyle.h"

namespace IIChart
{
	namespace Gauge
	{
		/*@class
		*************************************************************************
		* 类  名: IGaugeTypeProgress
		* 修  改: 2022年7月1日 15:02:44
		* 功  能: 展示当前进度。
		-----------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		************************************************************************/
		class IGaugeTypeProgress
		{
		public:

			/*@function
			*******************************************************************
			 功  能：是否显示进度条。
			 参  数：<bValue>;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetShow(bool bShow) = 0;
			virtual bool GetShow() const = 0;

			/*@function
			*******************************************************************
			 功  能：多组数据时进度条是否重叠。
			 参  数：<bValue>;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetOverlap(bool bValue) = 0;
			virtual bool GetOverlap() const = 0;

			/*@function
			*******************************************************************
			 功  能：进度条宽度。
			 参  数：<nValue>;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetWidth(int nValue) = 0;
			virtual int  GetWidth() const = 0;

			/*@function
			*******************************************************************
			 功  能：是否在两端显示成圆形。
			 参  数：<bValue>;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetRoundCap(bool bValue) = 0;
			virtual bool GetRoundCap() const = 0;

			/*@function
			*******************************************************************
			 功  能：是否裁掉超出部分。
			 参  数：<bShow>;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetClip(bool bValue) = 0;
			virtual bool GetClip() const = 0;

			/*@function
			*******************************************************************
			 功  能：进度条样式。
			 参  数：<无>;
			 返回值：<IGaugeTypeItemStyle*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IGaugeTypeItemStyle* GetItemStyle() = 0;

		};
	}
	
}
