#pragma once
/***********************************************************************
 * Module:   IGaugeTypeAxisLine.h
 * Author:   杨鹏辉
 * Modified: 2022年7月1日 15:02:44
 * Purpose:  仪表盘轴线相关配置。
 ***********************************************************************/
#include "Common/IEnum.h"
#include "Options/GeneralOptions/Series/Gauge/IGaugeTypeAxisLineLineStyle.h"

namespace IIChart
{
	namespace Gauge
	{
		/*@class
		*************************************************************************
		* 类  名: IGaugeTypeAxisLine
		* 修  改: 2022年7月1日 15:02:44
		* 功  能: 仪表盘轴线相关配置。
		-----------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		************************************************************************/
		class IGaugeTypeAxisLine
		{
		public:

			/*@function
			*******************************************************************
			 功  能：是否显示仪表盘轴线。
			 参  数：<bValue>;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetShow(bool bShow) = 0;
			virtual bool GetShow() const = 0;

			/*@function
			*******************************************************************
			 功  能：是否在两端显示成圆形。
			 参  数：<bValue>;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetRoundCap(bool bShow) = 0;
			virtual bool GetRoundCap() const = 0;

			/*@function
			*******************************************************************
			 功  能：仪表盘轴线样式。
			 参  数：<无>;
			 返回值：<IGaugeTypeAxisLineLineStyle*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IGaugeTypeAxisLineLineStyle* GetLineStyle() = 0;
		};
	}
	
}
