#pragma once
/***********************************************************************
 * Module:  IGeo.h
 * Author:  杨鹏辉
 * Modified: 2022年7月1日 15:02:44
 * Purpose: 地图。
	地图主要用于地理区域数据的可视化，配合 visualMap 组件用于展示不同区域的
	人口分布密度等数据。
	多个地图类型相同的系列会在同一地图上显示，这时候使用第一个系列的配置项作
	为地图绘制的配置。
 ***********************************************************************/
#include "Common/IEnum.h"
#include "Common/IQueue.h"
#include "Options/Common/IBaseArrayElement.h"
#include "Options/Common/ICompactTooltip.h"
#include "Options/GeneralOptions/Geo/IGeoProjection.h"
#include "Options/GeneralOptions/Geo/IGeoScaleLimit.h"
#include "Options/GeneralOptions/Geo/IGeoLabel.h"
#include "Options/GeneralOptions/Geo/IGeoItemStyle.h"
#include "Options/GeneralOptions/Geo/IGeoEmphasisEx.h"
#include "Options/GeneralOptions/Geo/IGeoSelect.h"
#include "Options/GeneralOptions/Geo/IGeoRegion.h"

namespace IIChart
{
	namespace Geo
	{
		/*@class
		*************************************************************************
		* 类  名: IGeo
		* 修  改: 2022年7月1日 15:02:44
		* 功  能: 柱状图（或称条形图）是一种通过柱形的高度（横向的情况下则是宽度）来表现数据大小的一种常用图表类型;
		-----------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		************************************************************************/
		class IGeo : virtual public IBaseArrayElement
		{
		public:

			/*@function
			******************************************************************
			* 功  能：组件 ID。默认不指定。指定则可用于在 option 或者 API 中引用组件。
			* 参  数：<wzValue>;
			* 返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetId(const wchar_t* wzValue) = 0;
			virtual wchar_t* GetId() const = 0;

			/*@function
			******************************************************************
			* 功  能：是否显示地理坐标系组件。
			* 参  数：<wzValue>;
			* 返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetShow(bool bValue) = 0;
			virtual bool GetShow()const = 0;

			/*@function
			******************************************************************
			* 功  能：系列名称，用于tooltip的显示，legend 的图例筛选，在 setOption 更新数据和配置项时用于指定对应的系列。
			* 参  数：<wzValue>;
			* 返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetName(const wchar_t* wzValue) = 0;
			virtual wchar_t* GetName() const = 0;

			/*@function
			******************************************************************
			* 功  能：使用 registerMap 注册的地图名称。
			* 参  数：<wzValue>;
			* 返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetMap(const wchar_t* wzValue) = 0;
			virtual wchar_t* GetMap() const = 0;

			/*@function
			******************************************************************
			* 功  能：是否开启鼠标缩放和平移漫游。默认不开启。如果只想要开启缩放或者平移，
			*         可以设置成 'scale' 或者 'move'。设置成 true 为都开启
			* 参  数：<无>;
			* 返回值：<IGeoProjection*>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetRoam(EMapRoam eValue) = 0;
			virtual EMapRoam GetRoam() const = 0;

			/*@function
			******************************************************************
			* 功  能：自定义地图投影，至少需要提供project, unproject两个方法分别用来计算投影后的坐标以及计算投影前的坐标。
			* 参  数：<无>;
			* 返回值：<IGeoProjection*>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IGeoProjection* GetProjection() = 0;

			/*@function
			******************************************************************
			* 功  能：当前视角的中心点
			* 参  数：<nLevel>;
			* 返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetCenter(float nX, float nY, bool bIsPercentage) = 0;
			virtual void GetCenter(float* pnX, float* pnY, bool* pbIsPercentage) = 0;

			/*@function
			******************************************************************
			* 功  能：这个参数用于 scale 地图的长宽比，如果设置了projection则无效。
			*         最终的 aspect 的计算方式是：geoBoundingRect.width / geoBoundingRect.height * aspectScale。
			* 参  数：<nLevel>;
			* 返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetAspectScale(float fValue) = 0;
			virtual float GetAspectScale() const = 0;

			/*@function
			******************************************************************
			功  能：二维数组，定义定位的左上角以及右下角分别所对应的经纬度。例如
			参  数：<nTopLeftX, nTopLeftY>;位左上角经纬度
			        <nBottomRightX, nBottomRigthY>;定位右下角经纬度
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetBoundingCoords(int nTopLeftX, int nTopLeftY, int nBottomRightX, int nBottomRigthY) = 0;


			/*@function
			******************************************************************
			功  能：当前视角的缩放比例。
			参  数：<fValue>
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetZoom(float fValue) = 0;
			virtual float GetZoom() const = 0;

			/*@function
			******************************************************************
			功  能：滚轮缩放的极限控制，通过min, max最小和最大的缩放值，默认的缩放为1。
			参  数：<无>
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IGeoScaleLimit* GetScaleLimit() = 0;

			/*@function
			******************************************************************
			功  能：自定义地区的名称映射,如将关键字"China"映射成“中国”，即
			        AddNameMap(L"China", L"中国");
			参  数：<wzKey> 
			        <wzValue>
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void AddNameMap(const wchar_t* wzKey, const wchar_t* wzValue) = 0;
			virtual void ClearNameMap() = 0;

			/*@function
			******************************************************************
			功  能：默认是 'name'，针对 GeoJSON 要素的自定义属性名称，作为主键用于关联数据点和 GeoJSON 地理要素。 例如：
			参  数：<无>
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetNameProperty(const wchar_t* wzValue) = 0;
			virtual wchar_t* GetNameProperty() const = 0;

			/*@function
			******************************************************************
			功  能：选中模式的配置，表示是否支持多个选中，默认关闭
			参  数：<无>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetSelectedMode(ESelectedMode eValue) = 0;
			virtual ESelectedMode GetSelectedMode() const = 0;

			/*@function
			******************************************************************
			功  能：图形上的文本标签，可用于说明图形的一些数据信息，比如值，名称等。
			参  数：<无>;
			返回值：<IGeoLabel*>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IGeoLabel* GetLabel() = 0;

			/*@function
			******************************************************************
			功  能：地图区域的多边形 图形样式。
			参  数：<无>;
			返回值：<IGeoSelect*>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IGeoItemStyle* GetItemStyle() = 0;

			/*@function
			******************************************************************
			功  能：高亮状态下的多边形和标签样式。
			参  数：<无>;
			返回值：<IGeoEmphasisEx*>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IGeoEmphasisEx* GetEmphasis() = 0;

			/*@function
			******************************************************************
			功  能：选中状态下的多边形和标签样式。
			参  数：<无>;
			返回值：<IGeoSelect*>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IGeoSelect* GetSelect() = 0;

			/*@function
			******************************************************************
			功  能：淡出状态下的多边形和标签样式。
			参  数：<无>;
			返回值：<IGeoBlur*>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IGeoBlur* GetBlur() = 0;

			/*@function
			******************************************************************
			* 功  能：所有图形的 zlevel 值。
			*         zlevel用于 Canvas 分层，不同zlevel值的图形会放置在不同的 Canvas 中，
			*         Canvas 分层是一种常见的优化手段。我们可以把一些图形变化频繁（例如有动画）的
			*         组件设置成一个单独的zlevel。需要注意的是过多的 Canvas 会引起内存开销的增大，
			*         在手机端上需要谨慎使用以防崩溃。
			*         zlevel 大的 Canvas 会放在 zlevel 小的 Canvas 的上面。
			* 参  数：<nLevel>;
			* 返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetZLevel(int nLevel) = 0;
			virtual int GetZLevel() const = 0;

			/*@function
			******************************************************************
			* 功  能：组件的所有图形的z值。控制图形的前后顺序。z值小的图形会被z值大的图形覆盖。
			*         z相比zlevel优先级更低，而且不会创建新的 Canvas。
			* 参  数：<nLevel>;
			* 返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetZ(int nLevel) = 0;
			virtual int GetZ() const = 0;

			/*@function
			******************************************************************
			* 功  能：组件离容器左侧的距离。
			* 参  数：<nValue>;
			*         <bIsPercentage> 为false时，nValue是像 20 这样的具体像素值;
			*                         为true时，nValue是相对于容器高宽的百分比;
			* 返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetLeft(int nValue, bool bIsPercentage) = 0;
			virtual void  GetLeft(int* pnValue, bool* pbIsPercentage)  = 0;

			/*@function
			******************************************************************
			* 功  能：组件离容器左侧的距离。组件会根据相应的位置自动对齐
			* 参  数：<eValue>;
			* 返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetLeft(EAlign eValue) = 0;
			virtual void GetLeft(EAlign* peValue) = 0;

			/*@function
			******************************************************************
			* 功  能：组件离容器上侧的距离。
			* 参  数：<nValue>;
			*         <bIsPercentage> 为false时，nValue是像 20 这样的具体像素值;
			*                         为true时，nValue是相对于容器高宽的百分比;
			* 返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetTop(int nValue, bool bIsPercentage) = 0;
			virtual void  GetTop(int* pnValue, bool* pbIsPercentage) = 0;

			/*@function
			******************************************************************
			* 功  能：组件离容器上侧的距离。
			* 参  数：<nValue>;
			*         <bIsPercentage> 为false时，nValue是像 20 这样的具体像素值;
			*                         为true时，nValue是相对于容器高宽的百分比;
			* 返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetTop(EVerticalAlign eValue) = 0;
			virtual void GetTop(EVerticalAlign* peValue) = 0;

			/*@function
			******************************************************************
			* 功  能：组件离容器右侧的距离。
			* 参  数：<nValue>;
			*         <bIsPercentage> 为false时，nValue是像 20 这样的具体像素值;
			*                         为true时，nValue是相对于容器高宽的百分比;
			* 返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetRight(int nValue, bool bIsPercentage) = 0;
			virtual void GetRight(int* pnValue, bool* pbIsPercentage) = 0;

			/*@function
			******************************************************************
			* 功  能：组件离容器下侧的距离。
			* 参  数：<nValue>;
			*         <bIsPercentage> 为false时，nValue是像 20 这样的具体像素值;
			*                         为true时，nValue是相对于容器高宽的百分比;
			* 返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetBottom(int nValue, bool bIsPercentage) = 0;
			virtual void GetBottom(int* pnValue, bool* pbIsPercentage) = 0;

			/*@function
			******************************************************************
			功  能：layoutCenter 和 layoutSize 提供了除了 left/right/top/bottom/width/height 之外的布局手段。
			        并且保证不超出盒形的范围。此时可以通过 layoutCenter 属性定义地图中心在屏幕中的位置，
					layoutSize 定义地图的大小。
			参  数：<无>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetLayoutCenter(int nX, int nY, bool bIsPercentage) = 0;
			virtual void GetLayoutCenter(int* pnX, int* pnY, bool* pbIsPercentage) = 0;

			/*@function
			******************************************************************
			功  能：地图的大小，见 layoutCenter。支持相对于屏幕宽高的百分比或者绝对的像素大小。
			参  数：<无>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetLayoutSize(int nValue, bool bIsPercentage) = 0;
			virtual void GetLayoutSize(int* pnValue, bool* pbIsPercentage) = 0;


			/*@function
			******************************************************************
			* 功  能：实例化单个数据项，通过此方式可以灵活定制要添加的数据的详图样式，使显示更为细腻丰富。
			* 注  意：此接口创建的数据项可以作为IFixedQueue的元素
			*         -- 使用完后需要调用 Release 释放相资源;
			*         -- IFixedQueue中的元素将由其自动进行内存回收管理;
			* 参  数：<无> ;
			* 返回值：ILineTypeData*;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IGeoRegion* CreateRegion() = 0;

			/*@function
			******************************************************************
			* 功  能：清除所有的数据;
			* 参  数：<无>;
			* 返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void ClearRegion() = 0;

			/*@function
			******************************************************************
			* 功  能：向系列中添加数据，新加的数据将在原来数据的后面;
			* 参  数：<无>;
			* 返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int AddRegion(IGeoRegion* pValue) = 0;

			/*@function
			******************************************************************
			* 功  能：向系列中添加数据，新加的数据将在原来数据的后面;
			* 注  意：-- 此方法增加的数据只是一个一组数组;
			*         -- 由于原有的数据没有被消除，此方法会使显示的数据量一直增大
			*            如果没有同时增加相应的坐标轴类目数据 data，图表的显示会出问题;
			* 参  数：<无>;
			* 返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int AddRegion(IQueue* pQueue) = 0;

			/*@function
			******************************************************************
			* 功  能：给系列赋值，此值为一个一维数组;
			* 注  意：系列原来的数据将被覆盖掉;
			*         此接口可以方便的实现动态图表显示;
			* 参  数：<vctValues> 新的数据;
			* 返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetRegion(IQueue* pQueue) = 0;

			/*@function
			******************************************************************
			* 功  能：图形是否不响应和触发鼠标事件，默认为 false，即响应和触发鼠标事件。
			* 参  数：<bValue>;
			* 返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetSilent(bool bValue) = 0;
			virtual bool GetSilent() const = 0;

			/*@function
			******************************************************************
			* 功  能：本系列特定的 tooltip 设定。
			* 参  数：<无>;
			* 返回值：<ICompactTooltip*>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual ICompactTooltip* GetTooltip() = 0;

		};
	}

	
}
