#pragma once
/***********************************************************************
 * Module:  IGeoScaleLimit.h
 * Author:  杨鹏辉
 * Modified: 2022年7月1日 15:02:44
 * Purpose: 滚轮缩放的极限控制，通过min, max最小和最大的缩放值，默认的缩放为1。
 ***********************************************************************/

namespace IIChart
{
	namespace Geo
	{
		/*@class
		*************************************************************************
		* 类  名: IGeoScaleLimit
		* 修  改: 2022年7月1日 15:02:44
		* 功  能: 滚轮缩放的极限控制，通过min, max最小和最大的缩放值，默认的缩放为1。
		-----------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		************************************************************************/
		class IGeoScaleLimit
		{
		public:
			
			/*@function
			******************************************************************
			功  能：最小的缩放值
			参  数：<nValue> ;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetMin(int nValue) = 0;
			virtual int  GetMin() const = 0;

			/*@function
			******************************************************************
			功  能：最大的缩放值
			参  数：<nValue> ;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetMax(int nValue) = 0;
			virtual int  GetMax() const = 0;

		};
	}
}
