#pragma once
/***********************************************************************
 * Module:   IGeoEmphasisEx.h
 * Author:   杨鹏辉
 * Modified: 2022年7月1日 15:02:44
 * Purpose:  高亮状态下的多边形和标签样式。
 ***********************************************************************/
#include "Common/IEnum.h"
#include "Options/Common/ILineStyle.h"
#include "Options/GeneralOptions/Geo/IGeoLabel.h"
#include "Options/GeneralOptions/Geo/IGeoItemStyle.h"


namespace IIChart
{
	namespace Geo
	{
		/*@class
		*************************************************************************
		* 类  名: IGeoEmphasisEx
		* 修  改: 2022年7月1日 15:02:44
		* 功  能: 高亮状态下的多边形和标签样式。
		-----------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		************************************************************************/
		class IGeoEmphasisEx
		{
		public:

			/*@function
			*******************************************************************
			功  能: 是否关闭高亮状态。
			注  意：关闭高亮状态可以在鼠标移到图形上，tooltip 触发，或者图例联动的时候不再触发高亮效果。
					在图形非常多的时候可以关闭以提升交互流畅性。
			参  数: <bValue>;
			返回值: <无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetDisabled(bool bValue) = 0;
			virtual bool GetDisabled() const = 0;

			/*@function
			*******************************************************************
			功  能: 在高亮图形时，是否高亮其它数据的图形已达到聚焦的效果。
			参  数: <eValue>;
			返回值: <无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetFocus(EFocus eValue) = 0;
			virtual EFocus GetFocus() const = 0;

			/*@function
			******************************************************************
			功  能：高亮时的标签样式。
			参  数：<无>;
			返回值：<IGeoLabel*>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IGeoLabel* GetLabel() = 0;

			/*@function
			******************************************************************
			功  能：高亮时的图形样式。
			参  数：<无>;
			返回值：<IGeoItemStyle*>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IGeoItemStyle* GetItemStyle() = 0;
		};
	}

}
