#pragma once
/***********************************************************************
 * Module:   IGeoSelect.h
 * Author:   杨鹏辉
 * Modified: 2022年7月1日 15:02:44
 * Purpose:  选中状态下的多边形和标签样式。
 ***********************************************************************/
#include "Common/IEnum.h"
#include "Options/Common/ILineStyle.h"
#include "Options/GeneralOptions/Geo/IGeoLabel.h"
#include "Options/GeneralOptions/Geo/IGeoItemStyle.h"


namespace IIChart
{
	namespace Geo
	{
		/*@class
		*************************************************************************
		* 类  名: IGeoSelect
		* 修  改: 2022年7月1日 15:02:44
		* 功  能: 选中状态下的多边形和标签样式
		-----------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		************************************************************************/
		class IGeoSelect
		{
		public:

			/*@function
			*******************************************************************
			功  能: 是否关闭高亮状态。
			参  数: <bValue>;
			返回值: <无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetDisabled(bool bValue) = 0;
			virtual bool GetDisabled() const = 0;

			/*@function
			******************************************************************
			功  能：选中时的标签样式。
			参  数：<无>;
			返回值：<IGeoLabel*>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IGeoLabel* GetLabel() = 0;

			/*@function
			******************************************************************
			功  能：选中时的图形样式。
			参  数：<无>;
			返回值：<IGeoItemStyle*>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IGeoItemStyle* GetItemStyle() = 0;
		};
	}
}
