#pragma once
/***********************************************************************
 * Module:  IGeoRegion.h
 * Author:  杨鹏辉
 * Modified: 2022年7月1日 15:02:44
 * Purpose: 在地图中对特定的区域配置样式。例如：
 
			 regions: [{
				name: '广东',
				itemStyle: {
					areaColor: 'red',
					color: 'red'
				}
			}]

 ***********************************************************************/
#include "Common/IEnum.h"
#include "Options/Common/IBaseArrayElement.h"
#include "Options/Common/ICompactTooltip.h"
#include "Options/GeneralOptions/Geo/IGeoLabel.h"
#include "Options/GeneralOptions/Geo/IGeoItemStyle.h"
#include "Options/GeneralOptions/Geo/IGeoEmphasis.h"
#include "Options/GeneralOptions/Geo/IGeoSelect.h"
#include "Options/GeneralOptions/Geo/IGeoBlur.h"

namespace IIChart
{
	namespace Geo
	{
		/*@class
		*************************************************************************
		* 类  名: IGeoRegion
		* 修  改: 2022年7月1日 15:02:44
		* 功  能: 在地图中对特定的区域配置样式
		-----------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		************************************************************************/
		class IGeoRegion : virtual public IBaseArrayElement
		{
		public:

			/*@function
			******************************************************************
			功  能：地图区域的名称，例如 '广东'，'浙江'。
			参  数：<wzValue>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetName(const wchar_t* wzValue) = 0;
			virtual wchar_t* GetName() const = 0;

			/*@function
			******************************************************************
			功  能：该区域是否选中
			参  数：<bValue>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetSelected(bool bValue) = 0;
			virtual bool GetSelected() const = 0;

			/*@function
			******************************************************************
			功  能：地图区域的多边形 图形样式。
			参  数：<无>;
			返回值：<IGeoItemStyle*>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IGeoItemStyle* GetItemStyle() = 0;

			/*@function
			******************************************************************
			功  能：图形上的文本标签，可用于说明图形的一些数据信息，比如值，名称等。
			参  数：<无>;
			返回值：<IGeoLabel*>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IGeoLabel* GetLabel() = 0;

			/*@function
			******************************************************************
			功  能：高亮状态下的多边形和标签样式。
			参  数：<无>;
			返回值：<IGeoEmphasis*>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IGeoEmphasis* GetEmphasis() = 0;

			/*@function
			******************************************************************
			功  能：选中状态下的多边形和标签样式。
			参  数：<无>;
			返回值：<IGeoSelect*>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IGeoSelect* GetSelect() = 0;

			/*@function
			******************************************************************
			功  能：淡出状态下的多边形和标签样式。
			参  数：<无>;
			返回值：<IGeoBlur*>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IGeoBlur* GetBlur() = 0;

			/*@function
			******************************************************************
			功  能：本系列特定的 tooltip 设定。
			参  数：<无>;
			返回值：<ICompactTooltip*>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual ICompactTooltip* GetTooltip() = 0;
		};
	}

}