#pragma once
/***********************************************************************
 * Module:  IDataArray.h
 * Author:  杨鹏辉
 * Modified: 2022年7月1日 15:02:44
 * Purpose: Declaration of the class IDataArray
 ***********************************************************************/
#include <vector>
#include "Common/IQueue.h"
#include "Common/IFixedQueue.h"
#include "Options/Common/IBaseArrayElement.h"


namespace IIChart
{
	namespace Dataset
	{
		/*@class
		*************************************************************************
		* 类  名: IDatasetSourceDataObject
		* 修  改: 2023年1月10日 15:02:44
		* 功  能: 数据对象（Json对象）
		-----------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		************************************************************************/
		class IDatasetSourceDataObject : virtual public IBaseArrayElement
		{
		public:
			
			/*@function
			******************************************************************
			* 功  能：将数据以 Key-value 的形式，添加到一个数据对象（Json对象）中;
			*        添加后的 Json 如：
			*        {product: 'Matcha Latte', count: 823, score: 95.8}
			* 参  数：<wzKey> 键（key）表明了 维度名;
			*        <wzValue/nValue/fValue> 数值;
			* 返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int Add(const wchar_t* wzKey, const wchar_t* wzValue) = 0;
			virtual int Add(const wchar_t* wzKey, int nValue) = 0;
			virtual int Add(const wchar_t* wzKey, float fValue) = 0;
		};


		/*@class
		*************************************************************************
		* 类  名: IDatasetSource
		* 修  改: 2023年1月10日 15:02:44
		* 功  能: 数据集可以使数据进行单独管理，被多个组件复用，
		*         并且可以自由指定数据到视觉的映射。这在不少场景下能带来使用上的方便,具体：
		*         1. 能够贴近数据可视化常见思维方式：（I）提供数据，（II）指定数据到视觉的映射，从而形成图表
		*         2. 数据和其他配置可以被分离开来。数据常变，其他配置常不变。分开易于分别管理
		*         3. 数据可以被多个系列或者组件复用，对于大数据量的场景，不必为每个系列创建一份数据
		*         4. 支持更多的数据的常用格式，例如二维数组、对象数组等，一定程度上避免使用者为了数据格式而进行转换
		-----------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		************************************************************************/
		class IDatasetSource
		{
		public:

			/*@function
			******************************************************************
			功  能：以 JSON 文件的形式添加数据到 Dataset 中;
			注  意：文件中的数据必须是有效的JSON对象数组或JSON二维数组形式：
			参  数：<wzFile> JSON 文件的路径;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetDataFromFile(const wchar_t* wzFile) = 0;

			/*@function
			*******************************************************************
			* 功  能：以JSON格式设置此系列数据，原有数据将会被替换。例如：
			* 一维数据格式：
			*     "[7.2, 8.8, 18, 57]"
			* 二维数据格式：
			*     "[
			*         [3.4, 4.5, 15, 43],
			*         [4.2, 2.3, 20, 91],
			*         [10.8, 9.5, 30, 18],
			*         [7.2, 8.8, 18, 57]
			*    ]"
			* 注  意：原有的数据将会被替换;
			*         此方法增加的数据元素可是JSON对象,例如：
			*     "[
			*         12,
			*         34,
			*         {value:56, label: {},itemStyle:{}},
			*         57
			*     ]"
			* 参  数：<wzJson> JSON格式的数据;
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetDataWithJson(const wchar_t* wzJson) = 0;

			/*@function
			******************************************************************
			* 功  能：创建 IDatasetSourceDataObject 数据对象，此对象可以增加 对象数组;
			* 参  数：<无>;
			* 返回值：<IDatasetSourceRow*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IDatasetSourceDataObject* CreateDataObject() = 0;

			/*@function
			******************************************************************
			* 功  能：增加一个数据对象，此方法将 Dataset 的数据构造成一个 对象数组;
			* 参  数：<pDataObject>;
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int AddArrayElement(IDatasetSourceDataObject* pDataObject) = 0;

			/*@function
			******************************************************************
			* 功  能：增加一行数据;
			* 参  数：<pRow>;
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int AddRow(IFixedQueue* pRow) = 0;

			/*@function
			******************************************************************
			* 功  能：增加一行数据;
			* 参  数：<pRow>;
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int AddRow(IQueue* pRow) = 0;

			/*@function
			******************************************************************
			* 功  能：增加一行数据;
			* 参  数：<wzValue> 以“,”隔开的数据，也可以Json数组，或是Json对象数组;例如：
			*                  1. L"['product', '2012', '2013', '2014', '2015']" // Json数组;
			*                  2. L"[\"product\", \"2012\", \"2013\", \"2014\", \"2015\"]" // Json数组;
			*                  3. L"12, 44, 55, 66, 2"
			*                  4. L"'product', '2015', '2016', '2017'"
			*                     L"'Matcha Latte', 43.3, 85.8, 93.7"
			* 
			* 
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int AddRow(const wchar_t* wzValue) = 0;

			/*@function
			******************************************************************
			* 功  能：当前已添加的行数;
			* 参  数：<无>;
			* 返回值：<int>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int GetRowCount() = 0;

			/*@function
			******************************************************************
			* 功  能：将数据按行的 key-value 形式，添加到一个数据对象（Json对象）中;
			*        添加后的 Json 如：
			*        [
			*            {product: 'Matcha Latte', count: 823, score: 95.8},
			*            {product: 'Milk Tea', count: 235, score: 81.4},
			*            {product: 'Cheese Cocoa', count: 1042, score: 91.2},
			*            {product: 'Walnut Brownie', count: 988, score: 76.9}
			*        ]
			* 参  数：<nIndex> 对象在数组中的序号，从 0 开始计算;
			*         <wzKey> 键（key）;
			*         <vctValue> 数据数组;
			* 返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int AddData(int nIndex, const wchar_t* wzKey, const wchar_t* wzValue) = 0;
			virtual int AddData(int nIndex, const wchar_t* wzKey, int nValue) = 0;
			virtual int AddData(int nIndex, const wchar_t* wzKey, float fValue) = 0;

			/*@function
			******************************************************************
			* 功  能：将数据按列的 key-value 形式，添加到一个数据对象（Json对象）中;
			*        添加后的 Json 如：
			*        {
			*            'product': ['Matcha Latte', 'Milk Tea', 'Cheese Cocoa', 'Walnut Brownie'],
			*            'count': [823, 235, 1042, 988], 
			*            'score': [95.8, 81.4, 91.2, 76.9] 
			*        }
			* 参  数：<wzKey> 键（key）;
			*        <vctValue> 数据数组;
			* 返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int AddData(const wchar_t* wzKey, const std::vector<std::wstring>& vctValue) = 0;
			virtual int AddData(const wchar_t* wzKey, const std::vector<int>& vctValue) = 0;
			virtual int AddData(const wchar_t* wzKey, const std::vector<float>& vctValue) = 0;

			/*@function
			******************************************************************
			* 功  能：将数据按列的 key-value 形式，添加到一个数据对象（Json对象）中;
			*        添加后的 Json 如：
			*        {
			*            'product': ['Matcha Latte', 'Milk Tea', 'Cheese Cocoa', 'Walnut Brownie'],
			*            'count': [823, 235, 1042, 988],
			*            'score': [95.8, 81.4, 91.2, 76.9]
			*        }
			* 参  数：<wzKey> 键（key）;
			*        <wzValue> 以 "," （英文逗号）隔开的数据，其中每一个元素的类型可以不同，例如：
			*                  1. L"北京,上海,广州,深圳"
			*                  2. L"823,426,658,568"
			* 返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int AddData(const wchar_t* wzKey, const wchar_t* wzValue) = 0;

			/*@function
			******************************************************************
			* 功  能：将数据按列的 key-value 形式，添加到一个数据对象（Json对象）中;
			*        添加后的 Json 如：
			*        {
			*            'product': ['Matcha Latte', 'Milk Tea', 'Cheese Cocoa', 'Walnut Brownie'],
			*            'count': [823, 235, 1042, 988],
			*            'score': [95.8, 81.4, 91.2, 76.9]
			*        }
			* 参  数：<wzKey> 键（key）;
			*        <pData> 数据数组的起始地址;
			*        <nCount> 数组元素的个数;
			* 返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int AddData(const wchar_t* wzKey, const int* pData, int nCount) = 0;
			virtual int AddData(const wchar_t* wzKey, const float* pData, int nCount) = 0;

			/*@function
			******************************************************************
			* 功  能：以 Json 字符串的形式显示已添加的数据;
			* 参  数：<无>;
			* 返回值：<wchar_t*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual wchar_t* GetSource() = 0;
		};
	}



}