#pragma once
/***********************************************************************
 * Module:   ILineTypeAreaStyle.h
 * Author:   杨鹏辉
 * Modified: 2022年7月1日 15:02:44
 * Purpose:  区域填充样式。设置后显示成区域面积图。
 ***********************************************************************/
#include "Common/IEnum.h"

namespace IIChart
{
	namespace Line
	{
		/*@class
		*************************************************************************
		* 类  名: ILineTypeAreaStyle
		* 修  改: 2022年7月1日 15:02:44
		* 功  能: 区域填充样式;
		-----------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		************************************************************************/
		class ILineTypeAreaStyle
		{
		public:
			
			/*@function
			******************************************************************
			功  能：填充的颜色。
			注  意：为颜色值时，可以使用以下形式，
					 1. 可以使用 RGB 表示，比如 'rgb(128, 128, 128)'\
					 2. 如果想要加上 alpha 通道，可以使用 RGBA，比如 'rgba(128, 128, 128, 0.5)'
					 3. 可以使用十六进制格式，比如 '#ccc'
					 4. 可以使用 CSS3 预定义的颜色名称，如'red'，'SlateGray';
			参  数：<wzValue> 为 nullptr 或 L"" 时为不指定;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetColor(const wchar_t* wzValue) = 0;
			virtual wchar_t* GetColor() const = 0;

			/*@function
			******************************************************************
			功  能：填充的颜色。
			参  数：<略>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetColor(int nR, int nG, int nB, float nTransparent = 1) = 0;
			virtual void GetColor(int* pnR, int* pnG, int* pnB, float* pnTransparent) = 0;

			/*@function
			******************************************************************
			功  能：设置填充的颜色，此方式除可设置纯色外还可以设置为渐变色和纹理填充;
			参  数：<pValue>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetColor(IColor* pValue) = 0;

			/*@function
			******************************************************************
			功  能：图形区域的起始位置。默认情况下，图形会从坐标轴轴线到数据间进行填充。
			        如果需要填充的区域是坐标轴最大值到数据间，或者坐标轴最小值到数据间，
					或者某个数值到数据间则可以通过这个配置项进行设置。
			参  数：<eValue>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetOrigin(EOrigin eValue) = 0;
			virtual EOrigin GetOrigin() const = 0;

			/*@function
			******************************************************************
			功  能：图形区域的起始位置。默认情况下，图形会从坐标轴轴线到数据间进行填充。
					如果需要填充的区域是坐标轴最大值到数据间，或者坐标轴最小值到数据间，
					或者某个数值到数据间则可以通过这个配置项进行设置。
			参  数：<nValue>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetOrigin(int nValue) = 0;
			virtual void GetOrigin(int* pnValue) = 0;

			/*@function
			******************************************************************
			功  能：设置阴影颜色。
			注  意：为颜色值时，可以使用以下形式，
					 1. 可以使用 RGB 表示，比如 'rgb(128, 128, 128)'\
					 2. 如果想要加上 alpha 通道，可以使用 RGBA，比如 'rgba(128, 128, 128, 0.5)'
					 3. 可以使用十六进制格式，比如 '#ccc'
					 4. 可以使用 CSS3 预定义的颜色名称，如'red'，'SlateGray';
			参  数：<wzValue> 为 nullptr 或 L"" 时为不指定;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetShadowColor(const wchar_t* wzValue) = 0;
			virtual wchar_t* GetShadowColor() const = 0;

			/*@function
			******************************************************************
			功  能：以 RGBA 方式设置阴影的颜色。
			参  数：<略>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetShadowColor(int nR, int nG, int nB, float nTransparent = 1) = 0;
			virtual void GetShadowColor(int* pnR, int* pnG, int* pnB, float* pnTransparent) = 0;

			/*@function
			******************************************************************
			功  能：设置图形的阴影颜色，此方式除可设置纯色外还可以设置为渐变色和纹理填充;
			参  数：<pValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetShadowColor(IColor* pValue) = 0;

			/*@function
			******************************************************************
			功  能：图形阴影的模糊大小;
			注  意：该属性配合 shadowColor,shadowOffsetX, shadowOffsetY 一起设置图形的阴影效果。
			参  数：<略>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetShadowBlur(int nValue) = 0;
			virtual int GetShadowBlur() const = 0;

			/*@function
			******************************************************************
			功  能：阴影水平方向上的偏移距离。
			参  数：<略>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetShadowOffsetX(int nValue) = 0;
			virtual int GetShadowOffsetX() const = 0;

			/*@function
			******************************************************************
			功  能：阴影垂直方向上的偏移距离。
			参  数：<略>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetShadowOffsetY(int nValue) = 0;
			virtual int GetShadowOffsetY() const = 0;

			/*@function
			******************************************************************
			功  能：图形透明度。支持从 0 到 1 的数字，为 0 时不绘制该图形。
			参  数：<略>;
			返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetOpacity(float nValue) = 0;
			virtual float GetOpacity() const = 0;

		};
	}

}


