#pragma once
/***********************************************************************
 * Module:  ILineType.h
 * Author:  杨鹏辉
 * Modified: 2022年7月1日 15:02:44
 * Purpose: 折线/面积图
	折线图是用折线将各个数据点标志连接起来的图表，用于展现数据的变化
	趋势。可用于直角坐标系和极坐标系上。
	Tip: 设置 areaStyle 后可以绘制面积图。
	Tip: 配合分段型 visualMap 组件可以将折线/面积图通过不同颜色分区间。
 ***********************************************************************/
#include "Common/IEnum.h"
#include "Common/ICallback.h"
#include "Common/IFixedQueue.h"
#include "Options/Common/ILineStyle.h"
#include "Options/Common/IEncode.h"
#include "Options/Common/IBaseArrayElement.h"
#include "Options/GeneralOptions/Series/Line/ILineTypeLabel.h"
#include "Options/GeneralOptions/Series/Line/ILineTypeEndLabel.h"
#include "Options/GeneralOptions/Series/Line/ILineTypeLabelLine.h"
#include "Options/GeneralOptions/Series/Line/ILineTypeLabelLayout.h"
#include "Options/GeneralOptions/Series/Line/ILineTypeItemStyle.h"
#include "Options/GeneralOptions/Series/Line/ILineTypeAreaStyle.h"
#include "Options/GeneralOptions/Series/Line/ILineTypeEmphasis.h"
#include "Options/GeneralOptions/Series/Line/ILineTypeBlur.h"
#include "Options/GeneralOptions/Series/Line/ILineTypeSelect.h"
#include "Options/GeneralOptions/Series/Line/ILineTypeDimensionsData.h"
#include "Options/GeneralOptions/Series/Line/ILineTypeData.h"
#include "Options/GeneralOptions/Series/Line/ILineTypeMarkPoint.h"
#include "Options/GeneralOptions/Series/Line/ILineTypeMarkLine.h"
#include "Options/GeneralOptions/Series/Line/ILineTypeMarkArea.h"
#include "Options/Common/IUniversalTransition.h"
#include "Options/Common/ICompactTooltip.h"

namespace IIChart
{
	namespace Line
	{
		/*@class
		*************************************************************************
		* 类  名: ILineType
		* 修  改: 2022年7月1日 15:02:44
		* 功  能: 折线/面积图;
		-----------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		************************************************************************/
		class ILineType : virtual public IBaseArrayElement
		{
		public:

			/*@function
			*******************************************************************
			功  能:  系列类型;
			参  数:  <无>;
			返回值:  <L"LineType">;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual wchar_t* GetType() const = 0;

			/*@function
			*******************************************************************
			功  能:  组件 ID。默认不指定。指定则可用于在 option 或者 API 中引用组件;
			参  数:  <wzValue>;
			返回值:  <无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetId(const wchar_t* wzValue) = 0;
			virtual wchar_t* GetId() const = 0;

			/*@function
			*******************************************************************
			功  能:  系列名称，用于tooltip的显示，legend 的图例筛选，
			         在 setOption 更新数据和配置项时用于指定对应的系列;
			参  数:  <wzValue>;
			返回值:  <无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetName(const wchar_t* wzValue) = 0;
			virtual wchar_t* GetName() const = 0;

			/*@function
			*******************************************************************
			功  能:  从调色盘 option.color 中取色的策略，
			参  数:  <eValue>可取值为：
			                 'series'：按照系列分配调色盘中的颜色，同一系列中的所有数据都是用相同的颜色；
							 'data'：按照数据项分配调色盘中的颜色，每个数据项都使用不同的颜色。
			返回值:  <无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetColorBy(EColorBy eValue) = 0;
			virtual EColorBy GetColorBy() const = 0;

			/*@function
			*******************************************************************
			功  能:  该系列使用的坐标系，
			参  数:  <eValue>可取值为：
							 'cartesian2d'：使用二维的直角坐标系（也称笛卡尔坐标系），
							                通过 xAxisIndex, yAxisIndex指定相应的坐标轴组件；
							 'polar'：使用极坐标系，通过 polarIndex 指定相应的极坐标组件。
			返回值:  <无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetCoordinateSystem(ECoordinateSystem eValue) = 0;
			virtual ECoordinateSystem GetCoordinateSystem() const = 0;

			/*@function
			*******************************************************************
			功  能:  使用的 x 轴的 index，在单个图表实例中存在多个 x 轴的时候有用，
			参  数:  <nValue>可取值为：
			返回值:  <无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetXAxisIndex(int nValue) = 0;
			virtual int GetXAxisIndex() const = 0;

			/*@function
			*******************************************************************
			功  能:  使用的 y 轴的 index，在单个图表实例中存在多个 y轴的时候有用，
			参  数:  <nValue>可取值为：
			返回值:  <无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetYAxisIndex(int nValue) = 0;
			virtual int GetYAxisIndex() const = 0;

			/*@function
			*******************************************************************
			功  能:  使用的极坐标系的 index，在单个图表实例中存在多个极坐标系的时候有用，
			参  数:  <nValue>可取值为：
			返回值:  <无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetPolarIndex(int nValue) = 0;
			virtual int GetPolarIndex() const = 0;

			/*@function
			*******************************************************************
			 功  能：设置 标记的图形
			 参  数：<nValue>;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetSymbol(ESymbol nValue) = 0;
			virtual ESymbol GetSymbol() const = 0;

			/*@function
			*******************************************************************
			 功  能：用图片设置 标记的图形
			 注  意：本接口参数只能是以下几种形式：
					 1. 图片链接：
					 'image://http://example.website/a/b.png'
					 2. dataURI：
					 'image://data:image/gif;base64,R0lGODlhEAAQAMQAAORHHOVSKudfOulrSOp3WOyDZu6QdvCchPGolfO0o/XBs/fNwfjZ0frl3/zy7////wAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAACH5BAkAABAALAAAAAAQABAAAAVVICSOZGlCQAosJ6mu7fiyZeKqNKToQGDsM8hBADgUXoGAiqhSvp5QAnQKGIgUhwFUYLCVDFCrKUE1lBavAViFIDlTImbKC5Gm2hB0SlBCBMQiB0UjIQA7'
					 3. 矢量路径：（可以参考 https://www.w3.org/TR/SVG/paths.html#PathData）
					 'path://M30.9,53.2C16.8,53.2,5.3,41.7,5.3,27.6S16.8,2,30.9,2C45,2,56.4,13.5,56.4,27.6S45,53.2,30.9,53.2z M30.9,3.5C17.6,3.5,6.8,14.4,6.8,27.6c0,13.3,10.8,24.1,24.101,24.1C44.2,51.7,55,40.9,55,27.6C54.9,14.4,44.1,3.5,30.9,3.5z M36.9,35.8c0,0.601-0.4,1-0.9,1h-1.3c-0.5,0-0.9-0.399-0.9-1V19.5c0-0.6,0.4-1,0.9-1H36c0.5,0,0.9,0.4,0.9,1V35.8z M27.8,35.8 c0,0.601-0.4,1-0.9,1h-1.3c-0.5,0-0.9-0.399-0.9-1V19.5c0-0.6,0.4-1,0.9-1H27c0.5,0,0.9,0.4,0.9,1L27.8,35.8L27.8,35.8z'
			 参  数：<wzValue>图片的 URL 或 dataURI也可以是 Path;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetSymbolImage(const wchar_t* wzValue) = 0;
			virtual wchar_t* GetSymbolImage() const = 0;

			/*@function
			*******************************************************************
			 功  能：设置 标记的图形 的 JavaScript 回调函数
			 注  意：此方法可以让每个数据的图形不一样，回调类型
			         (value: Array|number, params: Object) => string
					 其中第一个参数 value 为 data 中的数据值。第二个参数params 是其它的数据项参数。
			 参  数：<无>;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetSymbolJSFun(const wchar_t* wzValue) = 0;

			/*@function
			*******************************************************************
			 功  能：设置 标记的图形 的 C++ 回调函数
			 注  意：此方法可以让每个数据的图形不一样，回调类型
					 (value: Array|number, params: Object) => string
					 其中第一个参数 value 为 data 中的数据值。第二个参数params 是其它的数据项参数。
			 参  数：<无>;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetSymbolCallback(SymbolCallback* pCallback) = 0;

			/*@function
			*******************************************************************
			 功  能：标记的大小，可以设置成诸如 10 这样单一的数字
			 参  数：<nSize>;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetSymbolSize(int nSize) = 0;
			virtual int GetSymbolSize() const = 0;

			/*@function
			*******************************************************************
			 功  能：标记的大小，可以设置成诸如 10 这样单一的数字
			 参  数：<nHeight>;
			        <nWidth>;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetSymbolSize(int nHeight, int nWidth) = 0;
			virtual void GetSymbolSize(int& nHeight, int& nWidth) = 0;

			/*@function
			*******************************************************************
			 功  能：设置 标记的图形大小 的 JavaScript 回调函数
			 注  意：此方法可以让每个数据的图形大小不一样，回调类型
					 (value: Array|number, params: Object) => number|Array
					 其中第一个参数 value 为 data 中的数据值。第二个参数params 是其它的数据项参数。
			 参  数：<无>;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetSymbolSizeJSFun(const wchar_t* wzValue) = 0;

			/*@function
			*******************************************************************
			 功  能：设置 标记的图形大小 的 C++ 回调函数
			 注  意：此方法可以让每个数据的图形大小不一样，回调类型
					 (value: Array|number, params: Object) => number|Array
					 其中第一个参数 value 为 data 中的数据值。第二个参数params 是其它的数据项参数。
			 参  数：<无>;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetSymbolSizeCallback(SymbolSizeCallback* pCallback) = 0;

			/*@function
			*******************************************************************
			 功  能：标记的旋转角度（而非弧度）,正值表示逆时针旋转。
			 注  意：在 markLine 中当 symbol 为 'arrow' 时会忽略 symbolRotate 强制设置为切线的角度。
			 参  数：<nHeight>;
					<nWidth>;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetSymbolRotate(int nRotate) = 0;
			virtual int GetSymbolRotate() const = 0;

			/*@function
			*******************************************************************
			 功  能：设置 标记数据的旋转角度 的 JavaScript 回调函数
			 注  意：此方法可以让每个数据的旋转角度不一样，回调类型
					 (value: Array|number, params: Object) => number|Array
					 其中第一个参数 value 为 data 中的数据值。第二个参数params 是其它的数据项参数。
			 参  数：<无>;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetSymbolRotateJSFun(const wchar_t* wzValue) = 0;

			/*@function
			*******************************************************************
			 功  能：设置 数据的旋转角度 的 C++ 回调函数
			 注  意：此方法可以让每个数据的旋转角度不一样，回调类型
					 (value: Array|number, params: Object) => number|Array
					 其中第一个参数 value 为 data 中的数据值。第二个参数params 是其它的数据项参数。
			 参  数：<无>;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetSymbolRotateCallback(SymbolRotateCallback* pCallback) = 0;

			/*@function
			*******************************************************************
			 功  能：如果 symbol 是 path:// 的形式，是否在缩放时保持该图形的长宽比。
			 参  数：<bValue>;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetSymbolKeepAspect(bool bValue) = 0;
			virtual bool GetSymbolKeepAspect() const = 0;

			/*@function
			*******************************************************************
			 功  能：标记相对于原本位置的偏移。
			 注  意：默认情况下，标记会居中置放在数据对应的位置
					 但是如果 symbol 是自定义的矢量路径或者图片，就有可能不希望 symbol 居中。
					 这时候可以使用该配置项配置 symbol 相对于原本居中的偏移，此处为绝对的像素值，
			 参  数：<nX> 水平偏移;
					 <nY> 垂直偏移;
					 <bIsPercentage> 默认为false，表示偏移值为像素，否则为百分比;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetSymbolOffset(int nX, int nY, bool bIsPercentage) = 0;
			virtual void GetSymbolOffset(int* pnX, int* pnY, bool* pbIsPercentage) = 0;

			/*@function
			*******************************************************************
			 功  能：是否显示 symbol, 如果 false 则只有在 tooltip hover 的时候显示。
			 参  数：<bValue>;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetShowSymbol(bool bValue) = 0;
			virtual bool GetShowSymbol() const = 0;

			/*@function
			*******************************************************************
			 功  能：是否显示 symbol, 如果 false 则只有在 tooltip hover 的时候显示。
			 参  数：<eValue>;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetShowAllSymbol(EShowAllSymbol eValue) = 0;
			virtual EShowAllSymbol GetShowAllSymbol() const = 0;

			/*@function
			*******************************************************************
			 功  能：是否启用图例 hover 时的联动高亮。
			 参  数：<eValue>;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetLegendHoverLink(bool bValue) = 0;
			virtual bool GetLegendHoverLink() const = 0;

			/*@function
			*******************************************************************
			 功  能：数据堆叠，同个类目轴上系列配置相同的 stack 值可以堆叠放置。
			 注  意：目前 stack 只支持堆叠于 'value' 和 'log' 类型的类目轴上，不支
			        持 'time' 和 'category' 类型的类目轴。
			 参  数：<wzValue>;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetStack(const wchar_t* wzValue) = 0;
			virtual wchar_t* GetStack() const = 0;

			/*@function
			*******************************************************************
			 功  能：堆积数值的策略，前提是stack属性已被设置。
			 参  数：<eValue>;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetStackStrategy(EStackStrategy eValue) = 0;
			virtual EStackStrategy GetStackStrategy() const = 0;

			/*@function
			*******************************************************************
			 功  能：鼠标悬浮时在图形元素上时鼠标的样式是什么。同 CSS 的 cursor。
			 参  数：<eValue>;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetCursor(const wchar_t* wzValue) = 0;
			virtual wchar_t* GetCursor() const = 0;

			/*@function
			*******************************************************************
			 功  能：是否连接空数据。
			 参  数：<bValue>;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetConnectNulls(bool bValue) = 0;
			virtual bool GetConnectNulls() const = 0;

			/*@function
			*******************************************************************
			 功  能：是否裁剪超出坐标系部分的图形，具体裁剪效果根据系列决定：
			        裁掉所有超出坐标系的折线部分，拐点图形的逻辑按照散点图处理
					除了自定义系列，其它系列的默认值都为 true，及开启裁剪，如果你觉得
					不想要裁剪的话，可以设置成 false 关闭。
			 参  数：<bValue>;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetClip(bool bValue) = 0;
			virtual bool GetClip() const = 0;

			/*@function
			*******************************************************************
			 功  能：线条和区域面积是否触发事件。
			 参  数：<bValue>;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetTriggerLineEvent(bool bValue) = 0;
			virtual bool GetTriggerLineEvent() const = 0;

			/*@function
			*******************************************************************
			 功  能：是否是阶梯线图。可以设置为 true 显示成阶梯线图;
			 参  数：<bValue>;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetStep(bool bValue) = 0;
			virtual bool GetStep() const = 0;

			/*@function
			*******************************************************************
			功  能：图形上的文本标签，可用于说明图形的一些数据信息，比如值，名称等。
			参  数：<无>;
			返回值：<ILineTypeLabel*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual ILineTypeLabel* GetLabel() = 0;

			/*@function
			*******************************************************************
			功  能：折线端点的标签。
			参  数：<无>;
			返回值：<ILineTypeEndLabel*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual ILineTypeEndLabel* GetEndLabel() = 0;

			/*@function
			*******************************************************************
			功  能：标签的视觉引导线配置。
			参  数：<无>;
			返回值：<ILineTypeLabelLine*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual ILineTypeLabelLine* GetLabelLine() = 0;

			/*@function
			*******************************************************************
			功  能：标签的统一布局配置。
			参  数：<无>;
			返回值：<ILineTypeLabelLayout*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual ILineTypeLabelLayout* GetLabelLayout() = 0;

			/*****************************************************************
			 功  能：标签的统一布局配置。该配置项是在每个系列默认的标签布局基础上，
					 统一调整标签的(x, y)位置，标签对齐等属性以实现想要的标签布局效果。
			 注  意：回调函数格式：
					(params: Object) => Object
					参数 params 格式如下：
					{
						// 标签对应数据的 dataIndex
						dataIndex: number
						// 标签对应的数据类型，只在关系图中会有 node 和 edge 数据类型的区分
						dataType?: string
						// 标签对应的系列的 index
						seriesIndex: number
						// 标签显示的文本
						text: string
						// 默认的标签的包围盒，由系列默认的标签布局决定
						labelRect: {x: number, y: number, width: number, height: number}
						// 默认的标签水平对齐
						align: 'left' | 'center' | 'right'
						// 默认的标签垂直对齐
						verticalAlign: 'top' | 'middle' | 'bottom'
						// 标签所对应的数据图形的包围盒，可用于定位标签位置
						rect: {x: number, y: number, width: number, height: number}
						// 默认引导线的位置，目前只有饼图(pie)和漏斗图(funnel)有默认标签位置
						// 如果没有该值则为 null
						labelLinePoints?: number[][]
					}
					返回值是一个 JavaScript 对象，其格式如下
					{
						// 是否隐藏重叠的标签。
						hideOverlap: boolean
						// 在标签重叠的时候是否挪动标签位置以防止重叠,目前支持配置为：
						//     'shiftX' 水平方向依次位移，在水平方向对齐时使用
						//     'shiftY' 垂直方向依次位移，在垂直方向对齐时使用
						moveOverlap?: string
						// 标签的 x 位置。支持绝对的像素值或者'20%'这样的相对值。
						x: number | string
						// 标签的 y 位置。支持绝对的像素值或者'20%'这样的相对值。
						y: number | string
						// 标签在 x 方向上的像素偏移。可以和x一起使用。
						dx: number
						// 标签在 y 方向上的像素偏移。可以和y一起使用
						dy: number
						// 标签显示的宽度。可以配合overflow使用控制标签显示在固定宽度内
						width: number
						// 标签显示的高度
						height: number
						// 标签水平对齐方式。可以设置'left', 'center', 'right'。
						align: string
						// 标签垂直对齐方式。可以设置'top', 'middle', 'bottom'。
						verticalAlign: string
						// The text size of the label.
						fontSize: number
						// 标签是否可以允许用户通过拖拽二次调整位置。
						draggable: boolean
						// 标签引导线三个点的位置。格式为：
						//     [[x, y], [x, y], [x, y]]
						//     在饼图中常用来微调已经计算好的引导线，其它情况一般不建议设置。
						labelLinePoints:Array
						// 标签所对应的数据图形的包围盒，可用于定位标签位置
						rect: {x: number, y: number, width: number, height: number}
						// 默认引导线的位置，目前只有饼图(pie)和漏斗图(funnel)有默认标签位置
						// 如果没有该值则为 null
						labelLinePoints?: number[][]
					}
					更详细说明，可能参考：https://echarts.apache.org/zh/option.html#series-line.labelLine.lineStyle.color
			 参  数：<wzValue> 字符串模板;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetLabelLayoutJSFun(const wchar_t* wzValue) = 0;

			/*@function
			*******************************************************************
			功  能：折线拐点标志的样式。
			参  数：<无>;
			返回值：<ILineTypeItemStyle*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual ILineTypeItemStyle* GetItemStyle() = 0;

			/*@function
			*******************************************************************
			功  能：线条样式。
			注  意：修改 lineStyle 中的颜色不会影响图例颜色，如果需要图例颜色和折线图颜色一致，
			       需修改 itemStyle.color，线条颜色默认也会取该颜色。
			参  数：<无>;
			返回值：<ILineStyle*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual ILineStyle* GetLineStyle() = 0;

			/*@function
			*******************************************************************
			功  能：区域填充样式。设置后显示成区域面积图。
			参  数：<无>;
			返回值：<ILineTypeAreaStyle*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual ILineTypeAreaStyle* GetAreaStyle() = 0;

			/*@function
			*******************************************************************
			功  能：折线图的高亮状态。
			参  数：<无>;
			返回值：<ILineTypeEmphasis*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual ILineTypeEmphasis* GetEmphasis() = 0;

			/*@function
			*******************************************************************
			功  能：折线图的淡出状态。
			参  数：<无>;
			返回值：<ILineTypeBlur*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual ILineTypeBlur* GetBlur() = 0;

			/*@function
			*******************************************************************
			功  能：折线图的选中状态。
			参  数：<无>;
			返回值：<ILineTypeSelect*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual ILineTypeSelect* GetSelect() = 0;

			/*@function
			*******************************************************************
			功  能：阶梯线图类型。
			参  数：<eValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetStepType(EStepType eValue) = 0;
			virtual EStepType GetStepType() const = 0;

			/*@function
			*******************************************************************
			功  能：选中模式的配置，表示是否支持多个选中，默认关闭。
			参  数：<eValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetSelectMode(ESelectedMode eValue) = 0;
			virtual ESelectedMode GetSelectMode() const = 0;

			/*@function
			*******************************************************************
			功  能：表示是否开启平滑处理。
			参  数：<bValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetSmooth(bool bValue) = 0;
			virtual void GetSmooth(bool* pbValue) const = 0;

			/*@function
			*******************************************************************
			功  能：表示平滑程度，越小表示越接近折线段，反之则反。设为 true 时相当于设为 0.5。
			参  数：<fValue> 取值范围 0 到 1;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int  SetSmooth(float fValue) = 0;
			virtual void GetSmooth(float* pfValue) const = 0;

			/*@function
			*******************************************************************
			功  能：折线平滑后是否在一个维度上保持单调性
			参  数：<eValue> ;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetSmoothMonotone(ESmoothMonotone eValue) = 0;
			virtual ESmoothMonotone GetSmoothMonotone() const = 0;

			/*@function
			*******************************************************************
			功  能：折线图在数据量远大于像素点时候的降采样策略，开启后可以有效的优化图表的绘制效率，
			       默认关闭，也就是全部绘制不过滤数据点。
			参  数：<eValue> ;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetSampling(ESampling eValue) = 0;
			virtual ESampling GetSampling() const = 0;

			/*@function
			*******************************************************************
			* 功  能：清空 DimensionsData 数据;
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void ClearDimensionsData() = 0;

			/*@function
			*******************************************************************
			* 功  能：使用 dimensions 定义 series.data 或者 dataset.source 的每个维度的信息。
			* 注  意：此接口创建的数据项可以作为IFixedQueue的元素
			*         -- 使用完后需要调用 Release 释放相资源;
			*         -- IFixedQueue中的元素将由其自动进行内存回收管理;
			* 参  数：<wzName> 名称;
			*         <eType> 类型;
			*         <wzDisplayName> 数据描述;
			* 返回值：ILineTypeDimensionsData*;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual ILineTypeDimensionsData* CreateDimensionsData() = 0;
			virtual ILineTypeDimensionsData* CreateDimensionsData(const wchar_t* wzName, EDDTypeValue eType, const wchar_t* wzDisplayName = nullptr) = 0;
			
			/*@function
			*******************************************************************
			* 功  能：添加纬度的值，如果此维度不想给出定义，则使用 nullptr 即可;
			* 参  数：<wzName> 名称;
			*         <eType> 类型;
			*         <wzDisplayName> 数据描述;
			* 返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int AddDimensionsData(ILineTypeDimensionsData* pData) = 0;
			virtual int AddDimensionsData(const wchar_t* wzName, EDDTypeValue eType, const wchar_t* wzDisplayName = nullptr) = 0;

			/*@function
			*******************************************************************
			* 功  能：在原来的 dimensions 数据后追加新数据;
			*         每个纬度的值之间使用“,”分隔;如：“date,open,close,highest,lowest”
			* 参  数：<wzValue> 使用“,”分隔的dimensions;
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int AddDimensions(const wchar_t* wzValue) = 0;

			/*@function
			*******************************************************************
			* 功  能：在原来的 dimensions 数据后追加新数据;
			* 参  数：<vctValue> dimensions 数据;
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int AddDimensions(const std::vector<std::wstring>& vctValue) = 0;

			/*@function
			*******************************************************************
			* 功  能：使用 dimensions 定义 series.data 或者 dataset.source 的每个维度的信息。
			* 注  意：在原来的 dimensions 数据后追加新数据;
			*         此接口可以方便的实现动态图表显示;
			* 参  数：<pQueue> 新的数据;
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int AddDimensions(IFixedQueue* pQueue) = 0;

			/*@function
			*******************************************************************
			* 功  能：使用 dimensions 定义 series.data 或者 dataset.source 的每个维度的信息。
			*         每个纬度的值之间使用“,”分隔;如：“date,open,close,highest,lowest”
			* 参  数：<wzValue> 使用“,”分隔的dimensions;
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetDimensions(const wchar_t* wzValue) = 0;

			/*@function
			*******************************************************************
			* 功  能：使用 dimensions 定义 series.data 或者 dataset.source 的每个维度的信息。
			* 参  数：<vctValue> dimensions 数据;
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetDimensions(const std::vector<std::wstring>& vctValue) = 0;

			/*@function
			*******************************************************************
			* 功  能：使用 dimensions 定义 series.data 或者 dataset.source 的每个维度的信息。
			* 注  意：原来的 dimensions 数据将被覆盖掉;
			*         此接口可以方便的实现动态图表显示;
			* 参  数：<pQueue> 新的数据;
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetDimensions(IFixedQueue* pQueue) = 0;

			/*@function
			*******************************************************************
			* 功  能：定义 data 的哪个维度被编码成什么
			* 参  数：<无> ;
			* 返回值：IEncode*;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IEncode* GetEncode() = 0;

			/*@function
			*******************************************************************
			功  能：当使用 dataset 时，seriesLayoutBy 指定了 dataset 中用行还是列对应到系列上，
			        也就是说，系列“排布”到 dataset 的行还是列上。
			参  数：<eValue> ;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetSeriesLayoutBy(ESeriesLayoutBy eValue) = 0;
			virtual ESeriesLayoutBy GetSeriesLayoutBy() const = 0;

			/*@function
			*******************************************************************
			功  能：如果 series.data 没有指定，并且 dataset 存在，那么就会使用 dataset。
				   datasetIndex 指定本系列使用那个 dataset。
			参  数：<nValue> ;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetDatasetIndex(int nValue) = 0;
			virtual int  GetDatasetIndex() const = 0;

			/*@function
			*******************************************************************
			功  能：该系列所有数据共有的组 ID。组 ID 会被用于分类数据，并在全局过渡动画中决定如何进行合并和分裂动画。
				   如果你使用了dataset组件来表达数据，推荐使用encode.itemGroupID来指定哪个维度被编码为组 ID。
			参  数：<wzValue> ;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetDataGroupId(const wchar_t* wzValue) = 0;
			virtual wchar_t* GetDataGroupId() const = 0;

			/*@function
			*******************************************************************
			功  能：实例化单个数据项，通过此方式可以灵活定制要添加的数据的详图样式，使显示更为细腻丰富。
			注  意：此接口创建的数据项可以作为IFixedQueue的元素
			        -- 使用完后需要调用 Release 释放相资源;
			        -- IFixedQueue中的元素将由其自动进行内存回收管理;
			参  数：<无> ;
			返回值：ILineTypeData*;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual ILineTypeData* CreateData() = 0;

			/*@function
			*******************************************************************
			* 功  能：清除所有的数据;
			* 参  数：<无>;
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void ClearData() = 0; 

			/*@function
			*******************************************************************
			* 功  能：清除指定行的数据;
			* 参  数：<nRowIndex> 指定的行号，第一行为 0;
			* 返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int ClearRow(int nRowIndex) = 0;

			/*@function
			*******************************************************************
			* 功  能：以JSON格式设置此系列数据，原有数据将会被替换。例如：
			* 一维数据格式：
			*     "[7.2, 8.8, 18, 57]"
			* 二维数据格式：
			*     "[
			*         [3.4, 4.5, 15, 43],
			*         [4.2, 2.3, 20, 91],
			*         [10.8, 9.5, 30, 18],
			*         [7.2, 8.8, 18, 57]
			*    ]"
			* 注  意：原有的数据将会被替换;
			*         此方法增加的数据元素可是JSON对象,例如：
			*     "[
			*         12,
			*         34,
			*         {value:56, label: {},itemStyle:{}},
			*         57
			*     ]"
			* 参  数：<wzJson> JSON格式的数据;
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetDataWithJson(const wchar_t* wzJson) = 0;

			/*@function
			*******************************************************************
			* 功  能：以 JSON格式显示已添加的数据;
			* 参  数：<无>;
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual wchar_t* GetDataAsJson() = 0;

			/*@function
			*******************************************************************
			* 功  能：向系列中添加数据，新加的数据将在原来数据的后面;
			* 注  意：-- 当只有一个轴为类目轴（axis.type 为 'category'）的时候，
			*            使用此类方法增加数据
			*         -- 此方法增加的数据只是一个一组数组;
			*         -- 由于原有的数据没有被消除，此方法会使显示的数据量一直增大
			*            如果没有同时增加相应的坐标轴类目数据 data，图表的显示会出问题;
			* 参  数：<pQueue> 其中的数据类型可同时支持 int | float | wstring | object;
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int AddData(const std::vector<int>& vctValues) = 0;
			virtual int AddData(const std::vector<float>& vctValues) = 0;
			virtual int AddData(const std::vector<std::wstring>& vctValues) = 0;
			virtual int AddData(IFixedQueue* pQueue) = 0;
			virtual int AddData(int* pnValue, int nCount) = 0;
			virtual int AddData(float* pfValue, int nCount) = 0;

			/*@function
			******************************************************************
			* 功  能：向系列中添加数据，新加的数据将在原来数据的后面;
			* 参  数：<wzValue> 以“,”隔开的数据，也可以Json数组，或是Json对象数组;例如：
			*                  1. L"['2012', '2013', '2014', '2015']" // Json数组;
			*                  2. L"[\"2012\", \"2013\", \"2014\", \"2015\"]" // Json数组;
			*                  3. L"12, 44, 55, 66, 2"
			*                  4. L"'2015', '2016', '2017'"
			*                     L"43.3, 85.8, 93.7"
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int AddData(const wchar_t* wzValue) = 0;
			
			/*@function
			*******************************************************************
			* 功  能：给系列赋值，系列原来的数据将被覆盖掉;
			* 注  意：此方法增加的数据只是一个一组数组;
			* 参  数：<vctValues> 新的数据;
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetData(const std::vector<int>& vctValues) = 0;
			virtual int SetData(const std::vector<float>& vctValues) = 0;
			virtual int SetData(const std::vector<std::wstring>& vctValues) = 0;

			/*@function
			*******************************************************************
			* 功  能：给系列赋值，此值为一个一维数组;
			* 注  意：系列原来的数据将被覆盖掉;
			*         此接口可以方便的实现动态图表显示;
			* 参  数：<pQueue> 其中的数据类型可同时支持 int | float | wstring;
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetData(IFixedQueue* pQueue) = 0;
					
			/*@function
			******************************************************************
			* 功  能：给系列赋值，系列原来的数据将被覆盖掉;
			* 参  数：<wzValue> 以“,”隔开的数据，也可以Json数组，或是Json对象数组;例如：
			*                  1. L"['2012', '2013', '2014', '2015']" // Json数组;
			*                  2. L"[\"2012\", \"2013\", \"2014\", \"2015\"]" // Json数组;
			*                  3. L"12, 44, 55, 66, 2"
			*                  4. L"'2015', '2016', '2017'" // 每个值为字符串
			*                     L"43.3, 85.8, 93.7"       // 每个值为数字
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetData(const wchar_t* wzValue) = 0;

			/*@function
			*******************************************************************
			* 功  能：取数据拥有的行数;
			* 注  意：此行数据元素个数需要与已添的保持一致，否则图表无法正常显示;
			* 参  数：<无>;
			* 返回值：<行数>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int GetDataRowCount() = 0;

			/*@function
			*******************************************************************
			* 功  能：取数据拥有的行数;
			* 注  意：此行数据元素个数需要与已添的保持一致，否则图表无法正常显示;
			* 参  数：<无>;
			* 返回值：<每行数据元素个数>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int GetDataRowElementCount() = 0;

			/*@function
			*******************************************************************
			* 功  能：向系列中添加一行数据;
			* 注  意：此行数据元素个数需要与已添的保持一致，否则图表无法正常显示;
			* 参  数：<vctValues> 添加的数据;
			* 返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int AddRowData(const std::vector<int>& vctValues) = 0;
			virtual int AddRowData(const std::vector<float>& vctValues) = 0;
			virtual int AddRowData(const std::vector<std::wstring>& vctValues) = 0;
			virtual int AddRowData(IFixedQueue* pQueue) = 0;

			/*@function
			******************************************************************
			* 功  能：向系列中添加一行数据;
			* 参  数：<wzValue> 以“,”隔开的数据，也可以Json数组，或是Json对象数组;例如：
			*                  1. L"['2012', '2013', '2014', '2015']" // Json数组;
			*                  2. L"[\"2012\", \"2013\", \"2014\", \"2015\"]" // Json数组;
			*                  3. L"12, 44, 55, 66, 2"
			*                  4. L"'2015', '2016', '2017'" // 每个值为字符串
			*                     L"43.3, 85.8, 93.7"       // 每个值为数字
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int AddRowData(const wchar_t* wzValue) = 0;

			/*@function
			*******************************************************************
			* 功  能：向系列中添加一行数据;
			* 注  意：此行数据元素个数需要与已添的保持一致，否则图表无法正常显示;
			* 参  数：<pnValue> 添加的数据的首地址;
			*         <nCount>  添加的数据的个数;
			* 返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int AddRowData(int* pnValue, int nCount) = 0;
			virtual int AddRowData(float* pfValue, int nCount) = 0;

			/*@function
			*******************************************************************
			* 功  能：设置指定行的数据，此行原来的数据会被替换掉；
			* 注  意：此行数据元素个数需要与已添的保持一致，否则图表无法正常显示;
			* 参  数：<nRowIndex> 指定行的行号;
			*         <vctValues> ;
			* 返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetRowData(int nRowIndex, const std::vector<int>& vctValues) = 0;
			virtual int SetRowData(int nRowIndex, const std::vector<float>& vctValues) = 0;
			virtual int SetRowData(int nRowIndex, const std::vector<std::wstring>& vctValues) = 0;

			/*@function
			*******************************************************************
			* 功  能：设置指定行的数据，此行原来的数据会被替换掉；
			* 注  意：此行数据元素个数需要与已添的保持一致，否则图表无法正常显示;
			*         此接口可以方便的实现动态图表;
			* 参  数：<nRowIndex> 指定行的行号;
			*         <pQueue> 其中的数据类型可同时支持 int | float | wstring;
			* 返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetRowData(int nRowIndex, IFixedQueue* pQueue) = 0;

			/*@function
			******************************************************************
			* 功  能：设置指定行的数据，此行原来的数据会被替换掉；
			* 注  意：此行数据元素个数需要与已添的保持一致，否则图表无法正常显示;
			* 参  数：<wzValue> 以“,”隔开的数据，也可以Json数组，或是Json对象数组;例如：
			*                  1. L"['2012', '2013', '2014', '2015']" // Json数组;
			*                  2. L"[\"2012\", \"2013\", \"2014\", \"2015\"]" // Json数组;
			*                  3. L"12, 44, 55, 66, 2"
			*                  4. L"'2015', '2016', '2017'" // 每个值为字符串
			*                     L"43.3, 85.8, 93.7"       // 每个值为数字
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetRowData(int nRowIndex, const wchar_t* wzValue) = 0;

			/*@function
			*******************************************************************
			* 功  能：设置指定行的数据，此行原来的数据会被替换掉；
			* 注  意：此行数据元素个数需要与已添的保持一致，否则图表无法正常显示;
			* 参  数：<nRowIndex> 指定行的行号;
			*         <pnValue> 添加的数据的首地址;
			*         <nCount>  添加的数据的个数;
			* 返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetRowData(int nRowIndex, int* pnValue, int nCount) = 0;
			virtual int SetRowData(int nRowIndex, float* pfValue, int nCount) = 0;

			/*@function
			*******************************************************************
			功  能：图表标注
			参  数：<无> 
			返回值：<ILineTypeMarkPoint*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual ILineTypeMarkPoint* GetMarkPoint() = 0;

			/*@function
			*******************************************************************
			功  能：图表标线
			参  数：<无>
			返回值：<ILineTypeMarkLine*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual ILineTypeMarkLine* GetMarkLine() = 0;

			/*@function
			*******************************************************************
			功  能：图表标域，常用于标记图表中某个范围的数据，例如标出某段时间投放了广告。
			参  数：<无>
			返回值：<ILineTypeMarkArea*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual ILineTypeMarkArea* GetMarkArea() = 0;

			/*@function
			******************************************************************
			功  能：所有图形的 zlevel 值。
			注  意: zlevel用于 Canvas 分层，不同zlevel值的图形会放置在不同的 Canvas 中，
					Canvas 分层是一种常见的优化手段。我们可以把一些图形变化频繁（例如有动画）的
					组件设置成一个单独的zlevel。需要注意的是过多的 Canvas 会引起内存开销的增大，
					在手机端上需要谨慎使用以防崩溃。
					zlevel 大的 Canvas 会放在 zlevel 小的 Canvas 的上面。
			参  数: <nLevel> ;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetZLevel(int nLevel) = 0;
			virtual int  GetZLevel() const = 0;

			/*@function
			******************************************************************
			功  能：组件的所有图形的z值。控制图形的前后顺序。z值小的图形会被z值大的图形覆盖。
			注  意: z相比zlevel优先级更低，而且不会创建新的 Canvas。
			参  数: <nLevel> ;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetZ(int nLevel) = 0;
			virtual int  GetZ() const = 0;

			/*@function
			******************************************************************
			功  能：图形是否不响应和触发鼠标事件，默认为 false，即响应和触发鼠标事件。
			参  数: <bValue> ;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetSilent(bool bValue) = 0;
			virtual bool GetSilent() const = 0;

			/*@function
			******************************************************************
			功  能：是否开启动画;
			参  数: <bValue>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetAnimation(bool bValue) = 0;
			virtual bool GetAnimation() const = 0;

			/*@function
			******************************************************************
			功  能：是否开启动画的阈值，当单个系列显示的图形数量大于这个阈值时会关闭动画;
			参  数: <nValue>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetAnimationThreshold(int nValue) = 0;
			virtual int  GetAnimationThreshold() const = 0;

			/*@function
			******************************************************************
			功  能：初始动画的时长;
			参  数: <nValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetAnimationDuration(int nValue) = 0;
			virtual int  GetAnimationDuration() const = 0;

			/*@function
			******************************************************************
			功  能：设置 初始动画的时长 的 JavaScript 回调函数
			注  意：可以通过每个数据返回不同的时长实现更戏剧的初始动画效果，例如：
					animationDuration: function (idx) {
						// 越往后的数据时长越大
						return idx * 100;
					}
			参  数：<wzValue> JavaScript 函数字符串，不能为空;
			返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetAnimationDurationJSFun(const wchar_t* wzValue) = 0;

			/*@function
			******************************************************************
			功  能：设置 初始动画的时长 的回调函数
			注  意：可以通过每个数据返回不同的时长实现更戏剧的初始动画效果，例如：
			参  数：<pCallback> ;
			返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetAnimationDurationCallback(AnimationDurationCallback* pCallback) = 0;

			/*@function
			******************************************************************
			功  能：初始动画的缓动效果;
			参  数: <eValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetAnimationEasing(EAnimationEasing eValue) = 0;
			virtual EAnimationEasing GetAnimationEasing() const = 0;

			/*@function
			******************************************************************
			功  能：初始动画的延迟;
			参  数: <nValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetAnimationDelay(int nValue) = 0;
			virtual int  GetAnimationDelay() const = 0;

			/*@function
			******************************************************************
			功  能：设置 初始动画的延迟 的 JavaScript 回调函数
			注  意：可以通过每个数据返回不同的 delay 时间实现更戏剧的初始动画效果。例如：
					animationDelay: function (idx) {
						// 越往后的数据延迟越大
						return idx * 100;
					}
			参  数：<wzValue> JavaScript 函数字符串，不能为空;
			返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetAnimationDelayJSFun(const wchar_t* wzValue) = 0;

			/*@function
			******************************************************************
			功  能：设置 初始动画的延迟 的回调函数
			注  意：可以通过每个数据返回不同的时长实现更戏剧的初始动画效果
			参  数：<pCallback> ;
			返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetAnimationDelayCallback(AnimationDelayCallback* pCallback) = 0;

			/*@function
			******************************************************************
			功  能：数据更新动画的时长
			注  意：可以通过每个数据返回不同的时长实现更戏剧的初始动画效果
			参  数：<nValue> ;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetAnimationDurationUpdate(int nValue) = 0;
			virtual int  GetAnimationDurationUpdate() const = 0;

			/*@function
			******************************************************************
			功  能：设置 数据更新动画的时长 的 JavaScript 回调函数
			注  意：可以通过每个数据返回不同的时长实现更戏剧的更新动画效果。例如：
					animationDurationUpdate: function (idx) {
						// 越往后的数据延迟越大
						return idx * 100;
					}
			参  数：<wzValue> JavaScript 函数字符串, 不能为空;
			返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetAnimationDurationUpdateJSFun(const wchar_t* wzValue) = 0;

			/*@function
			******************************************************************
			功  能：数据更新动画的时长
			注  意：以通过每个数据返回不同的 delay 时间实现更戏剧的初始动画效果。
			参  数：<nValue> ;
			返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetAnimationDurationUpdateCallback(AnimationDurationUpdateCallback* pCallback) = 0;

			/*@function
			******************************************************************
			功  能：数据更新动画的缓动效果
			参  数：<eValue> ;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetAnimationEasingUpdate(EAnimationEasing eValue) = 0;
			virtual EAnimationEasing GetAnimationEasingUpdate() const = 0;

			/*@function
			******************************************************************
			功  能：数据更新动画的延迟
			参  数：<nValue> ;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetAnimationDelayUpdate(int nValue) = 0;
			virtual int  GetAnimationDelayUpdate() const = 0;

			/*@function
			******************************************************************
			功  能：设置 数据更新动画的延迟 的 JavaScript 回调函数
			注  意：可以通过每个数据返回不同的 delay 时间实现更戏剧的更新动画效果。例如：
					animationDelayUpdate: function (idx) {
						// 越往后的数据延迟越大
						return idx * 100;
					}
			参  数：<wzValue> JavaScript 函数字符串;
			返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetAnimationDelayUpdateJSFun(const wchar_t* wzValue) = 0;

			/*@function
			******************************************************************
			功  能：数据更新动画的延迟
			注  意：以通过每个数据返回不同的 delay 时间实现更戏剧的初始动画效果。
			参  数：<nValue> ;
			返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetAnimationDelayUpdateCallback(AnimationDelayUpdateCallback* pCallback) = 0;

			/*@function
			******************************************************************
			功  能：全局过渡动画相关的配置。
			参  数: <无> ;
			返回值：<ILineTypeUniversalTransition*>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IUniversalTransition* GetUniversalTransition() = 0;
			
			/*@function
			******************************************************************
			功  能：本系列特定的 tooltip 设定。
			参  数: <无> ;
			返回值：<ICompactTooltip*>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual ICompactTooltip* GetTooltip() = 0;
		};
	}
	
}
