#pragma once
/***********************************************************************
 * Module:  ICommonActionArgs.h
 * Author:  杨鹏辉
 * Modified: 2022年6月30日 13:22:47
 * Purpose: Declaration of the class IGeoActionArgs
 ***********************************************************************/

#include <vector>
#include <string>
#include "Common/IQueue.h"
#include "Events/IEvents.h"

using namespace std;

namespace IIChart
{
	/*@class
	*******************************************************************
	类名:  ICommonAction;
	功能:  通用 Action。
	备注:  
	作者:  YangPenghui 2022-3-26;
	*******************************************************************/
	class ICommonEventArgs : virtual public IEventArgs
	{
	public:
		/*@function
		**********************************************
		功  能：用 index 指定多个系列;
		参  数：<pQueue> 系列的序号，只支持int类型值;
		返回值：<无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		**********************************************/
		virtual int GetSeriesIndex(IQueue* pQueue) = 0;

		/*@function
		**********************************************
		功  能：用 index 指定多个系列;
		参  数：<pQueue> 系列的序号，只支持wstring类型值;
		返回值：<无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		**********************************************/
		virtual int GetSeriesId(IQueue* pQueue) = 0;

		/*@function
		**********************************************
		功  能：用 Name 指定多个系列;
		参  数：<pQueue> 系列的序号，只支持wstring类型值;
		返回值：<无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		**********************************************/
		virtual int GetSeriesName(IQueue* pQueue) = 0;

		/*@function
		**********************************************
		功  能：用 index 指定多个数据项;
		参  数：<pQueue> 系列的序号，只支持int类型值;
		返回值：<无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		**********************************************/
		virtual int GetDataIndex(IQueue* pQueue) = 0;


		/*@function
		**********************************************
		功  能：用 数据项名称 指定多个数据项，在有 dataIndex 的时候忽略;
		参  数：<pQueue> 系列的序号，只支持wstring类型值;
		返回值：<无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		**********************************************/
		virtual int GetName(IQueue* pQueue) = 0;

	};
}


