#pragma once
/***********************************************************************
 * Module:  ICommonGeoActionArgs.h
 * Author:  杨鹏辉
 * Modified: 2022年6月30日 13:22:47
 * Purpose: Declaration of the class ICommonGeoActionArgs
 ***********************************************************************/

#include <vector>
#include <IAction.h>

using namespace std;

namespace IIChart
{
	class ICommonGeoAction : virtual public IAction
	{
	public:
		/*@function
		*******************************************************************
		功  能：用 index 指定多个Geo 组件。
				每个值之间使用“,”分隔;如：“1,3,8,9”
		参  数：<wzValue> 使用“,”分隔的Geo 组件的序号;
		返回值:  <无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual void SetGeoIndex(const wchar_t* wzValue) = 0;

		/*@function
		************************************************
		功  能：用 index 指定多个Geo 组件;
		参  数：<vctValue> Geo 组件的序号;
		返回值：<无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		************************************************/
		virtual void SetGeoIndex(const std::vector<int>& vctValue) = 0;

		/*@function
		**********************************************
		功  能：用 index 指定多个Geo 组件;
		参  数：<pQueue> Geo 组件的序号，只支持int类型值;
		返回值：<无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		**********************************************/
		virtual int SetGeoIndex(IQueue* pQueue) = 0;

		/*@function
		**********************************************
		功  能：用 index 指定单个Geo 组件;
		参  数：<nIndex> Geo 组件序号;
		返回值：<无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		**********************************************/
		virtual void SetSingleGeoIndex(int nIndex) = 0;

		/*@function
		**********************************************
		功  能：清除设置的index;
		参  数：<无>;
		返回值：<无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		**********************************************/
		virtual void ClearGeoIndex() = 0;


		/*@function
		*******************************************************************
		功  能：用 Id 指定多个Geo 组件。
				每个值之间使用“,”分隔;如：“test1,test3,test8,test9”
		参  数：<wzValue> 使用“,”分隔的Geo 组件的Id;
		返回值:  <无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual void SetGeoId(const wchar_t* wzValue) = 0;

		/*@function
		************************************************
		功  能：用 Id 指定多个Geo 组件;
		参  数：<vctValue> Geo 组件的序号;
		返回值：<无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		************************************************/
		virtual void SetGeoId(const std::vector<wstring>& vctValue) = 0;

		/*@function
		**********************************************
		功  能：用 index 指定多个Geo 组件;
		参  数：<pQueue> Geo 组件的序号，只支持wstring类型值;
		返回值：<无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		**********************************************/
		virtual int SetGeoId(IQueue* pQueue) = 0;

		/*@function
		**********************************************
		功  能：用 Id 指定单个Geo 组件;
		参  数：<wzId> Geo 组件Id;
		返回值：<无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		**********************************************/
		virtual void SetSingleGeoId(const wchar_t* wzId) = 0;

		/*@function
		**********************************************
		功  能：清除设置的Id;
		参  数：<无>;
		返回值：<无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		**********************************************/
		virtual void ClearGeoId() = 0;

		/*@function
		*******************************************************************
		功  能：用 Name 指定多个Geo 组件。
				每个值之间使用“,”分隔;如：“test1,test3,test8,test9”
		参  数：<wzValue> 使用“,”分隔的Geo 组件的Id;
		返回值:  <无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual void SetGeoName(const wchar_t* wzValue) = 0;

		/*@function
		************************************************
		功  能：用 Id 指定多个Geo 组件;
		参  数：<vctValue> Geo 组件的序号;
		返回值：<无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		************************************************/
		virtual void SetGeoName(const std::vector<wstring>& vctValue) = 0;

		/*@function
		**********************************************
		功  能：用 Name 指定多个Geo 组件;
		参  数：<pQueue> Geo 组件的序号，只支持wstring类型值;
		返回值：<无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		**********************************************/
		virtual int SetGeoName(IQueue* pQueue) = 0;

		/*@function
		**********************************************
		功  能：用 Name 指定单个Geo 组件;
		参  数：<wzId> Geo 组件Name;
		返回值：<无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		**********************************************/
		virtual void SetSingleGeoName(const wchar_t* wzName) = 0;

		/*@function
		**********************************************
		功  能：清除设置的Name;
		参  数：<无>;
		返回值：<无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		**********************************************/
		virtual void ClearGeoName() = 0;

		/*@function
		*******************************************************************
		功  能：用 数据项名称 指定多个数据项，在有 dataIndex 的时候忽略;
				每个值之间使用“,”分隔;如：“test1,test3,test8,test9”
		参  数：<wzValue> 使用“,”分隔的Geo 组件的数据项名称;
		返回值:  <无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual void SetName(const wchar_t* wzValue) = 0;

		/*@function
		************************************************
		功  能：用 数据项名称 指定多个数据项，在有 dataIndex 的时候忽略;
		参  数：<vctValue> 数据项名称;
		返回值：<无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		************************************************/
		virtual void SetName(const std::vector<wstring>& vctValue) = 0;

		/*@function
		**********************************************
		功  能：用 数据项名称 指定多个数据项，在有 dataIndex 的时候忽略;
		参  数：<pQueue> Geo 组件的序号，只支持wstring类型值;
		返回值：<无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		**********************************************/
		virtual int SetName(IQueue* pQueue) = 0;

		/*@function
		**********************************************
		功  能：用 数据项名称 指定单个数据项，在有 dataIndex 的时候忽略;
		参  数：<wzValue> 数据项名称;
		返回值：<无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		**********************************************/
		virtual void SetSingleName(const wchar_t* wzValue) = 0;

		/*@function
		**********************************************
		功  能：清除设置的数据项名称;
		参  数：<无>;
		返回值：<无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		**********************************************/
		virtual void ClearName() = 0;
	};
}


