#pragma once
/***********************************************************************
 * Module:   IPieTypeEmphasis.h
 * Author:   杨鹏辉
 * Modified: 2022年7月1日 15:02:44
 * Purpose:  饼图高亮状态的扇区和标签样式。
 ***********************************************************************/
#include "Common/IEnum.h"
#include "Options/Common/ILineStyle.h"
#include "Options/GeneralOptions/Series/Pie/IPieTypeEmphasisLabel.h"
#include "Options/GeneralOptions/Series/Pie/IPieTypeEmphasisLabelLine.h"
#include "Options/GeneralOptions/Series/Pie/IPieTypeEmphasisItemStyle.h"


namespace IIChart
{
	namespace Pie
	{
		/*@class
		*************************************************************************
		* 类  名: IPieTypeEmphasis
		* 修  改: 2022年7月1日 15:02:44
		* 功  能: 饼图高亮状态的扇区和标签样式
		-----------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		************************************************************************/
		class IPieTypeEmphasis
		{
		public:
			/*@function
			*******************************************************************
			功  能: 是否关闭高亮状态。
			注  意：关闭高亮状态可以在鼠标移到图形上，tooltip 触发，或者图例联动的时候不再触发高亮效果。
					在图形非常多的时候可以关闭以提升交互流畅性。
			参  数: <bValue>;
			返回值: <无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetDisabled(bool bValue) = 0;
			virtual bool GetDisabled() const = 0;

			/*@function
			*******************************************************************
			功  能: 是否开启高亮后扇区的放大效果
			参  数: <bValue>;
			返回值: <无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetScale(bool bValue) = 0;
			virtual bool GetScale() const = 0;

			/*@function
			*******************************************************************
			功  能: 高亮后扇区的放大尺寸，在开启 emphasis.scale 后有效。
			参  数: <fValue>;
			返回值: <无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetScaleSize(float fValue) = 0;
			virtual float GetScaleSize() const = 0;

			/*@function
			*******************************************************************
			功  能: 在高亮图形时，是否高亮其它数据的图形已达到聚焦的效果。
			参  数: <eValue>;
			返回值: <无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetFocus(EFocus eValue) = 0;
			virtual EFocus GetFocus() const = 0;

			/*@function
			*******************************************************************
			功  能: 在开启focus的时候，可以通过blurScope配置高亮的范围。
			参  数: <eValue>;
			返回值: <无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetBlurScope(EBlurScope eValue) = 0;
			virtual EBlurScope GetBlurScope() const = 0;


			/*@function
			******************************************************************
			功  能：高亮时的 Label。
			参  数：<无>;
			返回值：<IPieTypeEmphasisLabel*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IPieTypeEmphasisLabel* GetLabel() = 0;

			/*@function
			******************************************************************
			功  能：高亮时的视觉引导线样式。
			参  数：<无>;
			返回值：<IPieTypeEmphasisLabelLine*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IPieTypeEmphasisLabelLine* GetLabelLine() = 0;

			/*@function
			******************************************************************
			功  能：高亮时的样式。
			参  数：<无>;
			返回值：<IPieTypeEmphasisItemStyle*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IPieTypeEmphasisItemStyle* GetItemStyle() = 0;

			
		};
	}
	
}
