#pragma once
/***********************************************************************
 * Module:  IPieTypeMarkLineDataLineStyle.h
 * Author:  杨鹏辉
 * Modified: 2022年7月1日 15:02:44
 * Purpose: 图表标线的线条样式
 ***********************************************************************/
#include "Common/IEnum.h"

namespace IIChart
{
	namespace Pie
	{
		/*@class
		*************************************************************************
		* 类  名: IPieTypeMarkLineLineStyle
		* 修  改: 2022年7月1日 15:02:44
		* 功  能: 图表标线的线条样式。
		-----------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		************************************************************************/
		class IPieTypeMarkLineLineStyle
		{
		public:
			/*@function
			******************************************************************
			功  能：线的颜色。
			注  意：为颜色值时，可以使用以下形式，
					 1. 可以使用 RGB 表示，比如 'rgb(128, 128, 128)'\
					 2. 如果想要加上 alpha 通道，可以使用 RGBA，比如 'rgba(128, 128, 128, 0.5)'
					 3. 可以使用十六进制格式，比如 '#ccc'
					 4. 可以使用 CSS3 预定义的颜色名称，如'red'，'SlateGray';
			参  数：<wzValue> 为 nullptr 或 L"" 时原有的值将会被清空;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetColor(const wchar_t* wzValue) = 0;
			virtual wchar_t* GetColor() const = 0;

			/*@function
			******************************************************************
			功  能：以 RGBA 方式设置线的颜色。
			参  数：<略>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetColor(int nR, int nG, int nB, float nTransparent = 1) = 0;
			virtual void GetColor(int* pnR, int* pnG, int* pnB, float* pnTransparent) = 0;

			/*@function
			******************************************************************
			功  能：设置线条的颜色，此方式除可设置纯色外还可以设置为渐变色和纹理填充;
			参  数：<pValue>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetColor(IColor* pValue) = 0;

			/*@function
			******************************************************************
			功  能：线宽。
			参  数：<nValue>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetWidth(int nValue) = 0;
			virtual int  GetWidth() = 0;

			/*@function
			******************************************************************
			功  能：线的类型。
			参  数：<eValue>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetType(ELineStyle eValue) = 0;
			virtual ELineStyle GetType() const = 0;

			/*@function
			*****************************************************************
			 功  能：线的类型, 用数组以指定线条的 dash array
					 配合 borderDashOffset 可实现更灵活的虚线效果;
			 参  数：<nValue> 线条虚线的 dash array 首地址;
					 <nCount> array 数组大小;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int  SetType(int* pnValue, int nCount) = 0;
			virtual void GetType(int* pnValue, int* pnCount) = 0;

			/*@function
			*****************************************************************
			 功  能：线的类型, 用数组以指定线条的 dash array
					 配合 borderDashOffset 可实现更灵活的虚线效果
			 参  数：<wzValue> 以英文“,”隔开的数字序列;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int  SetType(const wchar_t* wzValue) = 0;
			virtual void GetType(wchar_t** pwzValue) = 0;

			/*@function
			*****************************************************************
			 功  能：线的类型, 用数组以指定线条的 dash array
					 配合 borderDashOffset 可实现更灵活的虚线效果
			 参  数：<vctValue> 数字序列;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int  SetType(const std::vector<int>& vctValue) = 0;

			/*@function
			*****************************************************************
			 功  能：用于设置虚线的偏移量，可搭配 type 指定 dash array 实现灵活的虚线效果;
			 参  数：<nValue>;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetDashOffset(int nValue) = 0;
			virtual int  GetDashOffset() const = 0;

			/*@function
			*****************************************************************
			 功  能：用于指定线段末端的绘制方式，默认值为 'ECS_Butt'。
			 参  数：<eValue>;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetCap(ECapStyle eValue) = 0;
			virtual ECapStyle GetCap() const = 0;

			/*@function
			*****************************************************************
			 功  能：用于设置2个长度不为0的相连部分（线段，圆弧，曲线）如何连接在一起的属性;
			 注  意：长度为0的变形部分，其指定的末端和控制点在同一位置，会被忽略;
			 参  数：<eValue>;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetJoin(EJoinStyle eValue) = 0;
			virtual EJoinStyle GetJoin() const = 0;

			/*@function
			*****************************************************************
			 功  能：用于设置斜接面限制比例。只有当 join 为 miter 时， miterLimit 才有效。
			 注  意：默认值为 10。负数、0均会被忽略。
			 参  数：<nValue>;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetMiterLimit(int nValue) = 0;
			virtual int  GetMiterLimit() const = 0;

			/*@function
			******************************************************************
			功  能：设置阴影颜色。
			注  意：为颜色值时，可以使用以下形式，
					 1. 可以使用 RGB 表示，比如 'rgb(128, 128, 128)'\
					 2. 如果想要加上 alpha 通道，可以使用 RGBA，比如 'rgba(128, 128, 128, 0.5)'
					 3. 可以使用十六进制格式，比如 '#ccc'
					 4. 可以使用 CSS3 预定义的颜色名称，如'red'，'SlateGray';
			参  数：<wzValue> 为 nullptr 或 L"" 时原有的值将会被清空;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetShadowColor(const wchar_t* wzValue) = 0;
			virtual wchar_t* GetShadowColor() const = 0;

			/*@function
			******************************************************************
			功  能：以 RGBA 方式设置阴影的颜色。
			参  数：<略>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetShadowColor(int nR, int nG, int nB, float nTransparent = 1) = 0;
			virtual void GetShadowColor(int* pnR, int* pnG, int* pnB, float* pnTransparent) = 0;

			/*@function
			******************************************************************
			功  能：设置线条的阴影颜色，此方式除可设置纯色外还可以设置为渐变色和纹理填充;
			参  数：<pValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetShadowColor(IColor* pValue) = 0;

			/*@function
			******************************************************************
			功  能：线条阴影的模糊大小;
			注  意：该属性配合 shadowColor,shadowOffsetX, shadowOffsetY 一起设置线条的阴影效果。
			参  数：<略>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetShadowBlur(int nValue) = 0;
			virtual int GetShadowBlur() const = 0;

			/*@function
			******************************************************************
			功  能：阴影水平方向上的偏移距离。
			参  数：<略>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetShadowOffsetX(int nValue) = 0;
			virtual int GetShadowOffsetX() const = 0;

			/*@function
			******************************************************************
			功  能：阴影垂直方向上的偏移距离。
			参  数：<略>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetShadowOffsetY(int nValue) = 0;
			virtual int GetShadowOffsetY() const = 0;

			/*@function
			******************************************************************
			功  能：线条透明度。支持从 0 到 1 的数字，为 0 时不绘制该线条。
			参  数：<略>;
			返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetOpacity(float nValue) = 0;
			virtual float GetOpacity() const = 0;

			/*@function
			******************************************************************
			功  能：线条的曲度，支持从 0 到 1 的值，值越大曲度越大。
			参  数：<略>;
			返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetCurveness(float fValue) = 0;
			virtual float  GetCurveness() const = 0;

		};
	}
	
}