#pragma once
/***********************************************************************
 * Module:   IAngleAxisSplitLine.h
 * Author:   杨鹏辉
 * Modified: 2022年7月1日 15:02:44
 * Purpose:  坐标轴在 grid 区域中的分隔线。
 ***********************************************************************/
#include "Common/IEnum.h"
#include "Options/GeneralOptions/AngleAxis/IAngleAxisSplitLineLineStyle.h"

namespace IIChart
{
	namespace AngleAxis
	{
		/*@class
		*************************************************************************
		* 类  名: IAngleAxisSplitLine
		* 修  改: 2022年7月1日 15:02:44
		* 功  能: 坐标轴在 grid 区域中的分隔线。。
		-----------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		************************************************************************/
		class IAngleAxisSplitLine
		{
		public:

			/*@function
			******************************************************************
			功  能：是否显示分隔线。默认数值轴显示，类目轴不显示。
			参  数：<bShow>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetShow(bool bShow) = 0;
			virtual bool GetShow() const = 0;

			/*@function
			******************************************************************
			功  能：坐标轴分隔线的显示间隔。
			注  意：只在在类目轴中有效
			参  数：<nValue> 0 强制显示所有标签;
							 1，表示『隔一个标签显示一个标签』；
							 2，表示隔两个标签显示一个标签，以此类推。
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetInterval(int nValue) = 0;
			virtual int  GetInterval() const = 0;

			/*@function
			******************************************************************
			功  能：坐标轴分隔线的显示间隔。
			注  意：只在在类目轴中有效
			参  数：<wzValue> JS 回调函数，其格式如下:
							 (index:number, value: string) => boolean；
							 第一个参数是类目的 index，第二个值是类目名称，如果跳过则返回 false。
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetIntervalJSFun(const wchar_t* wzValue) = 0;

			/*@function
			******************************************************************
			功  能：坐标轴分隔线的显示间隔。
			注  意：只在在类目轴中有效
			参  数：<pCallback> 回调函数，其格式如下：
					typedef bool (*IntervalCallback)(int nIndex, const wchar_t* wzValue);
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetIntervalCallback(IntervalCallback* pCallback) = 0;

			/*@function
			******************************************************************
			功  能：分隔线样式设置
			参  数：<无>;
			返回值：<IAngleAxisSplitLineLineStyle*>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IAngleAxisSplitLineLineStyle* GetLineStyle() = 0;
		};
	}
	
}
