#pragma once
/***********************************************************************
 * Module:   IAngleAxisAxisTick.h
 * Author:   杨鹏辉
 * Modified: 2022年7月1日 15:02:44
 * Purpose:  坐标轴刻度相关设置。
 ***********************************************************************/
#include "Common/IEnum.h"
#include "Options/Common/ILineStyle.h"

namespace IIChart
{
	namespace AngleAxis
	{
		/*@class
		***********************************************************************
		* 类  名: IAngleAxisAxisTick
		* 修  改: 2022年7月1日 15:02:44
		* 功  能: 坐标轴刻度相关设置。
		-----------------------------------------------------------------------
		* 作  者:  YangPenghui 2022-10-26;
		************************************************************************/
		class IAngleAxisAxisTick
		{
		public:

			/*@function
			******************************************************************
			功  能：是否显示坐标轴刻度
			参  数：<bValue>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetShow(bool bValue) = 0;
			virtual bool GetShow() const = 0;

			/*@function
			******************************************************************
			功  能：类目轴中在 boundaryGap 为 true 的时候有效，可以保证刻度线和标签对齐
			参  数：<bValue>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetAlignWithLabel(bool bValue) = 0;
			virtual bool GetAlignWithLabel() const = 0;

			/*@function
			******************************************************************
			功  能：坐标轴刻度的显示间隔。
			注  意：只在在类目轴中有效
			参  数：<nValue> 0 强制显示所有标签;
							 1，表示『隔一个标签显示一个标签』；
							 2，表示隔两个标签显示一个标签，以此类推。
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetInterval(int nValue) = 0;
			virtual int  GetInterval() const = 0;

			/*@function
			******************************************************************
			功  能：坐标轴刻度的显示间隔。
			注  意：只在在类目轴中有效
			参  数：<wzValue> JS 回调函数，其格式如下:
							 (index:number, value: string) => boolean；
							 第一个参数是类目的 index，第二个值是类目名称，如果跳过则返回 false。
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetIntervalJSFun(const wchar_t* wzValue) = 0;

			/*@function
			******************************************************************
			功  能：坐标轴刻度的显示间隔。
			注  意：只在在类目轴中有效
			参  数：<pCallback> 回调函数，其格式如下：
					typedef bool (*IntervalCallback)(int nIndex, const wchar_t* wzValue);
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetIntervalCallback(IntervalCallback* pCallback) = 0;

			/*@function
			******************************************************************
			功  能：坐标轴刻度是否朝内，默认朝外
			参  数：<bValue>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetInside(bool bValue) = 0;
			virtual bool GetInside() const = 0;

			/*@function
			******************************************************************
			功  能：坐标轴刻度的长度
			参  数：<nValue>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetLength(int nValue) = 0;
			virtual int  GetLength() const = 0;

			/*@function
			******************************************************************
			功  能：刻度线的样式设置
			参  数：<无>;
			返回值：<IAxisLineStyle*>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual ILineStyle* GetLineStyle() = 0;
		};
	}
	
}
