#pragma once
/***********************************************************************
 * Module:   IRadarSplitLine.h
 * Author:   杨鹏辉
 * Modified: 2022年7月1日 15:02:44
 * Purpose:  坐标轴在 grid 区域中的分隔线。
 ***********************************************************************/
#include "Common/IEnum.h"
#include "Options/GeneralOptions/Radar/IRadarSplitLineLineStyle.h"

namespace IIChart
{
	namespace RadarComp
	{
		/*@class
		 *************************************************************************
		 * 类  名: IRadarSplitArea
		 * 修  改: 2022年7月1日 15:02:44
		 * 功  能: 坐标轴在 grid 区域中的分隔线。
		 -----------------------------------------------------------------------
		 作  者:  YangPenghui 2022-10-26;
		 ************************************************************************/
		class IRadarSplitLine
		{
		public:

			/*@function
			******************************************************************
			功  能：是否显示视觉引导线。
			参  数：<bShow>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetShow(bool bValue) = 0;
			virtual bool GetShow() const = 0;
			
			/*@function
			******************************************************************
			功  能：视觉引导线样式。
			参  数：<无>;
			返回值：<ILineStyle*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IRadarSplitLineLineStyle* GetLineStyle() = 0;
		};
	}
	
}
