#pragma once
/***********************************************************************
 * Module:   IRadarIndicator.h
 * Author:   杨鹏辉
 * Modified: 2022年7月1日 15:02:44
 * Purpose:  雷达图的指示器，用来指定雷达图中的多个变量（维度），如下示例。
 * 
 * 			 indicator: [
 *			   { name: '销售（sales）', max: 6500},
 *			   { name: '管理（Administration）', max: 16000, color: 'red'}, // 标签设置为红色
 *			   { name: '信息技术（Information Techology）', max: 30000},
 *			   { name: '客服（Customer Support）', max: 38000},
 *			   { name: '研发（Development）', max: 52000},
 *			   { name: '市场（Marketing）', max: 25000}
 *			]
 *
 ***********************************************************************/
#include "Options/Common/IBaseArrayElement.h"

namespace IIChart
{
	namespace RadarComp
	{
		/*@class
		 *************************************************************************
		 * 类  名: IRadarIndicator
		 * 修  改: 2022年7月1日 15:02:44
		 * 功  能: 雷达图的指示器。
		 -----------------------------------------------------------------------
		 作  者:  YangPenghui 2022-10-26;
		 ************************************************************************/
		class IRadarIndicator : public IBaseArrayElement
		{
		public:
			/*@function
			******************************************************************
			功  能：指示器名称。
			参  数：<wzValue> 为 nullptr 或 L"" 时原有的值将会被清空;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetName(const wchar_t* wzValue) = 0;
			virtual wchar_t* GetName() const = 0;

			/*@function
			******************************************************************
			功  能：指示器的最大值，可选，建议设置
			参  数：<nValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetMax(int nValue) = 0;
			virtual int  GetMax() const = 0;

			/*@function
			******************************************************************
			功  能：指示器的最小值，可选，默认为 0
			参  数：<nValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetMin(int nValue) = 0;
			virtual int  GetMin() const = 0;

			/*@function
			******************************************************************
			功  能：刻度标签文字的颜色。
			注  意：为颜色值时，可以使用以下形式，
					1. 可以使用 RGB 表示，比如 'rgb(128, 128, 128)'\
					2. 如果想要加上 alpha 通道，可以使用 RGBA，比如 'rgba(128, 128, 128, 0.5)'
					3. 可以使用十六进制格式，比如 '#ccc'
					4. 可以使用 CSS3 预定义的颜色名称，如'red'，'SlateGray';
			参  数：<wzValue> 为 nullptr 或 L"" 时为不指定;
			返回值：<无>;
			------------------------------------------------------------------
				作  者 : YangPenghui 2022 - 10 - 26;
			******************************************************************/
			virtual void SetColor(const wchar_t* wzValue) = 0;
			virtual wchar_t* GetColor() const = 0;

			/*@function
			******************************************************************
			功  能：刻度标签文字的颜色，默认取 axisLine.lineStyle.color。
			参  数：<略>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetColor(int nR, int nG, int nB, float nTransparent = 1) = 0;
			virtual void GetColor(int* pnR, int* pnG, int* pnB, float* pnTransparent) = 0;

		};
	}
	
}
