#pragma once
/***********************************************************************
 * Module:   IRadarAxisTick.h
 * Author:   杨鹏辉
 * Modified: 2022年7月1日 15:02:44
 * Purpose:  坐标轴刻度相关设置。
 ***********************************************************************/
#include "Common/IEnum.h"
#include "Options/Common/ILineStyle.h"

namespace IIChart
{
	namespace RadarComp
	{
		/*@class
		 *************************************************************************
		 * 类  名: IRadarAxisTick
		 * 修  改: 2022年7月1日 15:02:44
		 * 功  能: 坐标轴刻度相关设置。
		 -----------------------------------------------------------------------
		 作  者:  YangPenghui 2022-10-26;
		 ************************************************************************/
		class IRadarAxisTick
		{
		public:
			/*@function
			******************************************************************
			功  能：是否显示视觉引导线。
			参  数：<bShow>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetShow(bool bValue) = 0;
			virtual bool GetShow() const = 0;
			
			/*@function
			******************************************************************
			功  能：坐标轴刻度的长度。
			参  数：<nValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetLength(int nValue) = 0;
			virtual int GetLength() const = 0;

			/*@function
			******************************************************************
			功  能：坐标轴刻度的长度。
			参  数：<无>;
			返回值：<ILineStyle*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual ILineStyle* GetLineStyle() = 0;
		};
	}
	
}
