#pragma once
/***********************************************************************
 * Module:  IRadar.h
 * Author:  杨鹏辉
 * Modified: 2022年7月1日 15:02:44
 * Purpose: 雷达图坐标系组件，只适用于雷达图。
 *		该组件等同 ECharts 2 中的 polar 组件。因为 3 中的 polar 被重构为
 *		标准的极坐标组件，为避免混淆，雷达图使用radar 组件作为其坐标系。
 *		
 *		雷达图坐标系与极坐标系不同的是它的每一个轴（indicator 指示器）都是
 *		一个单独的维度，可以通过 name、axisLine、axisTick、axisLabel、
 *		splitLine、 splitArea 几个配置项配置指示器坐标轴线的样式。
 *          
 ***********************************************************************/
#include "Common/ICallback.h"
#include "Options/Common/IBaseArrayElement.h"
#include "Options/GeneralOptions/Radar/IRadarAxisName.h"
#include "Options/GeneralOptions/Radar/IRadarAxisLine.h"
#include "Options/GeneralOptions/Radar/IRadarAxisTick.h"
#include "Options/GeneralOptions/Radar/IRadarSplitArea.h"
#include "Options/GeneralOptions/Radar/IRadarSplitLine.h"
#include "Options/GeneralOptions/Radar/IRadarAxisLabel.h"
#include "Options/GeneralOptions/Radar/IRadarIndicator.h"


namespace IIChart
{
	namespace RadarComp
	{
		/*@class
		 *************************************************************************
		 * 类  名: IRadar
		 * 修  改: 2022年7月1日 15:02:44
		 * 功  能: 雷达图坐标系组件，只适用于雷达图。
		 -----------------------------------------------------------------------
		 作  者:  YangPenghui 2022-10-26;
		 ************************************************************************/
		class IRadar : virtual public IBaseArrayElement
		{
		public:
			/*@function
			******************************************************************
			功  能：组件 ID。默认不指定。指定则可用于在 option 或者 API 中引用组件。
			参  数: <wzValue> 为 nullptr 或 L"" 时为不指定;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetId(const wchar_t* wzValue) = 0;
			virtual wchar_t* GetId() const = 0;

			/*@function
			******************************************************************
			功  能：所有图形的 zlevel 值。
			注  意: zlevel用于 Canvas 分层，不同zlevel值的图形会放置在不同的 Canvas 中，
					Canvas 分层是一种常见的优化手段。我们可以把一些图形变化频繁（例如有动画）的
					组件设置成一个单独的zlevel。需要注意的是过多的 Canvas 会引起内存开销的增大，
					在手机端上需要谨慎使用以防崩溃。
					zlevel 大的 Canvas 会放在 zlevel 小的 Canvas 的上面。
			参  数: <nLevel> ;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetZLevel(int nLevel) = 0;
			virtual int  GetZLevel() const = 0;

			/*@function
			******************************************************************
			功  能：组件的所有图形的z值。控制图形的前后顺序。z值小的图形会被z值大的图形覆盖。
			注  意: z相比zlevel优先级更低，而且不会创建新的 Canvas。
			参  数: <nLevel> ;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetZ(int nLevel) = 0;
			virtual int  GetZ() const = 0;

			/*@function
			******************************************************************
			功  能：中心（圆心）坐标。
			参  数: <nX> 横坐标;
					<nY> 纵坐标;
					<bIsPercent> true 时，nX 为相对于容器宽度的百分比， nY 为相对于容器高度的百分比;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetCenter(int nX, int nY, bool bIsPercent = false) = 0;
			virtual void GetCenter(int* pnX, int* pnY, bool* pbIsPercent) = 0;

			/*@function
			******************************************************************
			功  能：外半径值。
			参  数: <nValue> 外半径值;
					<bIsPercent> true 时，nValue 为外半径为可视区尺寸的百分比;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetRadius(int nValue, bool bIsPercent) = 0;
			virtual void GetRadius(int* pnValue, bool* pbIsPercent) = 0;

			/*@function
			******************************************************************
			功  能：外半径值。
			参  数: <nInner> 内半径;
					<nOutter> 外半径;
					<bIsPercent> true 时，nInner 与 nOutter 为百分比表示;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetRadius(int nInner, int nOutter, bool bIsPercent) = 0;
			virtual void GetRadius(int* pnInner, int* pnOutter, bool* pbIsPercent) = 0;

			/*@function
			******************************************************************
			功  能：坐标系起始角度，也就是第一个指示器轴的角度。
			参  数: <nValue> 内半径;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetStartAngle(int nValue) = 0;
			virtual int  GetStartAngle() const = 0;

			/*@function
			******************************************************************
			功  能：雷达图每个指示器名称的配置项。
			参  数: <无>;
			返回值：<IRadarAxisName*>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IRadarAxisName* GetAxisName() = 0;

			/*@function
			******************************************************************
			功  能：指示器名称和指示器轴的距离。
			参  数: <nValue>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetNameGap(int nValue) = 0;
			virtual int  GetNameGap() const = 0;

			/*@function
			******************************************************************
			功  能：指示器轴的分割段数。
			参  数: <nValue>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetSplitNumber(int nValue) = 0;
			virtual int  GetSplitNumber() const = 0;

			/*@function
			******************************************************************
			功  能：雷达图绘制类型，支持 'polygon' 和 'circle'。
			参  数: <eValue>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetShape(ERadarShape eValue) = 0;
			virtual ERadarShape GetShape() const = 0;

			/*@function
			******************************************************************
			功  能：是否是脱离 0 值比例。设置成 true 后坐标刻度不会强制包含零刻度。
			        在双数值轴的散点图中比较有用。
			参  数: <bValue>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetScale(bool bValue) = 0;
			virtual bool GetScale() const = 0;

			/*@function
			******************************************************************
			功  能：坐标轴是否是静态无法交互。
			参  数: <bValue>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetSilent(bool bValue) = 0;
			virtual bool GetSilent() const = 0;

			/*@function
			******************************************************************
			功  能：坐标轴的标签是否响应和触发鼠标事件，默认不响应。
			参  数: <bValue>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetTriggerEvent(bool bValue) = 0;
			virtual bool GetTriggerEvent() const = 0;

			/*@function
			******************************************************************
			功  能：坐标轴轴线相关设置。
			参  数: <无>;
			返回值：<IRadarAxisLine*>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IRadarAxisLine* GetAxisLine() = 0;

			/*@function
			******************************************************************
			功  能：坐标轴刻度相关设置。
			参  数: <无>;
			返回值：<IRadarAxisTick*>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IRadarAxisTick* GetAxisTick() = 0;

			/*@function
			******************************************************************
			功  能：坐标轴刻度标签的相关设置。
			参  数: <无>;
			返回值：<IRadarAxisLabel*>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IRadarAxisLabel* GetAxisLabel() = 0;

			/*@function
			******************************************************************
			功  能：坐标轴在 grid 区域中的分隔区域，默认不显示。
			参  数: <无>;
			返回值：<IRadarSplitArea*>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IRadarSplitArea* GetSplitArea() = 0;

			/*@function
			******************************************************************
			功  能：坐标轴在 grid 区域中的分隔线。
			参  数: <无>;
			返回值：<IRadarSplitLine*>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IRadarSplitLine* GetSplitLine() = 0;

			/*@function
			******************************************************************
			功  能：清除所有雷达图的指示器。
			参  数: <无>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void ClearIndicator() = 0;

			/*@function
			******************************************************************
			功  能：雷达图的指示器，用来指定雷达图中的多个变量（维度）
			        此对象可以作为 IFixedQueue 的元素;
			参  数: <wzName> 指示器名称;
					<nMax> 指示器的最大值，可选，建议设置;
					<nMin> 指示器的最小值，可选，默认为 0;
			        <wzColor> 为颜色值时，可以使用以下形式，为 nullptr 或 L"" 时原有的值将会被清空;
							1. 可以使用 RGB 表示，比如 'rgb(128, 128, 128)'\
							2. 如果想要加上 alpha 通道，可以使用 RGBA，比如 'rgba(128, 128, 128, 0.5)'
							3. 可以使用十六进制格式，比如 '#ccc'
							4. 可以使用 CSS3 预定义的颜色名称，如'red'，'SlateGray';
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IRadarIndicator* CreateIndicator() = 0;
			virtual IRadarIndicator* CreateIndicator(const wchar_t* wzName, int nMax, int nMin = 0, const wchar_t* wzColor = nullptr) = 0;
			
			/*@function
			******************************************************************
			 功  能：在原有的指示器后增加新的指示器。
			 注  意：此接口可以方便实现动态图表;
			 参  数：<pValue> 新的数据,其元素可以是 IRadarIndicator* 类型的数据;
			         <wzName> 指示器名称;
					 <nMax> 指示器的最大值，可选，建议设置;
					 <nMin> 指示器的最小值，可选，默认为 0;
			         <wzColor> 为颜色值时，可以使用以下形式，为 nullptr 或 L"" 时原有的值将会被清空;
							1. 可以使用 RGB 表示，比如 'rgb(128, 128, 128)'\
							2. 如果想要加上 alpha 通道，可以使用 RGBA，比如 'rgba(128, 128, 128, 0.5)'
							3. 可以使用十六进制格式，比如 '#ccc'
							4. 可以使用 CSS3 预定义的颜色名称，如'red'，'SlateGray';
			 返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int  AddIndicator(IRadarIndicator* pValue) = 0;
			virtual int  AddIndicator(const wchar_t* wzName, int nMax, const wchar_t* wzColor = nullptr) = 0;
			virtual int  AddIndicator(const wchar_t* wzName, int nMax, int nMin, const wchar_t* wzColor = nullptr) = 0;

			/*@function
			******************************************************************
			 功  能：在原有的指示器后增加新的指示器。
			 注  意：此接口可以方便实现动态图表;
			 参  数：<pQueue> 新的数据,其元素是 IRadarIndicator* 类型的数据;
			 返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int AddIndicator(IFixedQueue* pQueue) = 0;

			/*@function
			******************************************************************
			功  能：设置雷达图的指示器，此值为一个一维数组;
			注  意：系列原来的数据将被覆盖掉;
			        此接口可以方便的实现动态图表显示;
			参  数: <pQueue>新的数据,其元素是 IRadarIndicator* 类型的数据;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetIndicator(IFixedQueue* pQueue) = 0;
		};
	}
	
}