#pragma once
/***********************************************************************
 * Module:   ILineTypeDataEmphasis.h
 * Author:   杨鹏辉
 * Modified: 2022年7月1日 15:02:44
 * Purpose:  单个拐点的高亮样式设置。
 ***********************************************************************/
#include "Common/IEnum.h"
#include "Options/Common/ILineStyle.h"
#include "Options/GeneralOptions/Series/Line/ILineTypeDataItemStyle.h"
#include "Options/GeneralOptions/Series/Line/ILineTypeDataLabel.h"

namespace IIChart
{
	namespace Line
	{
		/*@class
		*************************************************************************
		* 类  名: ILineTypeDataEmphasis
		* 修  改: 2022年7月1日 15:02:44
		* 功  能: 单个拐点的高亮时的样式设置。
		-----------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		************************************************************************/
		class ILineTypeDataEmphasis
		{
		public:
			/*@function
			*******************************************************************
			功  能: 是否关闭高亮状态。
			注  意：关闭高亮状态可以在鼠标移到图形上，tooltip 触发，或者图例联动的时候不再触发高亮效果。
			        在图形非常多的时候可以关闭以提升交互流畅性。
			参  数: <bValue>;
			返回值: <无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetDisabled(bool bValue) = 0;
			virtual bool GetDisabled() const = 0;

			/*@function
			*******************************************************************
			功  能: 单个拐点文本高亮时的标签样式设置
			参  数: <无>;
			返回值: <ILineTypeDataLabel*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual ILineTypeDataLabel* GetLabel() = 0;

			/*@function
			*******************************************************************
			功  能: 单个拐点标志高亮时的样式设置
			参  数: <无>;
			返回值: <ILineTypeDataItemStyle*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual ILineTypeDataItemStyle* GetItemStyle() = 0;
			
		};
	}
	
}
