/*@file
*************************************************************************
模块:  IIChart.DLL;
文件:  IChart.h;
功能:  图表实例相关接口;
作者:  YangPenghui, 2022-3-26;
************************************************************************/
#pragma once

#include <IChartSetting.h>
#include <IChartEventDelegate.h>
#include <IActionFactory.h>
#include <Options\GeneralOptions\IGeneralOptions.h>

using namespace std;

namespace IIChart
{
	/*@class
	*******************************************************************
	类  名:  IChart;
	功  能:  图表实例相关接口;
	备  注:  ;
	--------------------------------------------------------------------
	作  者:  YangPenghui 2022-3-26;
	*******************************************************************/
	class IChart
	{
	public:

		/*@function
		*******************************************************************
		功  能:  取当前图表的配置，然后设置图表的相关属性;
		参  数:  <无> ;
		返回值:  <IChartSetting*>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual IChartSetting* GetSetting() = 0;

		/*@function
		*******************************************************************
		功  能:  初始化图表;
		注  意:  如果修改IChartSetting后，想让新的IChartSetting生效，需要重新调用一下此接口;
		         此接口会将原来的Chart内容全部删除掉;
		参  数:  <无>;
		返回值:  <错误码>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual int Init() = 0;

		/*@function
		*******************************************************************
		功  能:  设置图表名称，用于唯一标识当前图表;
		         设置的值为空时，将使用默认 ObjectID 作为名称;
		参  数:  <wzName> ;
		返回值:  <无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual void SetName(const wchar_t* wzName) = 0;
		virtual wchar_t* GetName() const = 0;

		/*@function
		*******************************************************************
		功  能:  设置响应图表事件的代理;
		参  数:  <pDelegate> 外部代理实例，如果为nullptr或0将清除当前已设置的实例;
		返回值:  <无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual void SetEventDelegate(IChartEventDelegate* pDelegate) = 0;
		virtual IChartEventDelegate* GetEventDelegate() = 0;

		/*@function
		*******************************************************************
		功  能:  取生成用于当前图表 IAction 的工厂实例;
		参  数:  <无>;
		返回值:  <IActionFactory*> IAction 的工厂实例;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual IActionFactory* GetActionArgsFactory(void) = 0;

		/*@function
		*******************************************************************
		功  能:  取当前图表通用万能配置的实例，此实现将可以配置图表的所有功能;
		参  数:  <无>;
		返回值:  <IGeneralOptions*> 图表通用万能配置的实例;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual IGeneralOptions* GetGeneralOptions() = 0;

	public:

		/*@function
		*******************************************************************
		功  能:  取当前图表通用万能配置的实例，此实现将可以配置图表的所有功能;
		参  数:  <无>;
		返回值:  <IGeneralOptions*> 图表通用万能配置的实例;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual int SetOption(IChartOption* pOption = nullptr, bool bNotMerge = false, bool bLazyUpdate = true) = 0;

		/*@function
		*******************************************************************
		功  能:  取当前图表通用万能配置的实例，此实现将可以配置图表的所有功能;
		参  数:  <无>;
		返回值:  <IGeneralOptions*> 图表通用万能配置的实例;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual int SetOptionAsync(IChartOption* pOption = nullptr, bool bNotMerge = false, bool bLazyUpdate = true) = 0;

		/*@function
		*******************************************************************
		功  能:  取当前图表通用万能配置的实例，此实现将可以配置图表的所有功能;
		参  数:  <无>;
		返回值:  <IGeneralOptions*> 图表通用万能配置的实例;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual void SetGroup(const wchar_t* wzGroup) = 0;
		virtual wchar_t* GetGroup() const = 0;

		/*@function
		*******************************************************************
		功  能:  取当前图表通用万能配置的实例，此实现将可以配置图表的所有功能;
		参  数:  <无>;
		返回值:  <IGeneralOptions*> 图表通用万能配置的实例;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual int GetWidth() = 0;

		/*@function
		*******************************************************************
		功  能:  取当前图表通用万能配置的实例，此实现将可以配置图表的所有功能;
		参  数:  <无>;
		返回值:  <IGeneralOptions*> 图表通用万能配置的实例;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual int GetHeight() = 0;

		/*@function
		*******************************************************************
		功  能:  取当前图表通用万能配置的实例，此实现将可以配置图表的所有功能;
		参  数:  <nWidth> 图表的宽度，小于等于0时自动取容器的宽度;
		         <nHeigth> 图表的高度，小于等于0时自动取容器的高度;
				 <slient> 是否禁止抛出事件。默认为 false;
				 <nDuration> 过渡动画时间长度，单位毫秒，默认为0即不使用动画;
				 <eValue> 过渡动画的类型，nDuration不为0时有效;
		返回值:  <int> 错误码;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual int Resize(int nWidth = 0, int nHeigth = 0, bool slient = false, int nDuration = 0, EAnimationEasing eValue = EAnimationEasing::EAE_Linear) = 0;

		/*@function
		*******************************************************************
		功  能:  触发图表行为事件;
		参  数:  <pAction> 希望图表执行的动作;
		返回值:  <int> 错误码;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual int DispatchAction(IAction* pAction) = 0;

		/*@function
		*******************************************************************
		功  能:  指定当前图表的事件，最终的事件将在 IChartEventDelegate 中响应;
		         可以分多次调用，以让图表响应多种事件;
		说  明:  ECharts 中的事件有两种，一种是鼠标事件，在鼠标点击某个图形上会触发，
		         还有一种是 调用 dispatchAction 后触发的事件。每个 action 都会有对应的事件
		参  数:  <eValue>  事件类型;
		         <wzQuery> 可选的过滤条件，能够只在指定的组件或者元素上进行响应;
				           例如："series","series.line","xAxis.category"
		返回值:  <int> 错误码;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual int On(EChartEvent eValue, const wchar_t* wzQuery = nullptr) = 0;

		/*@function
		*******************************************************************
		功  能:  取消指定当前图表的事件;
		参  数:  <无>;
		返回值:  <int> 错误码;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual int Off(EChartEvent eValue) = 0;

		/*@function
		*******************************************************************
		功  能:  此接口用于，在大数据量（百万以上）的渲染场景，分片加载数据和增量渲染;
		注  意:  1. 现在不支持 系列（series） 使用 dataset 同时使用 appendData，只支持系
					列使用自己的 series.data 时使用 appendData。
				 2. 目前支持的图有：ECharts 基础版本的 散点图（scatter） 和 线图（lines）;
		参  数:  <nSeriesIndex> 要增加数据的系列序号;
				 <pData> 增加的数据;
		返回值:  <int> 错误码;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual int AppendData(int nSeriesIndex, IQueue* pData) = 0;

		/*@function
		*******************************************************************
		功  能:  此接口用于，在大数据量（百万以上）的渲染场景，分片加载数据和增量渲染;
		注  意:  1. 现在不支持 系列（series） 使用 dataset 同时使用 appendData，只支持系
		            列使用自己的 series.data 时使用 appendData。
				 2. 目前支持的图有：ECharts 基础版本的 散点图（scatter） 和 线图（lines）;
		参  数:  <nSeriesIndex> 要增加数据的系列序号;
		         <vctData> 增加的数据;
		返回值:  <int> 错误码;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual int AppendData(int nSeriesIndex, const std::vector<std::wstring>& vctData) = 0;

		/*@function
		*******************************************************************
		功  能:  清空当前实例，会移除实例中所有的组件和图表。
		参  数:  <无>;
		返回值:  <无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual int Clear() = 0;

		/*@function
		*******************************************************************
		功  能:  销毁实例，销毁后实例无法再被使用。
		参  数:  <无>;
		返回值:  <无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual void Release() = 0;
	};

}
