
/***********************************************************************
 * Module:  IManagerSetting.h
 * Author:  YangPenghui
 * Modified: 2022年6月30日 11:26:28
 * Purpose: Declaration of the class IManagerSetting
 ***********************************************************************/

#pragma once

namespace IIChart
{

	typedef enum _ERenderer
	{
		E_CANVAS = 0,
		E_SVG = 1

	}ERenderer;

	/*@class
	*************************************************************************
	* 类  名: IChartSetting
	* 修  改: 2022年7月1日 15:02:44
	* 功  能: Chart 相关的配置项;
	-----------------------------------------------------------------------
	作  者:  YangPenghui 2022-10-26;
	************************************************************************/
	class IChartSetting
	{
	public:
		/*@function
		*******************************************************************
		功  能:  将配置项重置为默认值;
				 默认的尺寸为容器的大小;
		参  数:  <无>;
		返回值:  <无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual void Reset() = 0;

		/*@function
		*******************************************************************
		功  能:  释放资源;
		参  数:  <无>;
		返回值:  <无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual void Release() = 0;
		
		/*@function
		*******************************************************************
		功  能:  图表区域的高度;
		参  数:  <nHeight>;
		返回值:  <无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual void SetHeight(int nHeight) = 0;
		virtual int  GetHeight() const = 0;

		/*@function
		*******************************************************************
		功  能:  图表区域的宽度;
		参  数:  <nWidth>;
		返回值:  <无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual void SetWidth(int nWidth) = 0;
		virtual int GetWidth() const = 0;

		/*@function
		*******************************************************************
		功  能:  渲染模式，支持'canvas'或者'svg';
		参  数:  <renderer>;
		返回值:  <无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual void SetRenderer(ERenderer renderer) = 0;
		virtual ERenderer GetRenderer() const = 0;

		/*@function
		*******************************************************************
		功  能:  支持脏矩形渲染，仅在 Canvas 模式下可用;
				 在使用 Canvas 渲染器时，脏矩形渲染技术探测并只更新视图变化的部分，
				 而不是任何变动都引起画布完全重绘。这能在一些特殊场景下帮助提高渲染帧率，
				 例如在图形很多时候，鼠标频繁触发一些图形高亮的场景。以往这类场景，会使用
				 额外的 Canvas 层以优化性能，但是这种方式不是所有场景都通用，而且对于复杂
				 的样式的效果并不理想。脏矩形渲染很好地同时满足了性能和显示正确;
		参  数:  <bUseDirtyRect> 默认为 false;
		返回值:  <无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual void SetUseDirtyRect(bool bUseDirtyRect = false) = 0;
		virtual bool GetUseDirtyRect() const = 0;

		/*@function
		*******************************************************************
		功  能:  使用的语言，内置 'ZH' 和 'EN' 两个语言;
		参  数:  <wzLocale>;
		返回值:  <无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual void SetLocale(const wchar_t* wzLocale) = 0;
		virtual wchar_t* GetLocale() const = 0;

		virtual void ImportComponent(const wchar_t* wzName, const wchar_t* wzPath) = 0;
		virtual void ClearComponent() = 0;


		virtual void SetTheme(const wchar_t* wzTheme) = 0;
		virtual wchar_t* GetTheme() const = 0;

	};

}

