
/***********************************************************************
 * Module:  IChartEventDelegate.h
 * Author:  杨鹏辉
 * Modified: 2022年6月30日 11:28:08
 * Purpose: Declaration of the class IChartEventDelegate
 ***********************************************************************/
#pragma once

namespace IIChart
{
	/*@class
	*************************************************************************
	* 类  名: IChartManagerDelegate
	* 修  改: 2022年7月1日 15:02:44
	* 功  能: ChartMange 相关事件的代理类;
	-----------------------------------------------------------------------
	作  者:  YangPenghui 2022-10-26;
	************************************************************************/
	class IChartManagerDelegate
	{
	public:
		/*@function
		******************************************************************
		功  能：ChartManager 初始化完成时触发。
		注  意：可以在此进行 Chart 的绘制;
		参  数: <无> ;
		返回值：<无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual void OnInitialized() = 0;

		/*@function
		******************************************************************
		功  能：将视图容内容 PDF 格式打印结束时触发。
		参  数: <wzPdfFile> 保存的 PDF 文件的全路径;
		        <nError> 打印出错时的错误码;
				<bOk> 打印操作是否完成，true为完成;
		返回值：<无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual void OnPdfPrintFinished(const wchar_t* wzPdfFile, int nError, bool bOk) = 0;

		/*@function
		******************************************************************
		功  能：将容器视图内容保存为图片完成时触发。
		参  数: <wzFile> 保存的图片文件的全路径;
		        <nError> 打印出错时的错误码;
		返回值：<无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual void OnCapturePreviewCompleted(const wchar_t* wzFile, int nError) = 0;
	};

}


