#pragma once
/***********************************************************************
 * Module:  IDataArray.h
 * Author:  杨鹏辉
 * Modified: 2022年7月1日 15:02:44
 * Purpose: Declaration of the class IDataArray
 ***********************************************************************/
#include "Options/Common/IBaseArrayElement.h"
#include "Options/GeneralOptions/Dataset/IDatasetTransformConfigItem.h"

namespace IIChart
{
	namespace Dataset
	{
		/*@class
		*************************************************************************
		* 类  名: IDatasetTransformConfig
		* 修  改: 2022年7月1日 15:02:44
		* 功  能: Dataset 组件数据转换功能的配置;
		* 注  意: and/or/not 三种逻辑运行可以被嵌套
		-----------------------------------------------------------------------
		作  者:  YangPenghui 2023-1-10;
		************************************************************************/
		class IDatasetTransformConfig : virtual public IBaseArrayElement
		{
		public:

			/*@function
			******************************************************************
			功  能：创建一个操作的配置项。
			参  数: <无>;
			返回值：<IDatasetTransformConfigItem*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IDatasetTransformConfigItem* CreateItem() = 0;

			/*@function
			******************************************************************
			功  能：设置操作的配置项;
			注  意：单独的配置项只能一个;而 逻辑与、逻辑或、逻辑非 配置项中可以有多个
			        配置项,并且可以进行嵌套;
			参  数: <pItem> 操作的配置项;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetItem(IDatasetTransformConfigItem* pItem) = 0;

			/*@function
			******************************************************************
			功  能：实现多维度操作的配置项;
			注  意：常用于数据转换器 "sort" 的多维度排序;
			参  数: <pItem> 操作的配置项;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int AddItem(IDatasetTransformConfigItem* pItem) = 0;
			
			/*@function
			******************************************************************
			功  能：添加一个 逻辑与 操作的配置项。
			注  意：单独的配置项只能一个;而 逻辑与、逻辑或、逻辑非 配置项中可以有多个
					配置项,并且可以进行嵌套;
			参  数: <pItem> 操作的配置项;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int AddAndItem(IDatasetTransformConfigItem* pItem) = 0;

			/*@function
			******************************************************************
			功  能：添加一个 逻辑与 操作的配置。
			注  意：用于配置的嵌套操作;
			参  数: <pConfig> 操作的配置;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int AddAndConfig(IDatasetTransformConfig* pConfig) = 0;

			/*@function
			******************************************************************
			功  能：添加一个 逻辑或 操作的配置项。
			注  意：单独的配置项只能一个;而 逻辑与、逻辑或、逻辑非 配置项中可以有多个
					配置项,并且可以进行嵌套;
			参  数: <pItem> 操作的配置项;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int AddOrItem(IDatasetTransformConfigItem* pItem) = 0;

			/*@function
			******************************************************************
			功  能：添加一个 逻辑或 操作的配置。
			注  意：用于配置的嵌套操作;
			参  数: <pConfig> 操作的配置;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int AddOrConfig(IDatasetTransformConfig* pConfig) = 0;

			/*@function
			******************************************************************
			功  能：添加一个 逻辑非 操作的配置项。
			注  意：单独的配置项只能一个;而 逻辑与、逻辑或、逻辑非 配置项中可以有多个
					配置项,并且可以进行嵌套;
			参  数: <pItem> 操作的配置项;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int AddNotItem(IDatasetTransformConfigItem* pItem) = 0;

			/*@function
			******************************************************************
			功  能：添加一个 逻辑非 操作的配置。
			注  意：用于配置的嵌套操作;
			参  数: <pConfig> 操作的配置;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int AddNotConfig(IDatasetTransformConfig* pConfig) = 0;
		};

	}



}