#pragma once
/***********************************************************************
 * Module:  IBarTypeMarkLine.h
 * Author:  杨鹏辉
 * Modified: 2022年7月1日 15:02:44
 * Purpose: 图表标线
 ***********************************************************************/
#include "Common/IEnum.h"
#include "Common/ICallback.h"
#include "Options/GeneralOptions/Series/Bar/IBarTypeMarkLineLabel.h"
#include "Options/GeneralOptions/Series/Bar/IBarTypeMarkLineLineStyle.h"
#include "Options/GeneralOptions/Series/Bar/IBarTypeMarkLineBlur.h"
#include "Options/GeneralOptions/Series/Bar/IBarTypeMarkLineEmphasis.h"
#include "Options/GeneralOptions/Series/Bar/IBarTypeMarkLineData.h"


namespace IIChart
{
	namespace Bar
	{
		/*@class
		*************************************************************************
		* 类  名: IBarTypeMarkLine
		* 修  改: 2022年7月1日 15:02:44
		* 功  能: 图表标线。
		-----------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		************************************************************************/
		class IBarTypeMarkLine
		{
		public:

			/*@function
			******************************************************************
			功  能：图形是否不响应和触发鼠标事件，默认为 false，即响应和触发鼠标事件。
			参  数：<bValue>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetSilent(bool bValue) = 0;
			virtual bool GetSilent() const = 0;

			/*@function
			******************************************************************
			功  能：统计一指定标线两端的标记类型
			参  数：<eValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetSymbol(ESymbol nValue) = 0;
			virtual ESymbol GetSymbol() const = 0;

			/*@function
			******************************************************************
			 功  能：用图片设置 标记的图形
			 注  意：本接口参数只能是以下几种形式：
					 1. 图片链接：
					 'image://http://example.website/a/b.png'
					 2. dataURI：
					 'image://data:image/gif;base64,R0lGODlhEAAQAMQAAORHHOVSKudfOulrSOp3WOyDZu6QdvCchPGolfO0o/XBs/fNwfjZ0frl3/zy7////wAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAACH5BAkAABAALAAAAAAQABAAAAVVICSOZGlCQAosJ6mu7fiyZeKqNKToQGDsM8hBADgUXoGAiqhSvp5QAnQKGIgUhwFUYLCVDFCrKUE1lBavAViFIDlTImbKC5Gm2hB0SlBCBMQiB0UjIQA7'
					 3. 矢量路径：（可以参考 https://www.w3.org/TR/SVG/paths.html#PathData）
					 'path://M30.9,53.2C16.8,53.2,5.3,41.7,5.3,27.6S16.8,2,30.9,2C45,2,56.4,13.5,56.4,27.6S45,53.2,30.9,53.2z M30.9,3.5C17.6,3.5,6.8,14.4,6.8,27.6c0,13.3,10.8,24.1,24.101,24.1C44.2,51.7,55,40.9,55,27.6C54.9,14.4,44.1,3.5,30.9,3.5z M36.9,35.8c0,0.601-0.4,1-0.9,1h-1.3c-0.5,0-0.9-0.399-0.9-1V19.5c0-0.6,0.4-1,0.9-1H36c0.5,0,0.9,0.4,0.9,1V35.8z M27.8,35.8 c0,0.601-0.4,1-0.9,1h-1.3c-0.5,0-0.9-0.399-0.9-1V19.5c0-0.6,0.4-1,0.9-1H27c0.5,0,0.9,0.4,0.9,1L27.8,35.8L27.8,35.8z'
			 参  数：<wzValue>图片的 URL 或 dataURI也可以是 Path,
							  值为 nullptr 或 L"" 时原有的值将会被清空;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetSymbolImage(const wchar_t* wzValue) = 0;
			virtual wchar_t* GetSymbolImage() const = 0;

			/*@function
			******************************************************************
			 功  能：标记的大小，可以设置成诸如 10 这样单一的数字
			 注  意：这里无法像一般的 symbolSize 那样通过数组分别指定高宽。
			 参  数：<nValue>;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetSymbolSize(int nValue) = 0;
			virtual int GetSymbolSize() const = 0;

			/*@function
			******************************************************************
			 功  能：标线数值的精度，在显示平均值线的时候有用。
			 参  数：<nValue>;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetPrecision(int nValue) = 0;
			virtual int  GetPrecision() const = 0;

			/*@function
			******************************************************************
			 功  能：标线的文本。
			 参  数：<无>;
			 返回值：<IBarTypeMarkLineLabel*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IBarTypeMarkLineLabel* GetLabel() = 0;

			/*@function
			******************************************************************
			 功  能：标线的样式。
			 参  数：<无>;
			 返回值：<IBarTypeMarkLineLineStyle*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IBarTypeMarkLineLineStyle* GetLineStyle() = 0;

			/*@function
			******************************************************************
			 功  能：标线高亮时的样式。
			 参  数：<无>;
			 返回值：<IBarTypeMarkLineLineStyle*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IBarTypeMarkLineEmphasis* GetEmphasis() = 0;

			/*@function
			******************************************************************
			 功  能：标线淡出时的样式。淡出的规则跟随所在系列。
			 参  数：<无>;
			 返回值：<IBarTypeMarkLineBlur*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IBarTypeMarkLineBlur* GetBlur() = 0;

			/*@function
			******************************************************************
			功  能：清除所有已添加的的标线数据对象
			参  数：<无>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void ClearData() = 0;

			/*@function
			******************************************************************
			功  能：创建标线的数据对象
			参  数：<无>;
			返回值：<IBarTypeMarkLineData*>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IBarTypeMarkLineData* CreateData() = 0;

			/*@function
			******************************************************************
			功  能：向图表中添加一条标线，此种情况一般是使用 pData->XAxis 或  pData->YAxis 批定的标线；
			参  数：<pData> 标线数据对象，必须指定 XAxis 或 YAxis 的值，不要指定 X 与 Y 的值;
			返回值：<错误码>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int AddData(IBarTypeMarkLineData* pData) = 0;

			/*@function
			******************************************************************
			功  能：向图表中添加一条标线，此种情况一般是使用 pData->X 或  pData->Y 批定的标线；
			参  数：<pData0> 标线起点数据对象，必须指定 X 与 Y 的值,不要使用 XAxis 或 YAxis 属性;
					<pData1> 标线终点数据对象，必须指定 X 与 Y 的值,不要使用 XAxis 或 YAxis 属性;
			返回值：<错误码>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int AddData(IBarTypeMarkLineData* pData0, IBarTypeMarkLineData* pData1) = 0;

			/*@function
			******************************************************************
			功  能：是否开启动画;
			参  数: <bValue>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetAnimation(bool bValue) = 0;
			virtual bool GetAnimation() const = 0;

			/*@function
			******************************************************************
			功  能：是否开启动画的阈值，当单个系列显示的图形数量大于这个阈值时会关闭动画;
			参  数: <nValue>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetAnimationThreshold(int nValue) = 0;
			virtual int  GetAnimationThreshold() const = 0;

			/*@function
			******************************************************************
			功  能：初始动画的时长;
			参  数: <nValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetAnimationDuration(int nValue) = 0;
			virtual int  GetAnimationDuration() const = 0;

			/*@function
			******************************************************************
			功  能：设置 初始动画的时长 的 JavaScript 回调函数
			注  意：可以通过每个数据返回不同的时长实现更戏剧的初始动画效果，例如：
					animationDuration: function (idx) {
						// 越往后的数据时长越大
						return idx * 100;
					}
			参  数：<wzValue> JavaScript 函数字符串，不能为空;
			返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetAnimationDurationJSFun(const wchar_t* wzValue) = 0;

			/*@function
			******************************************************************
			功  能：设置 初始动画的时长 的回调函数
			注  意：可以通过每个数据返回不同的时长实现更戏剧的初始动画效果，例如：
			参  数：<pCallback> ;
			返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetAnimationDurationCallback(AnimationDurationCallback* pCallback) = 0;

			/*@function
			******************************************************************
			功  能：初始动画的缓动效果;
			参  数: <eValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetAnimationEasing(EAnimationEasing eValue) = 0;
			virtual EAnimationEasing GetAnimationEasing() const = 0;

			/*@function
			******************************************************************
			功  能：初始动画的延迟;
			参  数: <nValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetAnimationDelay(int nValue) = 0;
			virtual int  GetAnimationDelay() const = 0;

			/*@function
			******************************************************************
			功  能：设置 初始动画的延迟 的 JavaScript 回调函数
			注  意：可以通过每个数据返回不同的 delay 时间实现更戏剧的初始动画效果。例如：
					animationDelay: function (idx) {
						// 越往后的数据延迟越大
						return idx * 100;
					}
			参  数：<wzValue> JavaScript 函数字符串，不能为空;
			返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetAnimationDelayJSFun(const wchar_t* wzValue) = 0;

			/*@function
			******************************************************************
			功  能：设置 初始动画的延迟 的回调函数
			注  意：可以通过每个数据返回不同的时长实现更戏剧的初始动画效果
			参  数：<pCallback> ;
			返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetAnimationDelayCallback(AnimationDelayCallback* pCallback) = 0;

			/*@function
			******************************************************************
			功  能：数据更新动画的时长
			注  意：可以通过每个数据返回不同的时长实现更戏剧的初始动画效果
			参  数：<nValue> ;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetAnimationDurationUpdate(int nValue) = 0;
			virtual int  GetAnimationDurationUpdate() const = 0;

			/*@function
			******************************************************************
			功  能：设置 数据更新动画的时长 的 JavaScript 回调函数
			注  意：可以通过每个数据返回不同的时长实现更戏剧的更新动画效果。例如：
					animationDurationUpdate: function (idx) {
						// 越往后的数据延迟越大
						return idx * 100;
					}
			参  数：<wzValue> JavaScript 函数字符串, 不能为空;
			返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetAnimationDurationUpdateJSFun(const wchar_t* wzValue) = 0;

			/*@function
			******************************************************************
			功  能：数据更新动画的时长
			注  意：以通过每个数据返回不同的 delay 时间实现更戏剧的初始动画效果。
			参  数：<nValue> ;
			返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetAnimationDurationUpdateCallback(AnimationDurationUpdateCallback* pCallback) = 0;

			/*@function
			******************************************************************
			功  能：数据更新动画的缓动效果
			参  数：<eValue> ;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetAnimationEasingUpdate(EAnimationEasing eValue) = 0;
			virtual EAnimationEasing GetAnimationEasingUpdate() const = 0;

			/*@function
			******************************************************************
			功  能：数据更新动画的延迟
			参  数：<nValue> ;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetAnimationDelayUpdate(int nValue) = 0;
			virtual int  GetAnimationDelayUpdate() const = 0;

			/*@function
			******************************************************************
			功  能：设置 数据更新动画的延迟 的 JavaScript 回调函数
			注  意：可以通过每个数据返回不同的 delay 时间实现更戏剧的更新动画效果。例如：
					animationDelayUpdate: function (idx) {
						// 越往后的数据延迟越大
						return idx * 100;
					}
			参  数：<wzValue> JavaScript 函数字符串;
			返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetAnimationDelayUpdateJSFun(const wchar_t* wzValue) = 0;

			/*@function
			******************************************************************
			功  能：数据更新动画的延迟
			注  意：以通过每个数据返回不同的 delay 时间实现更戏剧的初始动画效果。
			参  数：<nValue> ;
			返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetAnimationDelayUpdateCallback(AnimationDelayUpdateCallback* pCallback) = 0;

		};
	}
}
