#pragma once
/***********************************************************************
 * Module:  IGeneralOptions.h
 * Author:  杨鹏辉
 * Modified: 2022年7月1日 17:06:21
 * Purpose: Declaration of the class IGeneralOptions
 ***********************************************************************/

#include "Options/IChartOption.h"
#include "Options/Common/IBaseArrayElement.h"
#include "Options/GeneralOptions/Series/ISeries.h"
#include "Options/GeneralOptions/Title/ITitle.h"
#include "Options/GeneralOptions/Dataset/IDataset.h"
#include "Options/GeneralOptions/Legend/ILegend.h"
#include "Options/GeneralOptions/Tooltip/ITooltip.h"
#include "Options/GeneralOptions/Grid/IGrid.h"
#include "Options/GeneralOptions/Axis/IAxis.h"
#include "Options/GeneralOptions/StateAnimation/IStateAnimation.h"
#include "Options/GeneralOptions/Polar/IPolar.h"
#include "Options/GeneralOptions/Radar/IRadar.h"
#include "Options/GeneralOptions/AngleAxis/IAngleAxis.h"
#include "Options/GeneralOptions/RadiusAxis/IRadiusAxis.h"
#include "Options/GeneralOptions/Geo/IGeo.h"
#include "Options/GeneralOptions/DataZoom/IDataZoom.h"
#include "Options/GeneralOptions/VisualMap/IVisualMap.h"
#include "Options/GeneralOptions/Series/Bar/IBarType.h"
#include "Options/GeneralOptions/Series/Pie/IPieType.h"
#include "Options/GeneralOptions/Series/Line/ILineType.h"
#include "Options/GeneralOptions/Series/Scatter/IScatterType.h"
#include "Options/GeneralOptions/Series/Radar/IRadarType.h"
#include "Options/GeneralOptions/Series/Map/IMapType.h"



namespace IIChart
{
	class IVisualMap;

	/*@class
	*************************************************************************
	* 类  名: IGeneralOptions
	* 修  改: 2022年7月1日 15:02:44
	* 功  能: 常用 Option 接口;
	-----------------------------------------------------------------------
	作  者:  YangPenghui 2022-10-26;
	************************************************************************/
	class IGeneralOptions : public IChartOption
	{
	public:

		/*@function
		*******************************************************************
		功  能:  图形系列组件，可以同时包含多个图形类型;
		注  意:  如果使用默认Title组件，已经添加多个Title组件将被忽略;
		参  数:  <无> ;
		返回值:  <ITitle*>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual ISeries* GetSeries() = 0;

		/* 普通类型组件 */
		//virtual Dataset::IDataset* GetDataset() = 0;
		virtual Legend::ILegend* GetLegend() = 0;
		virtual Tooltip::ITooltip* GetTooltip() = 0;
		virtual DataZoom::IDataZoom* GetDataZoom() = 0;
		virtual VisualMap::IVisualMap* GetVisualMap() = 0;

		/*@function
		*******************************************************************
		功  能:  使用默认标题组件，包含主标题和副标题;
		注  意:  如果使用默认Title组件，已经添加多个Title组件将被忽略;
		参  数:  <无> ;
		返回值:  <ITitle*>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual Title::ITitle* GetTitle() = 0;

		/*@function
		*******************************************************************
		功  能:  使用默认直角坐标系内绘图网格，单个 grid 内最多可以放置上下两个 X 轴，左右两个 Y 轴;
				 可以在网格上绘制折线图，柱状图，散点图（气泡图）;
		注  意:  如果使用默认grid组件，已经添加多个grid组件将被忽略;
		参  数:  <无> ;
		返回值:  <IGrid*>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual Grid::IGrid* GetGrid() = 0;

		/*@function
		*******************************************************************
		功  能:  使用默认 XAxis 组件，即直角坐标系 grid 中的 x 轴
		注  意:  如果使用默认XAxis组件，已经添加多个XAxis组件将被忽略;
		参  数:  <无> ;
		返回值:  <IGrid*>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual Axis::IAxis* GetXAxis() = 0;

		/*@function
		*******************************************************************
		功  能:  使用默认 YAxis 组件，即直角坐标系 grid 中的 y 轴
		注  意:  如果使用默认YAxis组件，已经添加多个YAxis组件将被忽略;
		参  数:  <无> ;
		返回值:  <IGrid*>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual Axis::IAxis* GetYAxis() = 0;

		/*@function
		*******************************************************************
		功  能:  使用默认坐标系组件，可以用于散点图和折线图。
		         每个极坐标系拥有一个角度轴和一个半径轴。;
		注  意:  如果使用默认组件，已经添加多个组件将被忽略;
		参  数:  <无> ;
		返回值:  <IGrid*>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual Polar::IPolar* GetPolar() = 0;

		/*@function
		*******************************************************************
		功  能:  使用默认 Polar 组件;
		注  意:  如果使用默认组件，已经添加多个组件将被忽略;
		参  数:  <无> ;
		返回值:  <IGrid*>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual RadarComp::IRadar* GetRadar() = 0;

		/*@function
		*******************************************************************
		功  能:  使用默认 AngleAxis 组件;
		注  意:  如果使用默认组件，已经添加多个组件将被忽略;
		参  数:  <无> ;
		返回值:  <IGrid*>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual AngleAxis::IAngleAxis* GetAngleAxis() = 0;

		/*@function
		*******************************************************************
		功  能:  使用默认 RadiusAxis 组件;
		注  意:  如果使用默认组件，已经添加多个组件将被忽略;
		参  数:  <无> ;
		返回值:  <IGrid*>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual RadiusAxis::IRadiusAxis* GetRadiusAxis() = 0;

		/*@function
		*******************************************************************
		功  能:  使用默认 Geo 组件;
		注  意:  如果使用默认组件，已经添加多个组件将被忽略;
		参  数:  <无> ;
		返回值:  <IGrid*>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual Geo::IGeo* GetGeo() = 0;
		
		/*@function
		*******************************************************************
		功  能:  创建 Dataset 组件;
		参  数:  <无> ;
		返回值:  <ITitle*>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual Dataset::IDataset* CreateDataset() = 0;

		/*@function
		*******************************************************************
		功  能:  向图表中增加一个 Dataset 组件;
		注  意:  第一个组件的序号为 0;
		参  数:  <pTitle*> ;
		返回值:  <int> 错误码;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual int Add(Dataset::IDataset* pDataset) = 0;

		/*@function
		*******************************************************************
		功  能:  查询当前的图表中 Dataset 组件的数量;
		参  数:  <无> ;
		返回值:  <int> 组件的数量;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual int GetDatasetCount() = 0;

		/*@function
		*******************************************************************
		功  能:  创建标题组件，包含主标题和副标题;
		注  意:  1. 可以存在任意多个标题组件，这在需要标题进行排版;
				 2. 当单个实例中的多个图表都需要标题时会比较有用;
		参  数:  <无> ;
		返回值:  <ITitle*>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual Title::ITitle* CreateTitle() = 0;

		/*@function
		*******************************************************************
		功  能:  向图表中增加一个 Grid 组件;
		注  意:  第一个组件的序号为 0;
				 如果使用默认Grid组件，已经添加多个Grid组件将被忽略;
		参  数:  <pTitle*> ;
		返回值:  <int> 错误码;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual int Add(Title::ITitle* pTitle) = 0;

		/*@function
		*******************************************************************
		功  能:  查询当前的图表中 Title 组件的数量;
		参  数:  <无> ;
		返回值:  <int> 组件的数量;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual int GetTitleCount() = 0;


		/*@function
		*******************************************************************
		功  能:  创建直角坐标系内绘图网格，单个 grid 内最多可以放置上下两个 X 轴，左右两个 Y 轴;
		         可以在网格上绘制折线图，柱状图，散点图（气泡图），一个Chart中可以存在任意个 grid 组件;
        注  意:  如果使用默认组件，已经添加多个组件将被忽略;				 
		参  数:  <无> ;
		返回值:  <IGrid*>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual Grid::IGrid* CreateGrid() = 0;

		/*@function
		*******************************************************************
		功  能:  向图表中增加一个 Grid 组件;
		注  意:  第一个组件的序号为 0;
		         如果使用默认Grid组件，已经添加多个Grid组件将被忽略;
		参  数:  <IGrid*> ;
		返回值:  <int> 错误码;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual int Add(Grid::IGrid* pGrid) = 0;

		/*@function
		*******************************************************************
		功  能:  查询当前的图表中 Grid 组件的数量;
		参  数:  <无> ;
		返回值:  <int> 组件的数量;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual int GetGridCount() = 0;


		/*@function
		*******************************************************************
		功  能:  创建直角坐标系 grid 中的 x 轴;
		参  数:  <无> ;
		返回值:  <IAxis*>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual Axis::IAxis* CreateXAxis() = 0;

		/*@function
		*******************************************************************
		功  能:  创建直角坐标系 grid 中的 y 轴;
		参  数:  <无> ;
		返回值:  <IAxis*>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual Axis::IAxis* CreateYAxis() = 0;

		/*@function
		*******************************************************************
		功  能:  向直角坐标系 grid 中的增加多个 x 轴，一般情况下单个 grid 组件最多只能放上下两个 x 轴，
				 多于两个 x 轴需要通过配置 offset 属性防止同个位置多个 x 轴的重叠。
		参  数:  <无> ;
		返回值:  <int> 错误码;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual int Add(Axis::IAxis* pAxis) = 0;

		/*@function
		*******************************************************************
		功  能:  当前已添加的直角坐标系 grid 中的 x 轴的数量;
		参  数:  <无> ;
		返回值:  <数量>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual int GetXAxisCount() = 0;

		/*@function
		*******************************************************************
		功  能:  当前已添加的直角坐标系 grid 中的 y 轴的数量;
		参  数:  <无> ;
		返回值:  <数量>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual int GetYAxisCount() = 0;

		/*@function
		*******************************************************************
		功  能:  创建极坐标系组件，可以用于散点图和折线图。
		         每个极坐标系拥有一个角度轴和一个半径轴。
		参  数:  <无> ;
		返回值:  <IAxis*>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual Polar::IPolar* CreatePolar() = 0;

		/*@function
		*******************************************************************
		功  能:  增加极坐标系组件。
		注  意:  如果使用默认极坐标组件，已经添加多个极坐标组件将被忽略;
		参  数:  <无> ;
		返回值:  <int> 错误码;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual int Add(Polar::IPolar* pPolar) = 0;

		/*@function
		*******************************************************************
		功  能:  当前已添加的极坐标系组件的数量;
		参  数:  <无> ;
		返回值:  <数量>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual int GetPolarCount() = 0;

		/*@function
		*******************************************************************
		功  能:  创建雷达图坐标系组件，只适用于雷达图。雷达图坐标系与极坐标系不同的是
		         它的每一个轴（indicator 指示器）都是一个单独的维度，可以通过 name、
				 axisLine、axisTick、axisLabel、splitLine、 splitArea 几个配置项配置
				 指示器坐标轴线的样式。
		参  数:  <无> ;
		返回值:  <IRadar*>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual RadarComp::IRadar* CreateRadar() = 0;

		/*@function
		*******************************************************************
		功  能:  增加雷达图坐标系组件.
		注  意:  如果使用默认雷达图坐标系组件，已经添加多个雷达图组件将被忽略;
		参  数:  <无> ;
		返回值:  <int> 错误码;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual int Add(RadarComp::IRadar* pRadar) = 0;

		/*@function
		*******************************************************************
		功  能:  当前已添加的雷达图坐标系组件的数量;
		参  数:  <无> ;
		返回值:  <数量>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual int GetRadarCount() = 0;

		/*@function
		*******************************************************************
		功  能:  创建极坐标系的角度轴。
		参  数:  <无> ;
		返回值:  <IAngleAxis*>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual AngleAxis::IAngleAxis* CreateAngleAxis() = 0;

		/*@function
		*******************************************************************
		功  能:  增加极坐标系的角度轴组件.
		注  意:  如果使用默认极坐标系的角度轴组件，已经添加多个极坐标系的角度轴组件将被忽略;
		参  数:  <无> ;
		返回值:  <int> 错误码;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual int Add(AngleAxis::IAngleAxis* pAngleAxis) = 0;

		/*@function
		*******************************************************************
		功  能:  当前已添加的极坐标系的角度轴组件的数量;
		参  数:  <无> ;
		返回值:  <数量>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual int GetAngleAxisCount() = 0;

		/*@function
		*******************************************************************
		功  能:  创建极坐标系的径向轴组件。
		参  数:  <无> ;
		返回值:  <IRadiusAxis*>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual RadiusAxis::IRadiusAxis* CreateRadiusAxis() = 0;

		/*@function
		*******************************************************************
		功  能:  增加极坐标系的径向轴组件.
		注  意:  如果使用默认极坐标系的径向轴组件，已经添加多个极坐标系的径向轴组件将被忽略;
		参  数:  <无> ;
		返回值:  <int> 错误码;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual int Add(RadiusAxis::IRadiusAxis* pRadiusAxis) = 0;

		/*@function
		*******************************************************************
		功  能:  当前已添加的极坐标系的径向轴组件的数量;
		参  数:  <无> ;
		返回值:  <数量>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual int GetRadiuAxisCount() = 0;

		/*@function
		*******************************************************************
		功  能:  创建地理坐标系组件，地理坐标系组件用于地图的绘制，支持在地理坐标系上绘制散点图，线集。
		参  数:  <无> ;
		返回值:  <IGeo*>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual Geo::IGeo* CreateGeo() = 0;

		/*@function
		*******************************************************************
		功  能:  增加地理坐标系组件.
		注  意:  如果使用默认地理坐标系组件，已经添加多个地理坐标系组件将被忽略;
		参  数:  <无> ;
		返回值:  <int> 错误码;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual int Add(Geo::IGeo* pGeo) = 0;

		/*@function
		*******************************************************************
		功  能:  当前已添加的地理坐标系组件的数量;
		参  数:  <无> ;
		返回值:  <数量>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual int GetGeoCount() = 0;

		/*@function
		*******************************************************************
		功  能:  是否是暗黑模式，默认会根据背景色 backgroundColor 的亮度自动设置;
		         如果是设置了容器的背景色而无法判断到，就可以使用该配置手动指定，
				 IIChart 会根据是否是暗黑模式调整文本等的颜色。
		参  数:  <无> ;
		返回值:  <int> 颜色的数量;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual void SetDarkMode(bool bValue) = 0;
		virtual bool GetDarkMode() const = 0;

		/*@function
		*******************************************************************
		功  能:  取当前调色盘颜色列表中颜色的数量;
		参  数:  <无> ;
		返回值:  <int> 颜色的数量;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual int GetColorCount() = 0;

		/*@function
		*******************************************************************
		功  能:  向调色盘颜色列表添加一种颜色;
				 颜色的值可以是以下三种形式：
				 1. 'rgb(128, 128, 128)';
				 2. 'rgba(128, 128, 128, 0.5)';
				 3. '#3ba272';
		参  数:  <wzValue> ;
		返回值:  <无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual int  AddColor(const wchar_t* wzValue) = 0;

		/*@function
		*******************************************************************
		功  能:  向调色盘颜色列表添加一种颜色;
		参  数:  <wzName> ;
		返回值:  <无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual void AddColor(int nR, int nG, int nB, float nTransparent = 1) = 0;

		/*@function
		*******************************************************************
		功  能:  设置调色盘颜色列表，原有的颜色将被替换掉;
				 颜色的值可以是以下三种形式：
				 1. 'rgb(128, 128, 128)';
				 2. 'rgba(128, 128, 128, 0.5)';
				 3. '#3ba272';
		参  数:  <vctValue> 颜色列表;
		返回值:  <无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual void SetColor(const std::vector<wstring>& vctValue) = 0;

		/*@function
		*******************************************************************
		功  能:  创建一个IColor*;可以用此对象设置纹理;
		参  数:  <无> ;
		返回值:  <IColor*> ;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual IColor* CreateColor() = 0;

		/*@function
		*******************************************************************
		功  能:  设置调色盘颜色列表，原有的颜色将被替换掉;
				 颜色的值可以是以下4种形式：
				 1. 'rgb(128, 128, 128)';
				 2. 'rgba(128, 128, 128, 0.5)';
				 3. '#3ba272';
				 4. IColor* ;
		参  数:  <pQueue> 颜色列表;
		返回值:  <无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual int SetColor(IQueue* pQueue) = 0;

		/*@function
		*******************************************************************
		功  能:  设置背景色，默认无背景;
				 颜色的值可以是以下3种形式：
				 1. 'rgb(128, 128, 128)';
				 2. 'rgba(128, 128, 128, 0.5)';
				 3. '#3ba272';
		参  数:  <pQueue> 颜色列表;
		返回值:  <无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual int  SetBackgroundColor(const wchar_t* wzValue) = 0;

		/*@function
		*******************************************************************
		功  能:  设置背景色，默认无背景;
		参  数:  <略> 颜色;
		返回值:  <无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual void SetBackgroundColor(int nR, int nG, int nB, float nTransparent = 1) = 0;

		/*@function
		*******************************************************************
		功  能:  设置背景色，默认无背景;
		参  数:  <pColor> 支持纹理;
		返回值:  <无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual int SetBackgroundColor(IColor* pColor) = 0;

		/*@function
		******************************************************************
		功  能：是否开启动画;
		参  数: <bValue>;
		返回值：<无>;
		 ------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual void SetAnimation(bool bValue) = 0;
		virtual bool GetAnimation() const = 0;

		/*@function
		******************************************************************
		功  能：是否开启动画的阈值，当单个系列显示的图形数量大于这个阈值时会关闭动画;
		参  数: <nValue>;
		返回值：<无>;
		 ------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual void SetAnimationThreshold(int nValue) = 0;
		virtual int  GetAnimationThreshold() const = 0;

		/*@function
		******************************************************************
		功  能：初始动画的时长;
		参  数: <nValue>;
		返回值：<无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual void SetAnimationDuration(int nValue) = 0;
		virtual int  GetAnimationDuration() const = 0;

		/*@function
		******************************************************************
		功  能：设置 初始动画的时长 的 JavaScript 回调函数
		注  意：可以通过每个数据返回不同的时长实现更戏剧的初始动画效果，例如：
				animationDuration: function (idx) {
					// 越往后的数据时长越大
					return idx * 100;
				}
		参  数：<wzValue> JavaScript 函数字符串，不能为空;
		返回值：<无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual int SetAnimationDurationJSFun(const wchar_t* wzValue) = 0;

		/*@function
		******************************************************************
		功  能：设置 初始动画的时长 的回调函数
		注  意：可以通过每个数据返回不同的时长实现更戏剧的初始动画效果，例如：
		参  数：<pCallback> ;
		返回值：<无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual int SetAnimationDurationCallback(AnimationDurationCallback* pCallback) = 0;

		/*@function
		******************************************************************
		功  能：初始动画的缓动效果;
		参  数: <eValue>;
		返回值：<无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual void SetAnimationEasing(EAnimationEasing eValue) = 0;
		virtual EAnimationEasing GetAnimationEasing() const = 0;

		/*@function
		******************************************************************
		功  能：初始动画的延迟;
		参  数: <nValue>;
		返回值：<无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual void SetAnimationDelay(int nValue) = 0;
		virtual int  GetAnimationDelay() const = 0;

		/*@function
		******************************************************************
		功  能：设置 初始动画的延迟 的 JavaScript 回调函数
		注  意：可以通过每个数据返回不同的 delay 时间实现更戏剧的初始动画效果。例如：
				animationDelay: function (idx) {
					// 越往后的数据延迟越大
					return idx * 100;
				}
		参  数：<wzValue> JavaScript 函数字符串，不能为空;
		返回值：<无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual int SetAnimationDelayJSFun(const wchar_t* wzValue) = 0;

		/*@function
		******************************************************************
		功  能：设置 初始动画的延迟 的回调函数
		注  意：可以通过每个数据返回不同的时长实现更戏剧的初始动画效果
		参  数：<pCallback> ;
		返回值：<无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual int SetAnimationDelayCallback(AnimationDelayCallback* pCallback) = 0;

		/*@function
		******************************************************************
		功  能：数据更新动画的时长
		注  意：可以通过每个数据返回不同的时长实现更戏剧的初始动画效果
		参  数：<nValue> ;
		返回值：<无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual void SetAnimationDurationUpdate(int nValue) = 0;
		virtual int  GetAnimationDurationUpdate() const = 0;

		/*@function
		******************************************************************
		功  能：设置 数据更新动画的时长 的 JavaScript 回调函数
		注  意：可以通过每个数据返回不同的时长实现更戏剧的更新动画效果。例如：
				animationDurationUpdate: function (idx) {
					// 越往后的数据延迟越大
					return idx * 100;
				}
		参  数：<wzValue> JavaScript 函数字符串, 不能为空;
		返回值：<无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual int SetAnimationDurationUpdateJSFun(const wchar_t* wzValue) = 0;

		/*@function
		******************************************************************
		功  能：数据更新动画的时长
		注  意：以通过每个数据返回不同的 delay 时间实现更戏剧的初始动画效果。
		参  数：<nValue> ;
		返回值：<无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual int SetAnimationDurationUpdateCallback(AnimationDurationUpdateCallback* pCallback) = 0;

		/*@function
		******************************************************************
		功  能：数据更新动画的缓动效果
		参  数：<eValue> ;
		返回值：<无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual void SetAnimationEasingUpdate(EAnimationEasing eValue) = 0;
		virtual EAnimationEasing GetAnimationEasingUpdate() const = 0;

		/*@function
		******************************************************************
		功  能：数据更新动画的延迟
		参  数：<nValue> ;
		返回值：<无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual void SetAnimationDelayUpdate(int nValue) = 0;
		virtual int  GetAnimationDelayUpdate() const = 0;

		/*@function
		******************************************************************
		功  能：设置 数据更新动画的延迟 的 JavaScript 回调函数
		注  意：可以通过每个数据返回不同的 delay 时间实现更戏剧的更新动画效果。例如：
				animationDelayUpdate: function (idx) {
					// 越往后的数据延迟越大
					return idx * 100;
				}
		参  数：<wzValue> JavaScript 函数字符串;
		返回值：<无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual int SetAnimationDelayUpdateJSFun(const wchar_t* wzValue) = 0;

		/*@function
		******************************************************************
		功  能：数据更新动画的延迟
		注  意：以通过每个数据返回不同的 delay 时间实现更戏剧的初始动画效果。
		参  数：<nValue> ;
		返回值：<无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual int SetAnimationDelayUpdateCallback(AnimationDelayUpdateCallback* pCallback) = 0;

		/*@function
		*******************************************************************
		功  能:  状态切换的动画配置，支持在每个系列里设置单独针对该系列的配置;
		参  数:  <无>;
		返回值:  <IStateAnimation*>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual StateAnimation::IStateAnimation* GetStateAnimation() = 0;


	};

}




