#pragma once
/***********************************************************************
 * Module:  IMinorSplitLine.h
 * Author:  杨鹏辉
 * Modified: 2022年7月1日 15:02:44
 * Purpose: 坐标轴在 grid 区域中的次分隔线。次分割线会对齐次刻度线 minorTick
 ***********************************************************************/
#include "Common\IEnum.h"
#include "Options/GeneralOptions/Axis/IAxisLineStyle.h"

namespace IIChart
{
	namespace Axis
	{
		/*@class
		***********************************************************************
		* 类  名: IMinorSplitLine
		* 修  改: 2022年7月1日 15:02:44
		* 功  能: 坐标轴在 grid 区域中的次分隔线。次分割线会对齐次刻度线 minorTick。
		-----------------------------------------------------------------------
		* 作  者:  YangPenghui 2022-10-26;
		************************************************************************/
		class IMinorSplitLine
		{
		public:

			/*@function
			******************************************************************
			功  能：是否显示次分隔线。默认不显示。
			参  数：<bValue>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetShow(bool bShow) = 0;
			virtual bool GetShow() const = 0;

			/*@function
			******************************************************************
			功  能：次分隔线样式
			参  数：<无>;
			返回值：<IAxisLineStyle*>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IAxisLineStyle* GetLineStyle() = 0;
		};
	}
}
