#pragma once
/***********************************************************************
 * Module:  IGrid.h
 * Author:  杨鹏辉
 * Modified: 2022年7月1日 15:02:44
 * Purpose: 直角坐标系内绘图网格，单个 grid 内最多可以放置上下两个 X 轴，
 *          左右两个 Y 轴。可以在网格上绘制折线图，柱状图，散点图（气泡图）。
 ***********************************************************************/
#include "Common\IEnum.h"
#include "Options\Common\IColor.h"
#include "Options\Common\IBaseArrayElement.h"
#include "Options\GeneralOptions\Grid\IGridTooltip.h"



namespace IIChart
{
	namespace Grid
	{
		/*@class
		*************************************************************************
		* 类  名: IGrid
		* 修  改: 2022年7月1日 15:02:44
		* 功  能: 直角坐标系内绘图网格：
		*         1. 单个 grid 内最多可以放置上下两个 X 轴，左右两个 Y 轴
		*         2. 可以在网格上绘制折线图，柱状图，散点图（气泡图）
		-----------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		************************************************************************/
		class IGrid : virtual public IBaseArrayElement
		{
		public:

			/*@function
			******************************************************************
			功  能：组件 ID。默认不指定。指定则可用于在 option 或者 API 中引用组件。
			参  数: <wzValue> 为 nullptr 或 L"" 时为不指定,原有的值将会被清空;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetId(const wchar_t* wzValue) = 0;
			virtual wchar_t* GetId() const = 0;

			/*@function
			******************************************************************
			功  能：是否显示直角坐标系网格。
			参  数: <bValue> ;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetShow(bool bValue) = 0;
			virtual bool GetShow() const = 0;

			/*@function
			******************************************************************
			功  能：所有图形的 zlevel 值。
			注  意: zlevel用于 Canvas 分层，不同zlevel值的图形会放置在不同的 Canvas 中，
			        Canvas 分层是一种常见的优化手段。我们可以把一些图形变化频繁（例如有动画）的
					组件设置成一个单独的zlevel。需要注意的是过多的 Canvas 会引起内存开销的增大，
					在手机端上需要谨慎使用以防崩溃。
					zlevel 大的 Canvas 会放在 zlevel 小的 Canvas 的上面。
			参  数: <nLevel> ;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetZLevel(int nLevel) = 0;
			virtual int  GetZLevel() const = 0;

			/*@function
			******************************************************************
			功  能：组件的所有图形的z值。控制图形的前后顺序。z值小的图形会被z值大的图形覆盖。
			注  意: z相比zlevel优先级更低，而且不会创建新的 Canvas。
			参  数: <nLevel> ;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetZ(int nLevel) = 0;
			virtual int  GetZ() const = 0;

			/*@function
			******************************************************************
			功  能：grid 组件离容器左侧的距离。
			参  数: <nValue> ;
				   <bIsPercent> 为 true 时 nValue 为距离左边界的百分比；
								 为 false 时 nValue 为距离左边界的像素个数；
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetLeft(int nValue, bool bIsPercent = false) = 0;
			virtual int  GetLeft() const = 0;

			/*@function
			******************************************************************
			功  能：grid 组件离容器左侧的距离。
			注  意: 此种形式的设置，组件会根据相应的位置自动对齐
			参  数: <eValue> ;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetLeft(ELeftValue eValue) = 0;
			virtual void GetLeft(ELeftValue* peValue) = 0;

			/*@function
			******************************************************************
			功  能：grid 组件离容器顶边的距离。
			参  数: <nValue> ;
			       <bIsPercent> 为 true 时 nValue 为距离顶边界的百分比；
								 为 false 时 nValue 为距离顶边界的像素个数；
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetTop(int nValue, bool bIsPercent = false) = 0;
			virtual int GetTop() const = 0;

			/*@function
			******************************************************************
			功  能：grid 组件离容器顶边的距离。
			注  意: 此种形式的设置，组件会根据相应的位置自动对齐
			参  数: <eValue> ;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetTop(ETopValue eValue) = 0;
			virtual void GetTop(ETopValue* peValue) = 0;

			/*@function
			******************************************************************
			功  能：grid 组件离容器右侧的距离。
			参  数：<nValue> ;
					<bIsPercent> 为 true 时 nValue 为距离右侧边界的百分比；
								 为 false 时 nValue 为距离右侧边界的像素个数；
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetRight(int nValue, bool bIsPercent = false) = 0;
			virtual int GetRight() const = 0;

			/*@function
			******************************************************************
			功  能：grid 组件离容器底边界的距离。。
			参  数：<nValue> ;
			        <bIsPercent> 为 true 时 nValue 为距离底边界的百分比；
					             为 false 时 nValue 为距离底边界的像素个数；
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetBottom(int nValue, bool bIsPercent = false) = 0;
			virtual int GetBottom() const = 0;

			/*@function
			******************************************************************
			功  能：grid 组件的宽度。默认自适应。
			参  数：<nValue> ;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetWidth(int nValue, bool bIsPercent = false) = 0;
			virtual int GetWidth() const = 0;

			/*@function
			******************************************************************
			功  能：grid 组件的高度。默认自适应。
			参  数：<nValue> ;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetHeight(int nValue, bool bIsPercent = false) = 0;
			virtual int GetHeight() const = 0;

			/*@function
			******************************************************************
			功  能： grid 区域是否包含坐标轴的刻度标签。
			参  数：<bValue> true,包含刻度标签; false,不包含刻度标签;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetContainLabel(bool bValue) = 0;
			virtual bool GetContainLabel() const = 0;

			/*@function
			******************************************************************
			功  能：网格背景色，默认透明。
			注  意：为颜色值时，必须以'#'开头，
			         1. 可以使用 RGB 表示，比如 'rgb(128, 128, 128)'\
					 2. 如果想要加上 alpha 通道，可以使用 RGBA，比如 'rgba(128, 128, 128, 0.5)'
					 3. 可以使用十六进制格式，比如 '#ccc'
					 4. 可以使用 CSS3 预定义的颜色名称，如'red'，'SlateGray';
			参  数：<wzValue> 为 nullptr 或 L"" 时原有的值将会被清空;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetBackgroundColor(const wchar_t* wzValue) = 0;
			virtual wchar_t* GetBackgroundColor() const = 0;

			/*@function
			******************************************************************
			功  能：网格背景色，默认透明。
			参  数：<略>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetBackgroundColor(int nR, int nG, int nB, float fTransparent = 1) = 0;
			virtual void GetBackgroundColor(int* pnR, int* pnG, int* pnB, float* pfTransparent) = 0;

			/*@function
			******************************************************************
			功  能：网格的边框颜色。
			注  意：为颜色值时，必须以'#'开头，
					 1. 可以使用 RGB 表示，比如 'rgb(128, 128, 128)'\
					 2. 如果想要加上 alpha 通道，可以使用 RGBA，比如 'rgba(128, 128, 128, 0.5)'
					 3. 可以使用十六进制格式，比如 '#ccc'
			参  数：<wzValue> 为 nullptr 或 L"" 时原有的值将会被清空;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetBorderColor(const wchar_t* wzValue) = 0;
			virtual wchar_t* GetBorderColor() const = 0;

			/*@function
			******************************************************************
			功  能：网格的边框颜色。
			参  数：<略>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetBorderColor(int nR, int nG, int nB, float fTransparent = 1) = 0;
			virtual void GetBorderColor(int* pnR, int* pnG, int* pnB, float* pfTransparent) = 0;

			/*@function
			******************************************************************
			功  能：网格的边框线宽。
			参  数：<nValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetBorderWidth(int nValue) = 0;
			virtual int GetBorderWidth() const = 0;

			/*@function
			*****************************************************************
			功  能：图形阴影的模糊大小。该属性配合 shadowColor,shadowOffsetX, shadowOffsetY 
			       一起设置图形的阴影效果
			注  意：此配置项生效的前提是，设置了 show : true 以及值不为 tranparent 的背
			       景色 backgroundColor。
			参  数：<nValue> 图形阴影的模糊大小;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetShadowBlur(int nValue) = 0;
			virtual int GetShadowBlur() const = 0;

			/*@function
			*****************************************************************
			功  能：阴影颜色。
			参  数：<wzValue> 为 nullptr 或 L"" 时原有的值将会被清空;支持以下方式的颜色值：
							  1. 可以使用 RGB 表示，比如 'rgb(128, 128, 128)'\
							  2. 如果想要加上 alpha 通道，可以使用 RGBA，比如 'rgba(128, 128, 128, 0.5)'
							  3. 可以使用十六进制格式，比如 '#ccc'
							  4. 可以使用 CSS3 预定义的颜色名称，如'red'，'SlateGray';
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetShadowColor(const wchar_t* wzValue) = 0;
			virtual wchar_t* GetShadowColor() const = 0;

			/*@function
			*****************************************************************
			功  能：以 RGBA 方式设置阴影颜色
			参  数：<略>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetShadowColor(int nR, int nG, int nB, float fTransparent = 1) = 0;
			virtual void GetShadowColor(int* pnR, int* pnG, int* pnB, float* pfTransparent) = 0;

			/*@function
			*****************************************************************
			功  能：创建颜色对象;
			注  意：此功能除了可以设置纯色外，还可以设置渐变色和纹理填充;
			参  数：<无> 字符串模板;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IColor* CreateColor() = 0;

			/*@function
			*****************************************************************
			功  能：设置阴影颜色，此方式除可设置纯色外还可以设置为渐变色和纹理填充;
			参  数：<pValue> ;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetShadowColor(IColor* pValue) = 0;

			/*@function
			*****************************************************************
			功  能：阴影水平方向上的偏移距离。
			参  数：<nValue> ;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetShadowOffsetX(int nValue) = 0;
			virtual int GetShadowOffsetX() const = 0;

			/*@function
			*****************************************************************
			功  能：阴影垂直方向上的偏移距离。
			参  数：<nValue> ;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetShadowOffsetY(int nValue) = 0;
			virtual int GetShadowOffsetY() const = 0;

			/*@function
			*****************************************************************
			功  能：本坐标系特定的 tooltip 设定。
			参  数：<无> ;
			返回值：<ITooltip>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual Grid::IGridTooltip* GetTooltip() = 0;

		};
	}

}
