
/***********************************************************************
 * Module:  ITitle.h
 * Author:  杨鹏辉
 * Modified: 2022年7月1日 15:02:44
 * Purpose: 标题组件，包含主标题和副标题。
 *          
 ***********************************************************************/
#pragma once
#include "Common/IEnum.h"
#include "Common/ICallback.h"
#include "Options/Common/IBaseArrayElement.h"
#include "Options/GeneralOptions/Title/ITitleTextStyle.h"
#include "Options/GeneralOptions/Title/ITitleSubTextStyle.h"


namespace IIChart
{
	namespace Title
	{
		/*@class
		*************************************************************************
		* 类  名: ITitle
		* 修  改: 2022年7月1日 15:02:44
		* 功  能: 标题组件，包含主标题和副标题;
		*         1. 可以存在任意多个标题组件，这在需要标题进行排版
		*         2. 当单个实例中的多个图表都需要标题时会比较有用
		-----------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		************************************************************************/
		class ITitle : virtual public IBaseArrayElement
		{
		public:
			/*@function
			******************************************************************
			功  能：组件 ID。默认不指定。指定则可用于在 option 或者 API 中引用组件。
			参  数: <wzValue> ;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetId(const wchar_t* wzValue) = 0;
			virtual wchar_t* GetId() const = 0;

			/*@function
			******************************************************************
			功  能：是否显示标题组件。
			参  数: <wzValue> ;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetShow(bool bValue) = 0;
			virtual bool GetShow() const = 0;

			/*@function
			******************************************************************
			功  能：设置主标题文本;
			参  数：<wzValue> 主标题文本，支持使用 \n 换行;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetText(const wchar_t* wzValue) = 0;
			virtual wchar_t* GetText() const = 0;

			/*@function
			******************************************************************
			功  能：设置主标题文本，此方式可以借助相应的 IRich 接口显示更加丰富的文本风格;
			参  数：<vctFromatterString> 主标题文本内容，可以分多段，每段之间使用wzJoin进行拼接;
			                             每个字符串内部支持使用 \n 换行;
										 每个字符串可以使用,例如：L"{RichStyleName|string value}"的形式,其中：
										 RichStyleName: 为使用 ITitleTextStyle->IRich->CreateStyle()创建的Style的名称;
										                可以用此 IRichStyle 来设置 string value 的样式;
										 string value:  为具体的字符串文本内容;
			        <wzJoin> 将各个FormatterString拼接起来的字符串，支持使用 L"\n" 换行;
					         若其值为 nullptr 或空字符串，则每两个 FromatterString 之间直接拼接;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetTextFormatter(const std::vector<std::wstring>& vctFromatterString, const wchar_t* wzJoin) = 0;

			/*@function
			******************************************************************
			功  能：主标题文本超链接。;
			参  数：<wzValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetLink(const wchar_t* wzValue) = 0;
			virtual wchar_t* GetLink() const = 0;

			/*@function
			******************************************************************
			功  能：指定窗口打开主标题超链接;
			参  数：<eValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetTarget(ETitleTarget eValue) = 0;
			virtual ETitleTarget GetTarget() const = 0;

			/*@function
			******************************************************************
			功  能：主标题文本样式对象;
			参  数：<eValue>;
			返回值：<ITitleTextStyle*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual ITitleTextStyle* GetTextStyle() = 0;

			/*@function
			******************************************************************
			功  能：设置副标题文本;
			参  数：<wzValue> 副标题文本，支持使用 \n 换行;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetSubText(const wchar_t* wzValue) = 0;
			virtual wchar_t* GetSubText() const = 0;

			/*@function
			******************************************************************
			功  能：设置副标题格式化文本，此方式可以借助相应的 IRich 接口显示更加丰富的文本风格;
			参  数：<vctFromatterString> 主标题文本内容，可以分多段，每段之间使用wzJoin进行拼接;
			                             每个字符串内部支持使用 \n 换行;
										 每个字符串可以使用,例如：L"{RichStyleName|string value}"的形式,其中：
										 RichStyleName: 为使用 ITitleTextStyle->IRich->CreateStyle()创建的Style的名称;
										                可以用此 IRichStyle 来设置 string value 的样式;
										 string value:  为具体的字符串文本内容;
			        <wzJoin> 将各个FormatterString拼接起来的字符串，支持使用 L"\n" 换行;
					         若其值为 nullptr 或空字符串，则每两个 FromatterString 之间直接拼接;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetSubTextFormatter(const std::vector<std::wstring>& vctFromatterString, const wchar_t* wzJoin) = 0;

			/*@function
			******************************************************************
			功  能：副标题文本超链接;
			参  数：<wzValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetSubLink(const wchar_t* wzValue) = 0;
			virtual wchar_t* GetSubLink() const = 0;

			/*@function
			******************************************************************
			功  能：指定窗口打开副标题超链接;
			参  数：<eValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetSubTarget(ETitleTarget eValue) = 0;
			virtual ETitleTarget GetSubTarget() const = 0;

			/*@function
			******************************************************************
			功  能：副标题文本样式对象;
			参  数：<eValue>;
			返回值：<ITitleSubTextStyle*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual ITitleSubTextStyle* GetSubTextStyle() = 0;

			/*@function
			******************************************************************
			功  能：整体（包括 text 和 subtext）的水平对齐;
			参  数：<eValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetTextAlign(EAlign eValue) = 0;
			virtual EAlign GetTextAlign() const = 0;

			/*@function
			******************************************************************
			功  能：整体（包括 text 和 subtext）的垂直对齐;
			参  数：<eValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetTextVerticalAlign(EVerticalAlign eValue) = 0;
			virtual EVerticalAlign GetTextVerticalAlign() const = 0;

			/*@function
			******************************************************************
			功  能：是否触发事件;
			参  数：<bValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetTriggerEvent(bool bValue) = 0;
			virtual bool GetTriggerEvent() const = 0;

			/*@function
			******************************************************************
			功  能：标题内边距，单位px;
			注  意: 文字块的 width 和 height 指定的是内容高宽，不包含 padding。
			参  数：<nValue> 边距值，例如 4：表示 padding: [4, 4, 4, 4];;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void  SetPadding(int nValue) = 0;
			virtual void  GetPadding(int* pnValue) = 0;

			/*@function
			******************************************************************
			功  能：标题内边距，单位px;
			注  意: 文字块的 width 和 height 指定的是内容高宽，不包含 padding。
			参  数：<nValue1> 边距值1
				   <nValue2> 边距值2
				   例如 [3, 4]：表示 padding: [3, 4, 3, 4];
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void  SetPadding(int nValue1, int nValue2) = 0;
			virtual void  GetPadding(int* pnValue1, int* pnValue2) = 0;

			/*@function
			******************************************************************
			功  能：标题内边距，单位px;
			注  意: 文字块的 width 和 height 指定的是内容高宽，不包含 padding。
			参  数：<nTop, nRight, nBottom, nLeft> 分别表示 [上, 右, 下, 左] 的边距
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetPadding(int nTop, int nRight, int nBottom, int nLeft) = 0;
			virtual void GetPadding(int* pnTop, int* pnRight, int* pnBottom, int* pnLeft) = 0;

			/*@function
			******************************************************************
			功  能：主副标题之间的间距，单位px;
			参  数：<nValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetItemGap(int nValue) = 0;
			virtual int  GetItemGap() const = 0;

			/*@function
			******************************************************************
			功  能：所有图形的 zlevel 值。
			注  意: zlevel用于 Canvas 分层，不同zlevel值的图形会放置在不同的 Canvas 中，
					Canvas 分层是一种常见的优化手段。我们可以把一些图形变化频繁（例如有动画）的
					组件设置成一个单独的zlevel。需要注意的是过多的 Canvas 会引起内存开销的增大，
					在手机端上需要谨慎使用以防崩溃。
					zlevel 大的 Canvas 会放在 zlevel 小的 Canvas 的上面。
			参  数: <nLevel> ;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetZLevel(int nLevel) = 0;
			virtual int  GetZLevel() const = 0;

			/*@function
			******************************************************************
			功  能：组件的所有图形的z值。控制图形的前后顺序。z值小的图形会被z值大的图形覆盖。
			注  意: z相比zlevel优先级更低，而且不会创建新的 Canvas。
			参  数: <nLevel> ;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetZ(int nLevel) = 0;
			virtual int  GetZ() const = 0;

			/*@function
			******************************************************************
			功  能：Title 组件离容器左侧的距离。
			参  数: <nValue> ;
				   <bIsPercent> 为 true 时 nValue 为距离左边界的百分比；
								 为 false 时 nValue 为距离左边界的像素个数；
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetLeft(int nValue, bool bIsPercent = false) = 0;
			virtual int GetLeft() const = 0;

			/*@function
			******************************************************************
			功  能：Title 组件离容器左侧的距离。
			注  意: 此种形式的设置，组件会根据相应的位置自动对齐
			参  数: <eValue> ;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetLeft(ELeftValue eValue) = 0;
			virtual void GetLeft(ELeftValue* peValue) = 0;

			/*@function
			******************************************************************
			功  能：Title 组件离容器顶边的距离。
			参  数: <nValue> ;
				   <bIsPercent> 为 true 时 nValue 为距离顶边界的百分比；
								 为 false 时 nValue 为距离顶边界的像素个数；
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetTop(int nValue, bool bIsPercent = false) = 0;
			virtual int GetTop() const = 0;

			/*@function
			******************************************************************
			功  能：Title 组件离容器顶边的距离。
			注  意: 此种形式的设置，组件会根据相应的位置自动对齐
			参  数: <eValue> ;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetTop(ETopValue eValue) = 0;
			virtual void GetTop(ETopValue* peValue) = 0;

			/*@function
			******************************************************************
			功  能：Title 组件离容器右侧的距离。
			参  数：<nValue> ;
					<bIsPercent> 为 true 时 nValue 为距离右侧边界的百分比；
								 为 false 时 nValue 为距离右侧边界的像素个数；
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetRight(int nValue, bool bIsPercent) = 0;
			virtual int GetRight() const = 0;

			/*@function
			******************************************************************
			功  能：Title 组件离容器底边界的距离。。
			参  数：<nValue> ;
					<bIsPercent> 为 true 时 nValue 为距离底边界的百分比；
								 为 false 时 nValue 为距离底边界的像素个数；
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetBottom(int nValue, bool bIsPercent) = 0;
			virtual int GetBottom() const = 0;

			/*@function
			******************************************************************
			功  能：Title背景色，默认透明。
			注  意：为颜色值时，必须以'#'开头，
					 1. 可以使用 RGB 表示，比如 'rgb(128, 128, 128)'\
					 2. 如果想要加上 alpha 通道，可以使用 RGBA，比如 'rgba(128, 128, 128, 0.5)'
					 3. 可以使用十六进制格式，比如 '#ccc'
			参  数：<wzValue> 背景色16进制行;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetBackgroundColor(const wchar_t* wzValue) = 0;
			virtual wchar_t* GetBackgroundColor() const = 0;

			/*@function
			******************************************************************
			功  能：Title背景色，默认透明。
			参  数：<略>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetBackgroundColor(int nR, int nG, int nB, float fTransparent = 1) = 0;
			virtual void GetBackgroundColor(int* pnR, int* pnG, int* pnB, float* pfTransparent) = 0;

			/*@function
			******************************************************************
			功  能：Title的边框颜色。
			注  意：为颜色值时，必须以'#'开头，
					 1. 可以使用 RGB 表示，比如 'rgb(128, 128, 128)'\
					 2. 如果想要加上 alpha 通道，可以使用 RGBA，比如 'rgba(128, 128, 128, 0.5)'
					 3. 可以使用十六进制格式，比如 '#ccc'
			参  数：<wzValue> 背景色16进制行;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetBorderColor(const wchar_t* wzValue) = 0;
			virtual wchar_t* GetBorderColor() const = 0;

			/*@function
			******************************************************************
			功  能：Title的边框颜色。
			参  数：<略>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetBorderColor(int nR, int nG, int nB, float fTransparent = 1) = 0;
			virtual void GetBorderColor(int* pnR, int* pnG, int* pnB, float* pfTransparent) = 0;

			/*@function
			******************************************************************
			功  能：Title的边框线宽。
			参  数：<nValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetBorderWidth(int nValue) = 0;
			virtual int  GetBorderWidth() const = 0;

			/*@function
			******************************************************************
			功  能：文字块的圆角。
			参  数：<nValue> 左上，右上，左下，右下都用一样的圆角;;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void  SetBorderRadius(int nValue) = 0;
			virtual void  GetBorderRadius(int* pnValue) = 0;

			/*@function
			******************************************************************
			功  能：文字块的圆角;
			参  数：<nValue1> 左上、右下的圆角;
				    <nValue2> 右上、左下的圆角;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void  SetBorderRadius(int nValue1, int nValue2) = 0;
			virtual void  GetBorderRadius(int* pnValue1, int* pnValue2) = 0;

			/*@function
			******************************************************************
			功  能：文字块的圆角;
			参  数：<nValue1> 左上的圆角;
				    <nValue2> 右上的圆角;
				    <nValue3> 右下的圆角;
				    <nValue4> 左下的圆角;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetBorderRadius(int nValue1, int nValue2, int nValue3, int nValue4) = 0;
			virtual void GetBorderRadius(int* pnValue1, int* pnValue2, int* pnValue3, int* pnValue4) = 0;

			/*@function
			*****************************************************************
			功  能：图形阴影的模糊大小。该属性配合 shadowColor,shadowOffsetX, shadowOffsetY
				   一起设置图形的阴影效果
			注  意：此配置项生效的前提是，设置了 show : true 以及值不为 tranparent 的背
				   景色 backgroundColor。
			参  数：<nValue> 图形阴影的模糊大小;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetShadowBlur(int nValue) = 0;
			virtual int GetShadowBlur() const = 0;

			/*@function
			*****************************************************************
			功  能：阴影颜色。
			注  意：为颜色值时，必须以'#'开头，
				 1. 可以使用 RGB 表示，比如 'rgb(128, 128, 128)'\
				 2. 如果想要加上 alpha 通道，可以使用 RGBA，比如 'rgba(128, 128, 128, 0.5)'
				 3. 可以使用十六进制格式，比如 '#ccc'
			参  数：<wzValue> 背景色16进制行;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetShadowColor(const wchar_t* wzValue) = 0;
			virtual wchar_t* GetShadowColor() const = 0;

			/*@function
			*****************************************************************
			功  能：以 RGBA 方式设置阴影颜色
			参  数：<略>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetShadowColor(int nR, int nG, int nB, float fTransparent = 1) = 0;
			virtual void GetShadowColor(int* pnR, int* pnG, int* pnB, float* pfTransparent) = 0;

			/*@function
			*****************************************************************
			功  能：创建颜色对象;
			注  意：此功能除了可以设置纯色外，还可以设置渐变色和纹理填充;
			参  数：<无> 字符串模板;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IColor* CreateColor() = 0;

			/*@function
			*****************************************************************
			功  能：设置阴影颜色，此方式除可设置纯色外还可以设置为渐变色和纹理填充;
			参  数：<pValue> ;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetShadowColor(IColor* pValue) = 0;

			/*@function
			*****************************************************************
			功  能：阴影水平方向上的偏移距离。
			参  数：<nValue> ;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetShadowOffsetX(int nValue) = 0;
			virtual int GetShadowOffsetX() const = 0;

			/*@function
			*****************************************************************
			功  能：阴影垂直方向上的偏移距离。
			参  数：<nValue> ;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetShadowOffsetY(int nValue) = 0;
			virtual int GetShadowOffsetY() const = 0;
		};
	}
	
}