#pragma once
/***********************************************************************
 * Module:  IPieType.h
 * Author:  杨鹏辉
 * Modified: 2022年7月1日 15:02:44
 * Purpose: 饼图
	饼图主要用于表现不同类目的数据在总和中的占比。每个的弧度表示数据数量的比例。
	对于一个图表中有多个饼图的场景，可以使用 left、right、top、bottom、width、height
	配置每个饼图系列的位置和视口大小。	radius、label.edgeDistance 等支持百分比的配置项，
	是相对于该配置项决定的矩形的大小而言的。
	Tip: 饼图更适合表现数据相对于总数的百分比等关系。如果只是表示不同类目数据间的大小，
	建议使用 柱状图，人们对于微小的弧度差别相比于微小的长度差别更不敏感，或者也可以通过
	配置 roseType 显示成南丁格尔图，通过半径大小区分数据的大小。
 ***********************************************************************/
#include "Common/IEnum.h"
#include "Common/IFixedQueue.h"
#include "Common/ICallback.h"
#include "Options/Common/ILineStyle.h"
#include "Options/Common/IBaseArrayElement.h"
#include "Options/GeneralOptions/Series/Pie/IPieTypeEmptyCircleStyle.h"
#include "Options/GeneralOptions/Series/Pie/IPieTypeLabel.h"
#include "Options/GeneralOptions/Series/Pie/IPieTypeLabelLine.h"
#include "Options/GeneralOptions/Series/Pie/IPieTypeLabelLayout.h"
#include "Options/GeneralOptions/Series/Pie/IPieTypeItemStyle.h"
#include "Options/GeneralOptions/Series/Pie/IPieTypeEmphasis.h"
#include "Options/GeneralOptions/Series/Pie/IPieTypeBlur.h"
#include "Options/GeneralOptions/Series/Pie/IPieTypeSelect.h"

#include "Options/GeneralOptions/Series/Pie/IPieTypeDimensionsData.h"
#include "Options/GeneralOptions/Series/Pie/IPieTypeData.h"
#include "Options/GeneralOptions/Series/Pie/IPieTypeMarkPoint.h"
#include "Options/GeneralOptions/Series/Pie/IPieTypeMarkLine.h"
#include "Options/GeneralOptions/Series/Pie/IPieTypeMarkArea.h"
#include "Options/Common/ICompactTooltip.h"
#include "Options/Common/IUniversalTransition.h"




namespace IIChart
{
	namespace Pie
	{
		
		/*@class
		*************************************************************************
		* 类  名: IPieType
		* 修  改: 2022年7月1日 15:02:44
		* 功  能: 饼图主要用于表现不同类目的数据在总和中的占比。;
		-----------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		************************************************************************/
		class IPieType : public IBaseArrayElement
		{
		public:

			/*@function
			*******************************************************************
			功  能:  系列类型;
			参  数:  <无>;
			返回值:  <L"PieType">;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual wchar_t* GetType() const = 0;

			/*@function
			*******************************************************************
			功  能:  组件 ID。默认不指定。指定则可用于在 option 或者 API 中引用组件;
			参  数:  <wzValue>;
			返回值:  <无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetId(const wchar_t* wzValue) = 0;
			virtual wchar_t* GetId() const = 0;

			/*@function
			*******************************************************************
			功  能:  系列名称，用于tooltip的显示，legend 的图例筛选，
					 在 setOption 更新数据和配置项时用于指定对应的系列;
			参  数:  <wzValue>;
			返回值:  <无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetName(const wchar_t* wzValue) = 0;
			virtual wchar_t* GetName() const = 0;

			/*@function
			*******************************************************************
			功  能:  从调色盘 option.color 中取色的策略，
			参  数:  <eValue>可取值为：
							 'series'：按照系列分配调色盘中的颜色，同一系列中的所有数据都是用相同的颜色；
							 'data'：按照数据项分配调色盘中的颜色，每个数据项都使用不同的颜色。
			返回值:  <无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetColorBy(EColorBy eValue) = 0;
			virtual EColorBy GetColorBy() const = 0;

			/*@function
			*******************************************************************
			 功  能：是否启用图例 hover 时的联动高亮。
			 参  数：<eValue>;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetLegendHoverLink(bool bValue) = 0;
			virtual bool GetLegendHoverLink() const = 0;

			/*@function
			*******************************************************************
			功  能:  选中模式的配置，表示是否支持多个选中，默认关闭
			参  数:  <eValue>：
			返回值:  <无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetSelectMode(ESelectedMode eValue) = 0;
			virtual ESelectedMode GetSelectMode() const = 0;

			/*@function
			*******************************************************************
			功  能:  选中扇区的偏移距离
			参  数:  <nValue>：
			返回值:  <无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetSelectedOffset(int nValue) = 0;
			virtual int  GetSelectedOffset() const = 0;

			/*@function
			*******************************************************************
			功  能:  饼图的扇区是否是顺时针排布
			参  数:  <bValue>：
			返回值:  <无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetClockwise (bool bValue) = 0;
			virtual bool GetClockwise () const = 0;

			/*@function
			*******************************************************************
			功  能:  起始角度，支持范围[0, 360]。
			参  数:  <nValue>：
			返回值:  <无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetStartAngle(int nValue) = 0;
			virtual int  GetStartAngle() const = 0;

			/*@function
			*******************************************************************
			功  能:  最小的扇区角度（0 ~ 360），用于防止某个值过小导致扇区太小影响交互。
			参  数:  <nValue>：
			返回值:  <无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetMinAngle(int nValue) = 0;
			virtual int  GetMinAngle() const = 0;
			
			/*@function
			*******************************************************************
			功  能:  小于这个角度（0 ~ 360）的扇区，不显示标签（label 和 labelLine）。
			参  数:  <nValue>：
			返回值:  <无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetMinShowLabelAngle(int nValue) = 0;
			virtual int  GetMinShowLabelAngle() const = 0;

			/*@function
			*******************************************************************
			功  能:  是否展示成南丁格尔图，通过半径区分数据大小。
			参  数:  <eValue>：
			返回值:  <无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetRoseType(ERoseType eValue) = 0;
			virtual ERoseType GetRoseType() = 0;

			/*@function
			*******************************************************************
			功  能:  是否启用防止标签重叠策略，默认开启，在标签拥挤重叠的情况下会
			         挪动各个标签的位置，防止标签间的重叠。如果不需要开启该策略，
					 例如圆环图这个例子中需要强制所有标签放在中心位置，可以将该值设为 false。
			参  数:  <bValue>：
			返回值:  <无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetAvoidLabelOverlap (bool bValue) = 0;
			virtual bool GetAvoidLabelOverlap () const = 0;

			/*@function
			*******************************************************************
			功  能:  是否在数据和为0（一般情况下所有数据为0） 的时候仍显示扇区。
			参  数:  <bValue>：
			返回值:  <无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetStillShowZeroSum(bool bValue) = 0;
			virtual bool GetStillShowZeroSum() const = 0;

			/*@function
			*******************************************************************
			功  能:  饼图百分比数值的精度，默认保留小数点后两位。
			参  数:  <nValue>：
			返回值:  <无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetPercentPrecision(int nValue) = 0;
			virtual int  GetPercentPrecision() const = 0;

			/*@function
			*******************************************************************
			功  能:  鼠标悬浮时在图形元素上时鼠标的样式是什么。同 CSS 的 cursor。
			参  数:  <wzValue>：
			返回值:  <无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetCursor(const wchar_t* wzValue) = 0;
			virtual wchar_t* GetCursor() const = 0;

			/*@function
			******************************************************************
			功  能：所有图形的 zlevel 值。
			注  意: zlevel用于 Canvas 分层，不同zlevel值的图形会放置在不同的 Canvas 中，
					Canvas 分层是一种常见的优化手段。我们可以把一些图形变化频繁（例如有动画）的
					组件设置成一个单独的zlevel。需要注意的是过多的 Canvas 会引起内存开销的增大，
					在手机端上需要谨慎使用以防崩溃。
					zlevel 大的 Canvas 会放在 zlevel 小的 Canvas 的上面。
			参  数: <nLevel> ;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetZLevel(int nLevel) = 0;
			virtual int  GetZLevel() const = 0;

			/*@function
			******************************************************************
			功  能：组件的所有图形的z值。控制图形的前后顺序。z值小的图形会被z值大的图形覆盖。
			注  意: z相比zlevel优先级更低，而且不会创建新的 Canvas。
			参  数: <nLevel> ;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetZ(int nLevel) = 0;
			virtual int  GetZ() const = 0;

			/*@function
			******************************************************************
			功  能：组件离容器左侧的距离。
			参  数: <nValue> ;
					<bIsPercentage> true时 nValue为百分比;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetLeft(int nValue, bool bIsPercentage) = 0;
			virtual void GetLeft(int* pnValue, bool* pbIsPercentage) = 0;

			/*@function
			******************************************************************
			功  能：组件离容器左侧的距离。组件会根据相应的位置自动对齐
			参  数: <eValue> ;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetLeft(ELeftValue eValue) = 0;
			virtual void GetLeft(ELeftValue* peValue) = 0;

			/*@function
			******************************************************************
			功  能：组件离容器上侧的距离。
			参  数: <nValue> ;
					<bIsPercentage> true时 nValue为百分比;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetTop(int nValue, bool bIsPercentage) = 0;
			virtual void GetTop(int* pnValue, bool* pbIsPercentage) = 0;

			/*@function
			******************************************************************
			功  能：组件离容器上侧的距离。组件会根据相应的位置自动对齐
			参  数: <eValue> ;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetTop(ETopValue eValue) = 0;
			virtual void GetTop(ETopValue* peValue) = 0;

			/*@function
			******************************************************************
			功  能：组件离容器右侧的距离。
			参  数: <nValue> ;
					<bIsPercentage> true时 nValue为百分比;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetRight(int nValue, bool bIsPercentage) = 0;
			virtual void GetRight(int* pnValue, bool* pbIsPercentage) = 0;

			/*@function
			******************************************************************
			功  能：组件离容器下侧的距离。
			参  数: <nValue> ;
					<bIsPercentage> true时 nValue为百分比;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetBottom(int nValue, bool bIsPercentage) = 0;
			virtual void GetBottom(int* pnValue, bool* pbIsPercentage) = 0;

			/*@function
			*******************************************************************
			功  能:  组件的宽度。默认自适应。
			参  数:  <nValue> 为以像素值计算的宽度;
			返回值:  <无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetWidth(int nValue) = 0;
			virtual int GetWidth() const = 0;

			/*@function
			*******************************************************************
			功  能:  pie chart 组件的高度。默认自适应。
			参  数:  <nValue> 为以像素值计算的高度;
			返回值:  <无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetHeight(int nValue) = 0;
			virtual int GetHeight() const = 0;

			/*@function
			*******************************************************************
			功  能:  pie chart是否在无数据的时候显示一个占位圆。
			参  数:  <bValue>;
			返回值:  <无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetShowEmptyCircle (bool bValue) = 0;
			virtual bool GetShowEmptyCircle () const = 0;

			/*@function
			*******************************************************************
			功  能:  占位圆样式。
			参  数:  <无>;
			返回值:  <IPieTypeEmptyCircleStyle*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IPieTypeEmptyCircleStyle* GetEmptyCircleStyle() = 0;

			/*@function
			*******************************************************************
			功  能:  饼图图形上的文本标签。可用于说明图形的一些数据信息，比如值，名称等。
			参  数:  <无>;
			返回值:  <IPieTypeLabel*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IPieTypeLabel* GetLabel() = 0;

			/*@function
			*******************************************************************
			功  能:  标签的视觉引导线配置。在 label 位置 设置为'outside'的时候会显示视觉引导线。
			参  数:  <无>;
			返回值:  <IPieTypeLabelLine*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IPieTypeLabelLine* GetLabelLine() = 0;

			/*@function
			*******************************************************************
			功  能:  标签的统一布局配置。
			参  数:  <无>;
			返回值:  <IPieTypeLabelLayout*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IPieTypeLabelLayout* GetLabelLayout() = 0;

			/*@function
			*******************************************************************
			功  能:  折线拐点标志的样式。
			参  数:  <无>;
			返回值:  <IPieTypeItemStyle*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IPieTypeItemStyle* GetItemStyle() = 0;

			/*@function
			*******************************************************************
			功  能:  折线图的高亮状态。
			参  数:  <无>;
			返回值:  <IPieTypeEmphasis*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IPieTypeEmphasis* GetEmphasis() = 0;

			/*@function
			*******************************************************************
			功  能:  折线图的淡出状态。
			参  数:  <无>;
			返回值:  <IPieTypeBlur*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IPieTypeBlur* GetBlur() = 0;

			/*@function
			*******************************************************************
			功  能:  折线图的选中状态。
			参  数:  <无>;
			返回值:  <IPieTypeSelect*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IPieTypeSelect* GetSelect() = 0;

			/*@function
			*******************************************************************
			功  能:  饼图的中心（圆心）坐标，数组的第一项是横坐标，第二项是纵坐标。
			         支持设置成百分比，设置成百分比时第一项是相对于容器宽度，第二项是相对于容器高度。
			参  数:  <nX>;
			         <nY>;
					 <bIsPercentage>;
			返回值:  <无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetCenter(int nX, int nY, bool bIsPercentage = false) = 0;
			virtual void GetCenter(int* pnX, int* pnY, bool* pbIsPercentage) = 0;

			/*@function
			*******************************************************************
			功  能:  饼图的半径。支持设置成百分比，设置成百分比时第一项是相对于
			         容器宽度，第二项是相对于容器高度。
			参  数:  <nValue>;
					 <bIsPercentage>为 true 时，表示外半径为可视区尺寸（容器高宽中较小一项）;
			返回值:  <无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetRadius(int nValue, bool bIsPercent) = 0;
			virtual void GetRadius(int* pnValue, bool* pbIsPercent) = 0;

			/*@function
			*******************************************************************
			功  能:  数组的第一项是内半径，第二项是外半径。
			参  数:  <nInner>;
			         <nOutter>;
					 <bIsPercentage>为 true 时，表示内外半径为可视区尺寸（容器高宽中较小一项）;
			返回值:  <无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetRadius(int nInner, int nOutter, bool bIsPercent) = 0;
			virtual void GetRadius(int *pnInner, int *pnOutter,  bool* pbIsPercent) = 0;
			
			/*@function
			*******************************************************************
			功  能：当使用 dataset 时，seriesLayoutBy 指定了 dataset 中用行还是列对应到系列上，
					也就是说，系列“排布”到 dataset 的行还是列上。
			参  数：<eValue> ;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetSeriesLayoutBy(ESeriesLayoutBy eValue) = 0;
			virtual ESeriesLayoutBy GetSeriesLayoutBy() const = 0;

			/*@function
			*******************************************************************
			功  能：如果 series.data 没有指定，并且 dataset 存在，那么就会使用 dataset。
				   datasetIndex 指定本系列使用那个 dataset。
			参  数：<nValue> ;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetDatasetIndex(int nValue) = 0;
			virtual int  GetDatasetIndex() const = 0;

			/*@function
			*******************************************************************
			功  能：该系列所有数据共有的组 ID。组 ID 会被用于分类数据，并在全局
			        过渡动画中决定如何进行合并和分裂动画。如果你使用了dataset组
					件来表达数据，推荐使用encode.itemGroupID来指定哪个维度被编码为组 ID。
			参  数：<wzValue> ;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetDataGroupId(const wchar_t* wzValue) = 0;
			virtual wchar_t* GetDataGroupId() const = 0;

			/*@function
			*******************************************************************
			* 功  能：清空 DimensionsData 数据;
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void ClearDimensionsData() = 0;

			/*@function
			*******************************************************************
			* 功  能：使用 dimensions 定义 series.data 或者 dataset.source 的每个维度的信息。
			* 注  意：此接口创建的数据项可以作为IFixedQueue的元素
			*         -- 使用完后需要调用 Release 释放相资源;
			*         -- IFixedQueue中的元素将由其自动进行内存回收管理;
			* 参  数：<wzName> 名称;
			*         <eType> 类型;
			*         <wzDisplayName> 数据描述;
			* 返回值：IPieTypeDimensionsData*;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IPieTypeDimensionsData* CreateDimensionsData() = 0;
			virtual IPieTypeDimensionsData* CreateDimensionsData(const wchar_t* wzName, EDDTypeValue eType, const wchar_t* wzDisplayName = nullptr) = 0;

			/*@function
			*******************************************************************
			* 功  能：添加纬度的值，如果此维度不想给出定义，则使用 nullptr 即可;
			* 参  数：<wzName> 名称;
			*         <eType> 类型;
			*         <wzDisplayName> 数据描述;
			* 返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int AddDimensionsData(IPieTypeDimensionsData* pData) = 0;
			virtual int AddDimensionsData(const wchar_t* wzName, EDDTypeValue eType, const wchar_t* wzDisplayName = nullptr) = 0;

			/*@function
			*******************************************************************
			* 功  能：在原来的 dimensions 数据后追加新数据;
			*         每个纬度的值之间使用“,”分隔;如：“date,open,close,highest,lowest”
			* 参  数：<wzValue> 使用“,”分隔的dimensions;
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int AddDimensions(const wchar_t* wzValue) = 0;

			/*@function
			*******************************************************************
			* 功  能：在原来的 dimensions 数据后追加新数据;
			* 参  数：<vctValue> dimensions 数据;
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int AddDimensions(const std::vector<std::wstring>& vctValue) = 0;

			/*@function
			*******************************************************************
			* 功  能：使用 dimensions 定义 series.data 或者 dataset.source 的每个维度的信息。
			* 注  意：在原来的 dimensions 数据后追加新数据;
			*         此接口可以方便的实现动态图表显示;
			* 参  数：<pQueue> 新的数据;
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int AddDimensions(IFixedQueue* pQueue) = 0;

			/*@function
			*******************************************************************
			* 功  能：使用 dimensions 定义 series.data 或者 dataset.source 的每个维度的信息。
			*         每个纬度的值之间使用“,”分隔;如：“date,open,close,highest,lowest”
			* 参  数：<wzValue> 使用“,”分隔的dimensions;
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetDimensions(const wchar_t* wzValue) = 0;

			/*@function
			*******************************************************************
			* 功  能：使用 dimensions 定义 series.data 或者 dataset.source 的每个维度的信息。
			* 参  数：<vctValue> dimensions 数据;
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetDimensions(const std::vector<std::wstring>& vctValue) = 0;

			/*@function
			*******************************************************************
			* 功  能：使用 dimensions 定义 series.data 或者 dataset.source 的每个维度的信息。
			* 注  意：原来的 dimensions 数据将被覆盖掉;
			*         此接口可以方便的实现动态图表显示;
			* 参  数：<pQueue> 新的数据;
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetDimensions(IFixedQueue* pQueue) = 0;

			/*@function
			*******************************************************************
			* 功  能：定义 data 的哪个维度被编码成什么
			* 参  数：<无> ;
			* 返回值：IEncode*;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IEncode* GetEncode() = 0;

			/*@function
			*******************************************************************
			* 功  能：实例化单个数据项，通过此方式可以灵活定制要添加的数据的详图样式，使显示更为细腻丰富。
			* 注  意：此接口创建的数据项可以作为IFixedQueue的元素
			*         -- 使用完后需要调用 Release 释放相资源;
			*         -- IFixedQueue中的元素将由其自动进行内存回收管理;
			* 参  数：<无> ;
			* 返回值：IPieTypeData*;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IPieTypeData* CreateData() = 0;
			virtual IPieTypeData* CreateData(const wchar_t* wzName, int nValue) = 0;
			virtual IPieTypeData* CreateData(const wchar_t* wzName, float nValue) = 0;

			/*@function
			*******************************************************************
			* 功  能：清除所有的数据;
			* 参  数：<无>;
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void ClearData() = 0;

			/*@function
			*******************************************************************
			* 功  能：清除指定行的数据;
			* 参  数：<nRowIndex> 指定的行号，第一行为 0;
			* 返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int ClearRow(int nRowIndex) = 0;

			/*@function
			*******************************************************************
			* 功  能：以JSON格式设置此系列数据，原有数据将会被替换。例如：
			* 一维数据格式：
			*     "[7.2, 8.8, 18, 57]"
			* 二维数据格式：
			*     "[
			*         [3.4, 4.5, 15, 43],
			*         [4.2, 2.3, 20, 91],
			*         [10.8, 9.5, 30, 18],
			*         [7.2, 8.8, 18, 57]
			*    ]"
			* 注  意：原有的数据将会被替换;
			*         此方法增加的数据元素可是JSON对象,例如：
			*     "[
			*         12,
			*         34,
			*         {value:56, label: {},itemStyle:{}},
			*         57
			*     ]"
			* 参  数：<wzJson> JSON格式的数据;
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetDataWithJson(const wchar_t* wzJson) = 0;

			/*@function
			*******************************************************************
			* 功  能：以 JSON格式显示已添加的数据;
			* 参  数：<无>;
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual wchar_t* GetDataAsJson() = 0;

			/*@function
			*******************************************************************
			* 功  能：向系列中添加数据，新加的数据将在原来数据的后面;
			* 参  数：<nValue/fValue> 数据值;
			*         <wzName> 数据项名称;
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int  AddData(IPieTypeData* pData) = 0;
			virtual void AddData(const wchar_t* wzName, int nValue) = 0;
			virtual void AddData(const wchar_t* wzName, float fValue) = 0;

			/*@function
			*******************************************************************
			* 功  能：向系列中添加数据，新加的数据将在原来数据的后面;
			* 注  意：-- 当只有一个轴为类目轴（axis.type 为 'category'）的时候，
			*            使用此类方法增加数据
			*         -- 此方法增加的数据只是一个一组数组;
			*         -- 由于原有的数据没有被消除，此方法会使显示的数据量一直增大
			*            如果没有同时增加相应的坐标轴类目数据 data，图表的显示会出问题;
			* 参  数：<pQueue> 其中的数据类型可同时支持 int | float | wstring | object;
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int AddData(const std::vector<int>& vctValues) = 0;
			virtual int AddData(const std::vector<float>& vctValues) = 0;
			virtual int AddData(const std::vector<std::wstring>& vctValues) = 0;
			virtual int AddData(IFixedQueue* pQueue) = 0;
			virtual int AddData(int* pnValue, int nCount) = 0;
			virtual int AddData(float* pfValue, int nCount) = 0;

			/*@function
			******************************************************************
			* 功  能：向系列中添加数据，新加的数据将在原来数据的后面;
			* 参  数：<wzValue> 以“,”隔开的数据，也可以Json数组，或是Json对象数组;例如：
			*                  1. L"['2012', '2013', '2014', '2015']" // Json数组;
			*                  2. L"[\"2012\", \"2013\", \"2014\", \"2015\"]" // Json数组;
			*                  3. L"12, 44, 55, 66, 2"
			*                  4. L"'2015', '2016', '2017'"
			*                     L"43.3, 85.8, 93.7"
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int AddData(const wchar_t* wzValue) = 0;

			/*@function
			*******************************************************************
			* 功  能：给系列赋值，系列原来的数据将被覆盖掉;
			* 注  意：此方法增加的数据只是一个一组数组;
			* 参  数：<vctValues> 新的数据;
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetData(const std::vector<int>& vctValues) = 0;
			virtual int SetData(const std::vector<float>& vctValues) = 0;
			virtual int SetData(const std::vector<std::wstring>& vctValues) = 0;

			/*@function
			*******************************************************************
			* 功  能：给系列赋值，此值为一个一维数组;
			* 注  意：系列原来的数据将被覆盖掉;
			*         此接口可以方便的实现动态图表显示;
			* 参  数：<pQueue> 其中的数据类型可同时支持 int | float | wstring;
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetData(IFixedQueue* pQueue) = 0;

			/*@function
			******************************************************************
			* 功  能：给系列赋值，系列原来的数据将被覆盖掉;
			* 参  数：<wzValue> 以“,”隔开的数据，也可以Json数组，或是Json对象数组;例如：
			*                  1. L"['2012', '2013', '2014', '2015']" // Json数组;
			*                  2. L"[\"2012\", \"2013\", \"2014\", \"2015\"]" // Json数组;
			*                  3. L"12, 44, 55, 66, 2"
			*                  4. L"'2015', '2016', '2017'" // 每个值为字符串
			*                     L"43.3, 85.8, 93.7"       // 每个值为数字
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetData(const wchar_t* wzValue) = 0;

			/*@function
			*******************************************************************
			* 功  能：取数据拥有的行数;
			* 注  意：此行数据元素个数需要与已添的保持一致，否则图表无法正常显示;
			* 参  数：<无>;
			* 返回值：<行数>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int GetDataRowCount() = 0;

			/*@function
			*******************************************************************
			* 功  能：取数据拥有的行数;
			* 注  意：此行数据元素个数需要与已添的保持一致，否则图表无法正常显示;
			* 参  数：<无>;
			* 返回值：<每行数据元素个数>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int GetDataRowElementCount() = 0;

			/*@function
			*******************************************************************
			* 功  能：向系列中添加一行数据;
			* 注  意：此行数据元素个数需要与已添的保持一致，否则图表无法正常显示;
			* 参  数：<vctValues> 添加的数据;
			* 返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int AddRowData(const std::vector<int>& vctValues) = 0;
			virtual int AddRowData(const std::vector<float>& vctValues) = 0;
			virtual int AddRowData(const std::vector<std::wstring>& vctValues) = 0;
			virtual int AddRowData(IFixedQueue* pQueue) = 0;

			/*@function
			******************************************************************
			* 功  能：向系列中添加一行数据;
			* 参  数：<wzValue> 以“,”隔开的数据，也可以Json数组，或是Json对象数组;例如：
			*                  1. L"['2012', '2013', '2014', '2015']" // Json数组;
			*                  2. L"[\"2012\", \"2013\", \"2014\", \"2015\"]" // Json数组;
			*                  3. L"12, 44, 55, 66, 2"
			*                  4. L"'2015', '2016', '2017'" // 每个值为字符串
			*                     L"43.3, 85.8, 93.7"       // 每个值为数字
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int AddRowData(const wchar_t* wzValue) = 0;

			/*@function
			*******************************************************************
			* 功  能：向系列中添加一行数据;
			* 注  意：此行数据元素个数需要与已添的保持一致，否则图表无法正常显示;
			* 参  数：<pnValue> 添加的数据的首地址;
			*         <nCount>  添加的数据的个数;
			* 返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int AddRowData(int* pnValue, int nCount) = 0;
			virtual int AddRowData(float* pfValue, int nCount) = 0;

			/*@function
			*******************************************************************
			* 功  能：设置指定行的数据，此行原来的数据会被替换掉；
			* 注  意：此行数据元素个数需要与已添的保持一致，否则图表无法正常显示;
			* 参  数：<nRowIndex> 指定行的行号;
			*         <vctValues> ;
			* 返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetRowData(int nRowIndex, const std::vector<int>& vctValues) = 0;
			virtual int SetRowData(int nRowIndex, const std::vector<float>& vctValues) = 0;
			virtual int SetRowData(int nRowIndex, const std::vector<std::wstring>& vctValues) = 0;

			/*@function
			*******************************************************************
			* 功  能：设置指定行的数据，此行原来的数据会被替换掉；
			* 注  意：此行数据元素个数需要与已添的保持一致，否则图表无法正常显示;
			*         此接口可以方便的实现动态图表;
			* 参  数：<nRowIndex> 指定行的行号;
			*         <pQueue> 其中的数据类型可同时支持 int | float | wstring;
			* 返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetRowData(int nRowIndex, IFixedQueue* pQueue) = 0;

			/*@function
			******************************************************************
			* 功  能：设置指定行的数据，此行原来的数据会被替换掉；
			* 注  意：此行数据元素个数需要与已添的保持一致，否则图表无法正常显示;
			* 参  数：<wzValue> 以“,”隔开的数据，也可以Json数组，或是Json对象数组;例如：
			*                  1. L"['2012', '2013', '2014', '2015']" // Json数组;
			*                  2. L"[\"2012\", \"2013\", \"2014\", \"2015\"]" // Json数组;
			*                  3. L"12, 44, 55, 66, 2"
			*                  4. L"'2015', '2016', '2017'" // 每个值为字符串
			*                     L"43.3, 85.8, 93.7"       // 每个值为数字
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetRowData(int nRowIndex, const wchar_t* wzValue) = 0;

			/*@function
			*******************************************************************
			* 功  能：设置指定行的数据，此行原来的数据会被替换掉；
			* 注  意：此行数据元素个数需要与已添的保持一致，否则图表无法正常显示;
			* 参  数：<nRowIndex> 指定行的行号;
			*         <pnValue> 添加的数据的首地址;
			*         <nCount>  添加的数据的个数;
			* 返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetRowData(int nRowIndex, int* pnValue, int nCount) = 0;
			virtual int SetRowData(int nRowIndex, float* pfValue, int nCount) = 0;

			/*@function
			*******************************************************************
			功  能：图表标注
			参  数：<无>
			返回值：<IPieTypeMarkPoint*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IPieTypeMarkPoint* GetMarkPoint() = 0;

			/*@function
			*******************************************************************
			功  能：图表标线
			参  数：<无>
			返回值：<IPieTypeMarkLine*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IPieTypeMarkLine* GetMarkLine() = 0;

			/*@function
			*******************************************************************
			功  能：图表标域，常用于标记图表中某个范围的数据，例如标出某段时间投放了广告。
			参  数：<无>
			返回值：<IPieTypeMarkArea*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IPieTypeMarkArea* GetMarkArea() = 0;

			/*@function
			******************************************************************
			功  能：图形是否不响应和触发鼠标事件，默认为 false，即响应和触发鼠标事件。
			参  数: <bValue> ;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetSilent(bool bValue) = 0;
			virtual bool GetSilent() const = 0;

			/*@function
			******************************************************************
			功  能：是否开启动画;
			参  数: <bValue>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetAnimation(bool bValue) = 0;
			virtual bool GetAnimation() const = 0;

			/*@function
			******************************************************************
			功  能：是否开启动画的阈值，当单个系列显示的图形数量大于这个阈值时会关闭动画;
			参  数: <nValue>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetAnimationThreshold(int nValue) = 0;
			virtual int  GetAnimationThreshold() const = 0;

			/*@function
			******************************************************************
			功  能：初始动画的时长;
			参  数: <nValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetAnimationDuration(int nValue) = 0;
			virtual int  GetAnimationDuration() const = 0;

			/*@function
			******************************************************************
			功  能：设置 初始动画的时长 的 JavaScript 回调函数
			注  意：可以通过每个数据返回不同的时长实现更戏剧的初始动画效果，例如：
					animationDuration: function (idx) {
						// 越往后的数据时长越大
						return idx * 100;
					}
			参  数：<wzValue> JavaScript 函数字符串，不能为空;
			返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetAnimationDurationJSFun(const wchar_t* wzValue) = 0;

			/*@function
			******************************************************************
			功  能：设置 初始动画的时长 的回调函数
			注  意：可以通过每个数据返回不同的时长实现更戏剧的初始动画效果，例如：
			参  数：<pCallback> ;
			返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetAnimationDurationCallback(AnimationDurationCallback* pCallback) = 0;

			/*@function
			******************************************************************
			功  能：初始动画的缓动效果;
			参  数: <eValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetAnimationEasing(EAnimationEasing eValue) = 0;
			virtual EAnimationEasing GetAnimationEasing() const = 0;

			/*@function
			******************************************************************
			功  能：初始动画的延迟;
			参  数: <nValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetAnimationDelay(int nValue) = 0;
			virtual int  GetAnimationDelay() const = 0;

			/*@function
			******************************************************************
			功  能：设置 初始动画的延迟 的 JavaScript 回调函数
			注  意：可以通过每个数据返回不同的 delay 时间实现更戏剧的初始动画效果。例如：
					animationDelay: function (idx) {
						// 越往后的数据延迟越大
						return idx * 100;
					}
			参  数：<wzValue> JavaScript 函数字符串，不能为空;
			返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetAnimationDelayJSFun(const wchar_t* wzValue) = 0;

			/*@function
			******************************************************************
			功  能：设置 初始动画的延迟 的回调函数
			注  意：可以通过每个数据返回不同的时长实现更戏剧的初始动画效果
			参  数：<pCallback> ;
			返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetAnimationDelayCallback(AnimationDelayCallback* pCallback) = 0;

			/*@function
			******************************************************************
			功  能：数据更新动画的时长
			注  意：可以通过每个数据返回不同的时长实现更戏剧的初始动画效果
			参  数：<nValue> ;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetAnimationDurationUpdate(int nValue) = 0;
			virtual int  GetAnimationDurationUpdate() const = 0;

			/*@function
			******************************************************************
			功  能：设置 数据更新动画的时长 的 JavaScript 回调函数
			注  意：可以通过每个数据返回不同的时长实现更戏剧的更新动画效果。例如：
					animationDurationUpdate: function (idx) {
						// 越往后的数据延迟越大
						return idx * 100;
					}
			参  数：<wzValue> JavaScript 函数字符串, 不能为空;
			返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetAnimationDurationUpdateJSFun(const wchar_t* wzValue) = 0;

			/*@function
			******************************************************************
			功  能：数据更新动画的时长
			注  意：以通过每个数据返回不同的 delay 时间实现更戏剧的初始动画效果。
			参  数：<nValue> ;
			返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetAnimationDurationUpdateCallback(AnimationDurationUpdateCallback* pCallback) = 0;

			/*@function
			******************************************************************
			功  能：数据更新动画的缓动效果
			参  数：<eValue> ;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetAnimationEasingUpdate(EAnimationEasing eValue) = 0;
			virtual EAnimationEasing GetAnimationEasingUpdate() const = 0;

			/*@function
			******************************************************************
			功  能：数据更新动画的延迟
			参  数：<nValue> ;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetAnimationDelayUpdate(int nValue) = 0;
			virtual int  GetAnimationDelayUpdate() const = 0;

			/*@function
			******************************************************************
			功  能：设置 数据更新动画的延迟 的 JavaScript 回调函数
			注  意：可以通过每个数据返回不同的 delay 时间实现更戏剧的更新动画效果。例如：
					animationDelayUpdate: function (idx) {
						// 越往后的数据延迟越大
						return idx * 100;
					}
			参  数：<wzValue> JavaScript 函数字符串;
			返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetAnimationDelayUpdateJSFun(const wchar_t* wzValue) = 0;

			/*@function
			******************************************************************
			功  能：数据更新动画的延迟
			注  意：以通过每个数据返回不同的 delay 时间实现更戏剧的初始动画效果。
			参  数：<nValue> ;
			返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetAnimationDelayUpdateCallback(AnimationDelayUpdateCallback* pCallback) = 0;

			/*@function
			******************************************************************
			功  能：全局过渡动画相关的配置。
			参  数: <无> ;
			返回值：<IUniversalTransition*>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IUniversalTransition* GetUniversalTransition() = 0;

			/*@function
			******************************************************************
			功  能：本系列特定的 tooltip 设定。
			参  数: <无> ;
			返回值：<ICompactTooltip*>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual ICompactTooltip* GetTooltip() = 0;
		};
	}
	
}
