#pragma once
/***********************************************************************
 * Module:  IDimensionsData.h
 * Author:  杨鹏辉
 * Modified: 2022年7月1日 15:02:44
 * Purpose: 系列中的数据内容数组。数组项可以为单个数值，如：
			[12, 34, 56, 10, 23]

			如果需要在数据中加入其它维度给 visualMap 组件用来映射到颜色等其它图形属性。每个数据项也可以是数组，如：
			[[12, 14], [34, 50], [56, 30], [10, 15], [23, 10]]
			这时候可以将每项数组中的第二个值指定给 visualMap 组件。

			更多时候我们需要指定每个数据项的名称，这时候需要每个项为一个对象：

			[{
				// 数据项的名称
				name: '数据1',
				// 数据项值8
				value: 10
			}, {
				name: '数据2',
				value: 20
			}]
			需要对个别内容指定进行个性化定义时：

			[{
				name: '数据1',
				value: 10
			}, {
				// 数据项名称
				name: '数据2',
				value : 56,
				//自定义特殊 tooltip，仅对该数据项有效
				tooltip:{},
				//自定义特殊itemStyle，仅对该item有效
				itemStyle:{}
			}]
 *          
 ***********************************************************************/
#include "Common/IEnum.h"
#include "Options/Common/IBaseArrayElement.h"
#include "Options/Common/ICompactTooltip.h"
#include "Options/GeneralOptions/Series/Pie/IPieTypeDataLabelLine.h"
#include "Options/GeneralOptions/Series/Pie/IPieTypeDataItemStyle.h"
#include "Options/GeneralOptions/Series/Pie/IPieTypeDataLabel.h"
#include "Options/GeneralOptions/Series/Pie/IPieTypeDataSelect.h"		  
#include "Options/GeneralOptions/Series/Pie/IPieTypeDataBlur.h"
#include "Options/GeneralOptions/Series/Pie/IPieTypeDataEmphasis.h"


namespace IIChart
{
	namespace Pie
	{
		/*@class
		*************************************************************************
		* 类  名: IPieTypeData
		* 修  改: 2022年7月1日 15:02:44
		* 功  能: 系列中的数组项。
		-----------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		************************************************************************/
		class IPieTypeData : virtual public IBaseArrayElement
		{
		public:

			/*@function
			*******************************************************************
			功  能:  数据项名称
			参  数:  <wzValue>;
			返回值:  <无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetName(const wchar_t* wzValue) = 0;
			virtual wchar_t* GetName() const = 0;

			/*@function
			*******************************************************************
			功  能:  单个数据项的整数类型数值
			注  意： 一个 IBarTypeData 对象中只会一个值；并且值为最后的 SetValue
					 调用设置的值;
			参  数:  <nValue>;
			返回值:  <无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetValue(int nValue) = 0;
			virtual void GetValue(int* pnValue) = 0;

			/*@function
			*******************************************************************
			功  能:  单个数据项的小数类型数值
			注  意： 一个 IBarTypeData 对象中只会一个值；并且值为最后的 SetValue
					 调用设置的值;
			参  数:  <nValue>;
			返回值:  <无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetValue(float fValue) = 0;
			virtual void GetValue(float* pfValue) = 0;

			/*@function
			*******************************************************************
			功  能:  该数据项的组 ID。组 ID 会被用于分类数据，并在全局过渡动画中决定如何进行合并和分裂动画。
			参  数:  <nValue>;
			返回值:  <无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetGroupId(const wchar_t* wzValue) = 0;
			virtual wchar_t* GetGroupId() const = 0;

			/*@function
			*******************************************************************
			功  能:  该数据项是否被选中。
			参  数:  <bValue>;
			返回值:  <无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetSelected(bool bValue) = 0;
			virtual bool GetSelected() const = 0;

			/*@function
			*******************************************************************
			功  能: 单个拐点文本的样式设置
			参  数: <无>;
			返回值: <IPieTypeDataLabel*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IPieTypeDataLabel* GetLabel() = 0;

			/*@function
			*******************************************************************
			功  能: 标签的视觉引导线配置
			参  数: <无>;
			返回值: <IPieTypeDataLabelLine*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IPieTypeDataLabelLine* GetLabelLine() = 0;

			/*@function
			*******************************************************************
			功  能: 单个拐点标志的样式设置
			参  数: <无>;
			返回值: <IPieTypeDataItemStyle*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IPieTypeDataItemStyle* GetItemStyle() = 0;

			/*@function
			*******************************************************************
			功  能: 单个拐点的高亮样式和标签设置
			参  数: <无>;
			返回值: <IPieTypeDataEmphasis*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IPieTypeDataEmphasis* GetEmphasis() = 0;

			/*@function
			*******************************************************************
			功  能: 单个拐点文本的样式设置
			参  数: <无>;
			返回值: <单个拐点的淡出样式和标签设置*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IPieTypeDataBlur* GetBlur() = 0;

			/*@function
			*******************************************************************
			功  能: 单个拐点的选中样式和标签设置
			参  数: <无>;
			返回值: <IPieTypeDataSelect*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IPieTypeDataSelect* GetSelect() = 0;

			/*@function
			*******************************************************************
			功  能: 本系列每个数据项中特定的 tooltip 设定。
			参  数: <无>;
			返回值: <ICompactTooltip*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual ICompactTooltip* GetTooltip() = 0;
		};
	}

}