#pragma once
/***********************************************************************
 * Module:  IMapType.h
 * Author:  杨鹏辉
 * Modified: 2022年7月1日 15:02:44
 * Purpose: 地图。
	地图主要用于地理区域数据的可视化，配合 Map 组件用于展示不同区域的
	人口分布密度等数据。
	多个地图类型相同的系列会在同一地图上显示，这时候使用第一个系列的配置项作
	为地图绘制的配置。
 ***********************************************************************/
#include "Common/IEnum.h"
#include "Options/Common/IBaseArrayElement.h"
#include "Options/Common/ICompactTooltip.h"
#include "Options/Common/IUniversalTransition.h"
#include "Options/GeneralOptions/Series/Map/IMapTypeProjection.h"
#include "Options/GeneralOptions/Series/Map/IMapTypeScaleLimit.h"
#include "Options/GeneralOptions/Series/Map/IMapTypeLabelEx.h"
#include "Options/GeneralOptions/Series/Map/IMapTypeItemStyle.h"
#include "Options/GeneralOptions/Series/Map/IMapTypeEmphasis.h"
#include "Options/GeneralOptions/Series/Map/IMapTypeSelect.h"
#include "Options/GeneralOptions/Series/Map/IMapTypeLabelLayout.h"
#include "Options/GeneralOptions/Series/Map/IMapTypeLabelLine.h"
#include "Options/GeneralOptions/Series/Map/IMapTypeData.h"
#include "Options/GeneralOptions/Series/Map/IMapTypeMarkPoint.h"
#include "Options/GeneralOptions/Series/Map/IMapTypeMarkLine.h"
#include "Options/GeneralOptions/Series/Map/IMapTypeMarkArea.h"

namespace IIChart
{
	namespace Map
	{
		/*@class
		*************************************************************************
		* 类  名: IMapType
		* 修  改: 2022年7月1日 15:02:44
		* 功  能: 地图。
		-----------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		************************************************************************/
		class IMapType : virtual public IBaseArrayElement
		{
		public:
			/*@function
			*******************************************************************
			功  能:  系列类型;
			参  数:  <无>;
			返回值:  <L"map">;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual wchar_t* GetType() const = 0;

			/*@function
			*******************************************************************
			功  能:  组件 ID。默认不指定。指定则可用于在 option 或者 API 中引用组件;
			参  数:  <wzValue>;
			返回值:  <无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetId(const wchar_t* wzValue) = 0;
			virtual wchar_t* GetId() const = 0;

			/*@function
			*******************************************************************
			功  能:  系列名称，用于tooltip的显示，legend 的图例筛选，
					 在 setOption 更新数据和配置项时用于指定对应的系列;
			参  数:  <wzValue>;
			返回值:  <无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetName(const wchar_t* wzValue) = 0;
			virtual wchar_t* GetName() const = 0;

			/*@function
			*******************************************************************
			功  能:  从调色盘 option.color 中取色的策略，
			参  数:  <eValue>可取值为：
							 'series'：按照系列分配调色盘中的颜色，同一系列中的所有数据都是用相同的颜色；
							 'data'：按照数据项分配调色盘中的颜色，每个数据项都使用不同的颜色。
			返回值:  <无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetColorBy(EColorBy eValue) = 0;
			virtual EColorBy GetColorBy() const = 0;

			/*@function
			*******************************************************************
			功  能:  使用 registerMap 注册的地图名称。
			参  数:  <wzValue>;
			返回值:  <无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetMap(const wchar_t* wzValue) = 0;
			virtual wchar_t* GetMap() const = 0;

			/*@function
			*******************************************************************
			功  能:  是否开启鼠标缩放和平移漫游。默认不开启。如果只想要开启缩放或者平移，
			         可以设置成 'scale' 或者 'move'。设置成 true 为都开启
			参  数:  <wzValue>;
			返回值:  <无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetRoam(EMapRoam eValue) = 0;
			virtual EMapRoam GetRoam() const = 0;

			/*@function
			*******************************************************************
			功  能:  自定义地图投影，至少需要提供project, unproject两个方法分别用来
			         计算投影后的坐标以及计算投影前的坐标。
			参  数:  <无>;
			返回值:  <IMapTypeProjection*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IMapTypeProjection* GetProjection() = 0;

			/*@function
			*******************************************************************
			功  能:  当前视角的中心点。数组的第一项是横坐标，第二项是纵坐标。
					 支持设置成百分比，设置成百分比时第一项是相对于容器宽度，第二项是相对于容器高度。
			参  数:  <nX>;
					 <nY>;
					 <bIsPercentage>;
			返回值:  <无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetCenter(float nX, float nY, bool bIsPercentage) = 0;
			virtual void GetCenter(float* pnX, float* pnY, bool* pbIsPercentage) = 0;

			/*@function
			*******************************************************************
			功  能:  这个参数用于 scale 地图的长宽比，如果设置了projection则无效。
			说  明:  最终的 aspect 的计算方式是：
			         geoBoundingRect.width / geoBoundingRect.height * aspectScale。
			参  数:  <nX>;
					 <nY>;
					 <bIsPercentage>;
			返回值:  <无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetAspectScale(float fValue) = 0;
			virtual float GetAspectScale() const = 0;

			/*@function
			*******************************************************************
			功  能：二维数组，定义定位的左上角以及右下角分别所对应的经纬度。例如
			参  数：<nTopLeftX, nTopLeftY>;位左上角经纬度
			        <nBottomRightX, nBottomRigthY>;定位右下角经纬度
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetBoundingCoords(int nTopLeftX, int nTopLeftY, int nBottomRightX, int nBottomRigthY) = 0;

			/*@function
			*******************************************************************
			功  能：当前视角的缩放比例。
			参  数：<fValue>
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetZoom(float fValue) = 0;
			virtual float GetZoom() const = 0;

			/*@function
			*******************************************************************
			功  能：滚轮缩放的极限控制，通过min, max最小和最大的缩放值，默认的缩放为1。
			参  数：<无>
			返回值：<IMapTypeScaleLimit*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IMapTypeScaleLimit* GetScaleLimit() = 0;

			/*@function
			*******************************************************************
			功  能：自定义地区的名称映射,如将关键字"China"映射成“中国”，即
			        AddNameMap(L"China", L"中国");
			参  数：<wzKey> 
			        <wzValue>
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void AddNameMap(const wchar_t* wzKey, const wchar_t* wzValue) = 0;
			virtual void ClearNameMap() = 0;

			/*@function
			*******************************************************************
			功  能：默认是 'name'，针对 GeoJSON 要素的自定义属性名称，作为主键用
			        于关联数据点和 GeoJSON 地理要素。 例如：
			参  数：<无>
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetNameProperty(const wchar_t* wzValue) = 0;
			virtual wchar_t* GetNameProperty() const = 0;

			/*@function
			*******************************************************************
			功  能：选中模式的配置，表示是否支持多个选中，默认关闭
			参  数：<eValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetSelectedMode(ESelectedMode eValue) = 0;
			virtual ESelectedMode GetSelectedMode() const = 0;

			/*@function
			*******************************************************************
			* 功  能：图形上的文本标签，可用于说明图形的一些数据信息，比如值，名称等。
			* 参  数：<无>;
			* 返回值：<IMapTypeLabelEx*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IMapTypeLabelEx* GetLabel() = 0;

			/*@function
			*******************************************************************
			* 功  能：地图区域的多边形 图形样式。
			* 参  数：<无>;
			* 返回值：<IMapTypeItemStyle*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IMapTypeItemStyle* GetItemStyle() = 0;

			/*@function
			*******************************************************************
			* 功  能：高亮状态下的多边形和标签样式。
			* 参  数：<无>;
			* 返回值：<IMapTypeEmphasis*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IMapTypeEmphasis* GetEmphasis() = 0;

			/*@function
			*******************************************************************
			* 功  能：选中状态下的多边形和标签样式。
			* 参  数：<无>;
			* 返回值：<IMapTypeSelectEx*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IMapTypeSelect* GetSelect() = 0;

			/*@function
			******************************************************************
			功  能：所有图形的 zlevel 值。
			注  意: zlevel用于 Canvas 分层，不同zlevel值的图形会放置在不同的 Canvas 中，
					Canvas 分层是一种常见的优化手段。我们可以把一些图形变化频繁（例如有动画）的
					组件设置成一个单独的zlevel。需要注意的是过多的 Canvas 会引起内存开销的增大，
					在手机端上需要谨慎使用以防崩溃。
					zlevel 大的 Canvas 会放在 zlevel 小的 Canvas 的上面。
			参  数: <nLevel> ;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetZLevel(int nLevel) = 0;
			virtual int  GetZLevel() const = 0;

			/*@function
			******************************************************************
			功  能：组件的所有图形的z值。控制图形的前后顺序。z值小的图形会被z值大的图形覆盖。
			注  意: z相比zlevel优先级更低，而且不会创建新的 Canvas。
			参  数: <nLevel> ;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetZ(int nLevel) = 0;
			virtual int GetZ() const = 0;

			/*@function
			******************************************************************
			功  能：Map 组件离容器左侧的距离。
			参  数: <nValue> ;
			        <bIsPercentage> true时 nValue为百分比;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetLeft(int nValue, bool bIsPercentage) = 0;
			virtual void GetLeft(int* pnValue, bool* pbIsPercentage) = 0;

			/*@function
			******************************************************************
			功  能：Map 组件离容器左侧的距离。组件会根据相应的位置自动对齐
			参  数: <eValue> ;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetLeft(ELeftValue eValue) = 0;
			virtual void GetLeft(ELeftValue* peValue) = 0;

			/*@function
			******************************************************************
			功  能：Map 组件离容器上侧的距离。
			参  数: <nValue> ;
					<bIsPercentage> true时 nValue为百分比;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetTop(int nValue, bool bIsPercentage) = 0;
			virtual void GetTop(int* pnValue, bool* pbIsPercentage) = 0;

			/*@function
			******************************************************************
			功  能：Map 组件离容器上侧的距离。组件会根据相应的位置自动对齐
			参  数: <eValue> ;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetTop(ETopValue eValue) = 0;
			virtual void GetTop(ETopValue* peValue) = 0;

			/*@function
			******************************************************************
			功  能：Map 组件离容器右侧的距离。
			参  数: <nValue> ;
					<bIsPercentage> true时 nValue为百分比;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetRight(int nValue, bool bIsPercentage) = 0;
			virtual void GetRight(int* pnValue, bool* pbIsPercentage) = 0;

			/*@function
			******************************************************************
			功  能：Map 组件离容器下侧的距离。
			参  数: <nValue> ;
					<bIsPercentage> true时 nValue为百分比;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetBottom(int nValue, bool bIsPercentage) = 0;
			virtual void GetBottom(int* pnValue, bool* pbIsPercentage) = 0;

			/*@function
			******************************************************************
			功  能：layoutCenter 和 layoutSize 提供了除了 left/right/top/bottom/width/height 之外的布局手段。
			        并且保证不超出盒形的范围。此时可以通过 layoutCenter 属性定义地图中心在屏幕中的位置，
					layoutSize 定义地图的大小。
			参  数: <nX> 地图中心的 X 坐标;
			        <nY> 地图中心的 Y 坐标;
					<bIsPercentage> true时 nValue为百分比;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetLayoutCenter(int nX, int nY, bool bIsPercentage) = 0;
			virtual void GetLayoutCenter(int* pnX, int* pnY, bool* pbIsPercentage) = 0;

			/*@function
			******************************************************************
			功  能：地图的大小，见 layoutCenter。支持相对于屏幕宽高的百分比或者
			        绝对的像素大小。
			参  数：<nValue>;
			        <bIsPercentage> true时 nValue为百分比;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetLayoutSize(int nValue, bool bIsPercentage) = 0;
			virtual void GetLayoutSize(int* pnValue, bool* pbIsPercentage) = 0;

			/*@function
			******************************************************************
			功  能：认情况下，map series 会自己生成内部专用的 geo 组件。
			        但是也可以用这个 geoIndex 指定一个 geo 组件。这样的话，map 和 其他 series（例如散点图）
					就可以共享一个 geo 组件了。并且，geo 组件的颜色也可以被这个 map series 控制，从而用 Map 来更改。
					当设定了 geoIndex 后，series-map.map 属性，以及 series-map.itemStyle 等样式配置不再起作用，而是采用 geo 中的相应属性。
			参  数：<nValue>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetGeoIndex(int nValue) = 0;
			virtual int  GetGeoIndex() const = 0;

			/*@function
			******************************************************************
			功  能：多个拥有相同地图类型的系列会使用同一个地图展现，如果多个系列都在同一个区域有值，
			        ECharts 会对这些值统计得到一个数据。这个配置项就是用于配置统计的方式
			参  数：<eValue>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetMapValueCalculation(EMapValueCalculation eValue) = 0;
			virtual EMapValueCalculation GetMapValueCalculation() const = 0;

			/*@function
			******************************************************************
			功  能：在图例相应区域显示图例的颜色标识（系列标识的小圆点），存在 legend 组件时生效。
			参  数：<bValue>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetShowLegendSymbol(bool bValue) = 0;
			virtual bool GetShowLegendSymbol() const = 0;

			/*@function
			******************************************************************
			功  能：当使用 dataset 时，seriesLayoutBy 指定了 dataset 中用行还是列对应到系列上，
			        也就是说，系列“排布”到 dataset 的行还是列上。
			参  数：<无>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetSeriesLayoutBy(ESeriesLayoutBy eValue) = 0;
			virtual ESeriesLayoutBy GetSeriesLayoutBy() const = 0;

			/*@function
			******************************************************************
			功  能：如果 series.data 没有指定，并且 dataset 存在，那么就会使
			        用 dataset。datasetIndex 指定本系列使用那个 dataset。
			参  数：<无>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetDatasetIndex(int nValue) = 0;
			virtual int  GetDatasetIndex() const = 0;

			/*@function
			******************************************************************
			功  能：该系列所有数据共有的组 ID。组 ID 会被用于分类数据，并在全局
			        过渡动画中决定如何进行合并和分裂动画。如果你使用了dataset组
					件来表达数据，推荐使用encode.itemGroupID来指定哪个维度被编码
					为组 ID。
			参  数：<无>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetDataGroupId(const wchar_t* wzValue) = 0;
			virtual wchar_t* GetDataGroupId() const = 0;

			/*@function
			******************************************************************
			* 功  能：标签的统一布局配置。
			* 参  数：<无>;
			* 返回值：<IMapTypeLabelLayout*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IMapTypeLabelLayout* GetLabelLayout() = 0;

			/*@function
			******************************************************************
			* 功  能：标签的统一布局配置。
			* 注  意：该配置项是在每个系列默认的标签布局基础上，统一调整标签的(x, y)位置，
			*         标签对齐等属性以实现想要的标签布局效果。回调函数格式为：
			*         function(params){ return rstParams}
			*         其中 params 属性如下：
			*           // 标签对应数据的 dataIndex
			*			dataIndex: number
			*			// 标签对应的数据类型，只在关系图中会有 node 和 edge 数据类型的区分
			*			dataType?: string
			*			// 标签对应的系列的 index
			*			seriesIndex: number
			*			// 标签显示的文本
			*			text: string
			*			// 默认的标签的包围盒，由系列默认的标签布局决定
			*			labelRect: {x: number, y: number, width: number, height: number}
			*			// 默认的标签水平对齐
			*			align: 'left' | 'center' | 'right'
			*			// 默认的标签垂直对齐
			*			verticalAlign: 'top' | 'middle' | 'bottom'
			*			// 标签所对应的数据图形的包围盒，可用于定位标签位置
			*			rect: {x: number, y: number, width: number, height: number}
			*			// 默认引导线的位置，目前只有饼图(pie)和漏斗图(funnel)有默认标签位置
			*			// 如果没有该值则为 null
			*			labelLinePoints?: number[][]
			*
			*           rstParams 属性如下：
			* 参  数：<无>;
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetLabelLayoutJSFun(const wchar_t* wzValue) = 0;

			/*@function
			******************************************************************
			* 功  能：标签的视觉引导线配置。
			* 参  数：<无>;
			* 返回值：<IMapTypeLabelLine*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IMapTypeLabelLine* GetLabelLine() = 0;

			/*@function
			*******************************************************************
			功  能：实例化单个数据项，通过此方式可以灵活定制要添加的数据的详图样式，使显示更为细腻丰富。
			注  意：此接口创建的数据项可以作为IFixedQueue的元素
					-- 使用完后需要调用 Release 释放相资源;
					-- IFixedQueue中的元素将由其自动进行内存回收管理;
			参  数：<无> ;
			返回值：IGaugeTypeData*;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IMapTypeData* CreateData() = 0;
			virtual IMapTypeData* CreateData(const wchar_t* wzName, int nValue) = 0;
			virtual IMapTypeData* CreateData(const wchar_t* wzName, float fValue) = 0;

			/*@function
			*******************************************************************
			* 功  能：清除所有的数据;
			* 参  数：<无>;
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void ClearData() = 0;

			/*@function
			*******************************************************************
			* 功  能：清除指定行的数据;
			* 参  数：<nRowIndex> 指定的行号，第一行为 0;
			* 返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int ClearRow(int nRowIndex) = 0;

			/*@function
			*******************************************************************
			* 功  能：以JSON格式设置此系列数据，原有数据将会被替换。例如：
			* 一维数据格式：
			*     "[7.2, 8.8, 18, 57]"
			* 二维数据格式：
			*     "[[12, 14], [34, 50], [56, 30], [10, 15], [23, 10]]"
			* 注  意：原有的数据将会被替换;
			*         此方法增加的数据元素可是JSON对象,例如：
			*     "[
			*         12,
			*         34,
			*         {value:56, label: {},itemStyle:{}},
			*         57
			*     ]"
			* 参  数：<wzJson> JSON格式的数据;
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetDataWithJson(const wchar_t* wzJson) = 0;

			/*@function
			*******************************************************************
			* 功  能：以 JSON格式显示已添加的数据;
			* 参  数：<无>;
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual wchar_t* GetDataAsJson() = 0;

			/*@function
			*******************************************************************
			* 功  能：向系列中添加数据，新加的数据将在原来数据的后面;
			* 参  数：<nValue/fValue> 数据值;
			*         <wzName> 数据项名称;
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int AddData(IMapTypeData* pData) = 0;
			virtual void AddData(const wchar_t* wzName, int nValue) = 0;
			virtual void AddData(const wchar_t* wzName, float fValue) = 0;

			/*@function
			*******************************************************************
			* 功  能：向系列中添加数据，新加的数据将在原来数据的后面;
			* 注  意：-- 当只有一个轴为类目轴（axis.type 为 'category'）的时候，
			*            使用此类方法增加数据
			*         -- 此方法增加的数据只是一个一组数组;
			*         -- 由于原有的数据没有被消除，此方法会使显示的数据量一直增大
			*            如果没有同时增加相应的坐标轴类目数据 data，图表的显示会出问题;
			* 参  数：<pQueue> 其中的数据类型可同时支持 int | float | wstring | object;
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int AddData(const std::vector<int>& vctValues) = 0;
			virtual int AddData(const std::vector<float>& vctValues) = 0;
			virtual int AddData(const std::vector<std::wstring>& vctValues) = 0;
			virtual int AddData(IFixedQueue* pQueue) = 0;
			virtual int AddData(int* pnValue, int nCount) = 0;
			virtual int AddData(float* pfValue, int nCount) = 0;

			/*@function
			******************************************************************
			* 功  能：向系列中添加数据，新加的数据将在原来数据的后面;
			* 参  数：<wzValue> 以“,”隔开的数据，也可以Json数组，或是Json对象数组;例如：
			*                  1. L"['2012', '2013', '2014', '2015']" // Json数组;
			*                  2. L"[\"2012\", \"2013\", \"2014\", \"2015\"]" // Json数组;
			*                  3. L"12, 44, 55, 66, 2"
			*                  4. L"'2015', '2016', '2017'"
			*                     L"43.3, 85.8, 93.7"
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int AddData(const wchar_t* wzValue) = 0;

			/*@function
			*******************************************************************
			* 功  能：向系列中添加数据，新加的数据将在原来数据的后面;
			* 参  数：<nValue/fValue> 数据值;
			*         <wzName> 数据项名称;
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int  SetData(IMapTypeData* pData) = 0;
			virtual void SetData(const wchar_t* wzName, int nValue) = 0;
			virtual void SetData(const wchar_t* wzName, float fValue) = 0;

			/*@function
			*******************************************************************
			* 功  能：给系列赋值，系列原来的数据将被覆盖掉;
			* 注  意：此方法增加的数据只是一个一组数组;
			* 参  数：<vctValues> 新的数据;
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetData(const std::vector<int>& vctValues) = 0;
			virtual int SetData(const std::vector<float>& vctValues) = 0;
			virtual int SetData(const std::vector<std::wstring>& vctValues) = 0;

			/*@function
			*******************************************************************
			* 功  能：给系列赋值，此值为一个一维数组;
			* 注  意：系列原来的数据将被覆盖掉;
			*         此接口可以方便的实现动态图表显示;
			* 参  数：<pQueue> 其中的数据类型可同时支持 int | float | wstring;
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetData(IFixedQueue* pQueue) = 0;

			/*@function
			******************************************************************
			* 功  能：给系列赋值，系列原来的数据将被覆盖掉;
			* 参  数：<wzValue> 以“,”隔开的数据，也可以Json数组，或是Json对象数组;例如：
			*                  1. L"['2012', '2013', '2014', '2015']" // Json数组;
			*                  2. L"[\"2012\", \"2013\", \"2014\", \"2015\"]" // Json数组;
			*                  3. L"12, 44, 55, 66, 2"
			*                  4. L"'2015', '2016', '2017'" // 每个值为字符串
			*                     L"43.3, 85.8, 93.7"       // 每个值为数字
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetData(const wchar_t* wzValue) = 0;

			/*@function
			*******************************************************************
			* 功  能：取数据拥有的行数;
			* 注  意：此行数据元素个数需要与已添的保持一致，否则图表无法正常显示;
			* 参  数：<无>;
			* 返回值：<行数>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int GetDataRowCount() = 0;

			/*@function
			*******************************************************************
			* 功  能：取数据拥有的行数;
			* 注  意：此行数据元素个数需要与已添的保持一致，否则图表无法正常显示;
			* 参  数：<无>;
			* 返回值：<每行数据元素个数>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int GetDataRowElementCount() = 0;

			/*@function
			*******************************************************************
			* 功  能：向系列中添加一行数据;
			* 注  意：此行数据元素个数需要与已添的保持一致，否则图表无法正常显示;
			* 参  数：<vctValues> 添加的数据;
			* 返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int AddRowData(const std::vector<int>& vctValues) = 0;
			virtual int AddRowData(const std::vector<float>& vctValues) = 0;
			virtual int AddRowData(const std::vector<std::wstring>& vctValues) = 0;
			virtual int AddRowData(IFixedQueue* pQueue) = 0;

			/*@function
			******************************************************************
			* 功  能：向系列中添加一行数据;
			* 参  数：<wzValue> 以“,”隔开的数据，也可以Json数组，或是Json对象数组;例如：
			*                  1. L"['2012', '2013', '2014', '2015']" // Json数组;
			*                  2. L"[\"2012\", \"2013\", \"2014\", \"2015\"]" // Json数组;
			*                  3. L"12, 44, 55, 66, 2"
			*                  4. L"'2015', '2016', '2017'" // 每个值为字符串
			*                     L"43.3, 85.8, 93.7"       // 每个值为数字
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int AddRowData(const wchar_t* wzValue) = 0;

			/*@function
			*******************************************************************
			* 功  能：向系列中添加一行数据;
			* 注  意：此行数据元素个数需要与已添的保持一致，否则图表无法正常显示;
			* 参  数：<pnValue> 添加的数据的首地址;
			*         <nCount>  添加的数据的个数;
			* 返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int AddRowData(int* pnValue, int nCount) = 0;
			virtual int AddRowData(float* pfValue, int nCount) = 0;

			/*@function
			*******************************************************************
			* 功  能：设置指定行的数据，此行原来的数据会被替换掉；
			* 注  意：此行数据元素个数需要与已添的保持一致，否则图表无法正常显示;
			* 参  数：<nRowIndex> 指定行的行号;
			*         <vctValues> ;
			* 返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetRowData(int nRowIndex, const std::vector<int>& vctValues) = 0;
			virtual int SetRowData(int nRowIndex, const std::vector<float>& vctValues) = 0;
			virtual int SetRowData(int nRowIndex, const std::vector<std::wstring>& vctValues) = 0;

			/*@function
			*******************************************************************
			* 功  能：设置指定行的数据，此行原来的数据会被替换掉；
			* 注  意：此行数据元素个数需要与已添的保持一致，否则图表无法正常显示;
			*         此接口可以方便的实现动态图表;
			* 参  数：<nRowIndex> 指定行的行号;
			*         <pQueue> 其中的数据类型可同时支持 int | float | wstring;
			* 返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetRowData(int nRowIndex, IFixedQueue* pQueue) = 0;

			/*@function
			******************************************************************
			* 功  能：设置指定行的数据，此行原来的数据会被替换掉；
			* 注  意：此行数据元素个数需要与已添的保持一致，否则图表无法正常显示;
			* 参  数：<wzValue> 以“,”隔开的数据，也可以Json数组，或是Json对象数组;例如：
			*                  1. L"['2012', '2013', '2014', '2015']" // Json数组;
			*                  2. L"[\"2012\", \"2013\", \"2014\", \"2015\"]" // Json数组;
			*                  3. L"12, 44, 55, 66, 2"
			*                  4. L"'2015', '2016', '2017'" // 每个值为字符串
			*                     L"43.3, 85.8, 93.7"       // 每个值为数字
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetRowData(int nRowIndex, const wchar_t* wzValue) = 0;

			/*@function
			*******************************************************************
			* 功  能：设置指定行的数据，此行原来的数据会被替换掉；
			* 注  意：此行数据元素个数需要与已添的保持一致，否则图表无法正常显示;
			* 参  数：<nRowIndex> 指定行的行号;
			*         <pnValue> 添加的数据的首地址;
			*         <nCount>  添加的数据的个数;
			* 返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetRowData(int nRowIndex, int* pnValue, int nCount) = 0;
			virtual int SetRowData(int nRowIndex, float* pfValue, int nCount) = 0;

			/*@function
			******************************************************************
			功  能：图表标注。
			参  数: <无> ;
			返回值：<IMapTypeTooltip*>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IMapTypeMarkPoint* GetMarkPoint() = 0;

			/*@function
			******************************************************************
			功  能：图表标线。
			参  数: <无> ;
			返回值：<IMapTypeMarkLine*>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IMapTypeMarkLine* GetMarkLine() = 0;

			/*@function
			******************************************************************
			功  能：图表标域，常用于标记图表中某个范围的数据，例如标出某段时间投放了广告。
			参  数: <无> ;
			返回值：<IMapTypeMarkArea*>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IMapTypeMarkArea* GetMarkArea() = 0;

			/*@function
			******************************************************************
			功  能：图形是否不响应和触发鼠标事件，默认为 false，即响应和触发鼠标事件。
			参  数: <无> ;
			返回值：<IMapTypeMarkArea*>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetSilent(bool bValue) = 0;
			virtual bool GetSilent() const = 0;

			/*@function
			******************************************************************
			功  能：全局过渡动画相关的配置。
			参  数: <无> ;
			返回值：<IMapTypeUniversalTransition*>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IUniversalTransition* GetUniversalTransition() = 0;

			/*@function
			******************************************************************
			功  能：本系列特定的 tooltip 设定。
			参  数: <无> ;
			返回值：<ICompactTooltip*>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual ICompactTooltip* GetTooltip() = 0;

		};
	}

	
}
