#pragma once
/***********************************************************************
 * Module:  IMapTypeData.h
 * Author:  杨鹏辉
 * Modified: 2022年7月1日 15:02:44
 * Purpose: 地图系列中的数据内容数组。数组项可以为单个数值，如：
			 [12, 34, 56, 10, 23]

			 如果需要在数据中加入其它维度给 visualMap 组件用来映射到颜色等其它图形属性。每个数据项也可以是数组，如：
			 [[12, 14], [34, 50], [56, 30], [10, 15], [23, 10]]

			 这时候可以将每项数组中的第二个值指定给 visualMap 组件。
			 更多时候我们需要指定每个数据项的名称，这时候需要每个项为一个对象：
			 [{
				// 数据项的名称
				name: '数据1',
				// 数据项值8
				value: 10
			 }, {
				name: '数据2',
				value: 20
			 }]

			 需要对个别内容指定进行个性化定义时：
			 [{
					name: '数据1',
					value: 10
			 }, {
					// 数据项名称
					name: '数据2',
					value : 56,
					//自定义特殊 tooltip，仅对该数据项有效
					tooltip:{},
					//自定义特殊itemStyle，仅对该item有效
					itemStyle:{}
			}]
				
 ***********************************************************************/
#include "Common/IEnum.h"
#include "Options/Common/IBaseArrayElement.h"
#include "Options/Common/ICompactTooltip.h"
#include "Options/GeneralOptions/Series/Map/IMapTypeLabelEx.h"
#include "Options/GeneralOptions/Series/Map/IMapTypeItemStyle.h"
#include "Options/GeneralOptions/Series/Map/IMapTypeEmphasisEx.h"
#include "Options/GeneralOptions/Series/Map/IMapTypeSelectEx.h"

namespace IIChart
{
	namespace Map
	{
		/*@class
		*************************************************************************
		* 类  名: IMapTypeData
		* 修  改: 2022年7月1日 15:02:44
		* 功  能: 系列中的数据内容
		-----------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		************************************************************************/
		class IMapTypeData : virtual public IBaseArrayElement
		{
		public:

			/*@function
			*******************************************************************
			功  能:  数据项名称
			参  数:  <wzValue>;
			返回值:  <无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetName(const wchar_t* wzValue) = 0;
			virtual wchar_t* GetName() const = 0;

			/*@function
			*******************************************************************
			功  能:  单个数据项的整数类型数值
			注  意： 一个 ILineTypeData 对象中只会一个值；并且值为最后的 SetValue
					 调用设置的值;
			参  数:  <nValue>;
			返回值:  <无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetValue(int nValue) = 0;
			virtual void GetValue(int* pnValue) = 0;

			/*@function
			*******************************************************************
			功  能:  单个数据项的小数类型数值
			注  意： 一个 ILineTypeData 对象中只会一个值；并且值为最后的 SetValue
					 调用设置的值;
			参  数:  <nValue>;
			返回值:  <无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetValue(float fValue) = 0;
			virtual void GetValue(float* pfValue) = 0;

			/*@function
			*******************************************************************
			功  能:  该数据项的组 ID。组 ID 会被用于分类数据，并在全局过渡动画中决定如何进行合并和分裂动画。
			参  数:  <wzValue>;
			返回值:  <无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetGroupId(const wchar_t* wzValue) = 0;
			virtual wchar_t* GetGroupId() const = 0;

			/*@function
			*******************************************************************
			功  能:  该数据项区域是否选中
			参  数:  <bValue>;
			返回值:  <无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetSelected(bool bValue) = 0;
			virtual bool GetSelected() const = 0;

			/*@function
			*******************************************************************
			* 功  能：该数据所在区域的多边形样式设置
			* 参  数：<无>;
			* 返回值：<IMapTypeItemStyle*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IMapTypeItemStyle* GetItemStyle() = 0;

			/*@function
			*******************************************************************
			* 功  能：该数据所在区域的文本标签
			* 参  数：<无>;
			* 返回值：<IMapTypeLabelEx*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IMapTypeLabelEx* GetLabel() = 0;

			/*@function
			*******************************************************************
			* 功  能：该数据所在区域的高亮状态下的多边形和标签样式。
			* 参  数：<无>;
			* 返回值：<IMapTypeEmphasisEx*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IMapTypeEmphasisEx* GetEmphasis() = 0;


			/*@function
			*******************************************************************
			* 功  能：该数据所在区域的选中状态下的多边形和标签样式。
			* 参  数：<无>;
			* 返回值：<IMapTypeSelectEx*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IMapTypeSelectEx* GetSelect() = 0;

			/*@function
			*******************************************************************
			* 功  能：本系列每个数据项中特定的 tooltip 设定。
			* 参  数：<无>;
			* 返回值：<IMapTypeTooltip*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual ICompactTooltip* GetTooltip() = 0;
		};
	}

}