#pragma once
/***********************************************************************
 * Module:   IMapTypeLabelLayout.h
 * Author:   杨鹏辉
 * Modified: 2022年7月1日 15:02:44
 * Purpose:  标签的统一布局配置。
 *           该配置项是在每个系列默认的标签布局基础上，
 *           统一调整标签的(x, y)位置，标签对齐等属性以实现想要的标签布局效果。
 ***********************************************************************/
#include "Common/IEnum.h"

namespace IIChart
{
	namespace Map
	{
		/*@class
		*************************************************************************
		* 类  名: IMapTypeLabelLayout
		* 修  改: 2022年7月1日 15:02:44
		* 功  能: 标签的统一布局配置。
		-----------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		************************************************************************/
		class IMapTypeLabelLayout
		{
		public:

			/*@function
			******************************************************************
			功  能：是否隐藏重叠的标签。
			参  数：<bValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetHideOverlap(bool bValue) = 0;
			virtual bool GetHideOverlap() const = 0;

			/*@function
			******************************************************************
			功  能：在标签重叠的时候是否挪动标签位置以防止重叠。
			参  数：<eValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetMoveOverlap(EMoveOverlap eValue) = 0;
			virtual EMoveOverlap GetMoveOverlap()const = 0;

			/*@function
			******************************************************************
			功  能：标签的 x 位置。
			参  数：<nValue>;
				   <bIsPercentage> 为 true 时，以百分比设置标签的 x 位置。;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetX(int nValue, bool bIsPercentage) = 0;
			virtual void GetX(int* pnValue, bool* pbIsPercentage) = 0;


			/*@function
			******************************************************************
			功  能：标签的 y 位置。
			参  数：<nValue>;
				   <bIsPercentage> 为 true 时，以百分比设置标签的 y 位置。;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetY(int nValue, bool bIsPercentage) = 0;
			virtual void GetY(int* pnValue, bool* pbIsPercentage) = 0;

			/*@function
			******************************************************************
			功  能：标签在 x 方向上的像素偏移。可以和 x 一起使用。
			参  数：<nValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetDx(int nValue) = 0;
			virtual int  GetDx() const = 0;

			/*@function
			******************************************************************
			功  能：标签在 Y 方向上的像素偏移。可以和 y 一起使用。
			参  数：<nValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetDy(int nValue) = 0;
			virtual int  GetDy() const = 0;

			/*@function
			******************************************************************
			功  能：标签旋转角度
			参  数：<nValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetRotate(int nValue) = 0;
			virtual int  GetRotate() const = 0;

			/*@function
			******************************************************************
			功  能：标签显示的宽度。可以配合overflow使用控制标签显示在固定宽度内
			参  数：<nValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetWidth(int nValue) = 0;
			virtual int  GetWidth() const = 0;

			/*@function
			******************************************************************
			功  能：标签显示的高度
			参  数：<nValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetHeight(int nValue) = 0;
			virtual int  GetHeight() const = 0;

			/*@function
			******************************************************************
			功  能：标签水平对齐方式，默认自动;
			参  数：<eValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetAlign(EAlign eValue) = 0;
			virtual EAlign GetAlign() const = 0;

			/*@function
			******************************************************************
			功  能：标签垂直对齐方式，默认自动;
			参  数：<eValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetVerticalAlign(EVerticalAlign eValue) = 0;
			virtual EVerticalAlign GetVerticalAlign() const = 0;

			/*@function
			******************************************************************
			功  能：文字的字体大小;
			参  数：<nValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetFontSize(int nValue) = 0;
			virtual int GetFontSize() const = 0;

			/*@function
			******************************************************************
			功  能：标签是否可以允许用户通过拖拽二次调整位置。
			参  数：<bValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetDraggable(bool bValue) = 0;
			virtual bool GetDraggable() const = 0;

			/*@function
			******************************************************************
			功  能：标签引导线三个点的位置。格式为：
				    [[x, y], [x, y], [x, y]]
				    在饼图中常用来微调已经计算好的引导线，其它情况一般不建议设置。
			参  数：<bValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetLabelLinePoints(int nX1, int nY1, int nX2, int nY2, int nX3, int nY3) = 0;
			virtual void GetLabelLinePoints(int* pnX1, int* pnY1, int* pnX2, int* pnY2, int* pnX3, int* pnY3) = 0;

		};
	}

}
