/***********************************************************************
 * Module:  IChartManager.h
 * Author:  杨鹏辉
 * Modified: 2022年6月30日 16:55:43
 * Purpose: Declaration of the class IChartManager
 ***********************************************************************/
#pragma once 

#include "IChart.h"
#include "IChartManagerDelegate.h"
#include "IManagerSetting.h"

namespace IIChart
{
	
	/*@class
	*************************************************************************
	* 类  名: IChartManager
	* 修  改: 2022年7月1日 15:02:44
	* 功  能: Chart 管理操作相关接口;
	-----------------------------------------------------------------------
	作  者:  YangPenghui 2022-10-26;
	************************************************************************/
	class IChartManager
	{
	public:
		/*@function
		******************************************************************
		功  能：取当前 ChartManager 的配置对象;
		注  意：必须在 Init 之前调用配置项才能生效;
		参  数: <无> ;
		返回值：<IManagerSetting*>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual IManagerSetting* GetSetting() = 0;

		/*@function
		******************************************************************
		功  能：设置 ChartManager 的代理类,可以在代理类中接收并处理 ChartManager 的事件;
		注  意：必须在 Init 之前调用;
		参  数: <pDelegate> ;
		返回值：<无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual void SetDelegate(IChartManagerDelegate* pDelegate) = 0;

		/*@function
		******************************************************************
		功  能：初始化 ChartManager;		
		参  数: <hWnd> 作为绘图容器的窗体或控件的句柄;
		               所有带有句柄的控件与窗体都可以作为绘制 Chart 的容器，例：
					   文本框、标签（static）控件、按钮控件...
		返回值：<IManagerSetting*>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual int Init(HWND hWnd) = 0;

		/*@function
		******************************************************************
		功  能：创建 IChart 实例,可以在代理类中接收并处理 ChartManager 的事件;
		注  意：必须在 Init 之后调用;
		参  数: <nErrorCode> 创建失败时的错误码;
		        <wzChartName> Chart 的名称;
		返回值：<IChart*>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual IChart* CreateChart(int& nErrorCode, const wchar_t* wzChartName = nullptr) = 0;

		/*@function
		******************************************************************
		功  能：根据名称取指定 IChart 实例;
		注  意：必须在 Init 之后调用;
		参  数: <wzChartName> Chart 的名称;
		返回值：<IChart*>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual IChart* GetChart(const wchar_t* wzChartName) = 0;
		
	public:
		/*@function
		******************************************************************
		功  能：打开内置的 打印设置 页面，将当前图表容器中的图表进行打印;
		注  意：必须在 Init 之后调用;
		参  数：<无> ;
		返回值：<错误码>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual int  Print() = 0;
		
		/*@function
		******************************************************************
		功  能：将当前视图内的图表打印成PDF;
		注  意：必须在 Init 之后调用;
		参  数：<wzPdfFilePath> 要保存的 PDF 的绝对路径;
		返回值：<错误码>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual int  PrintToPDF(const wchar_t* wzPdfFilePath) = 0;
		
		/*@function
		******************************************************************
		功  能：是否有打印任务正在执行;
		注  意：必须在 Init 之后调用;
		参  数：<无> ;
		返回值：<错误码>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual bool IsPrintToPdfInProgress() = 0;

		/*@function
		******************************************************************
		功  能：保存当前的视图截屏为图片;
		注  意：必须在 Init 之后调用;
		参  数：<eFormat> 要保存为的图片格式;
		        <wzFile> 要保存为的图片绝对路径;
		返回值：<错误码>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual int  SaveScreenshot(EPrintImageFormat eFormat, const wchar_t* wzFile) = 0;

		/*@function
		******************************************************************
		功  能：多个图表实例实现联动。
		注  意：> 必须在 Init 之后调用;
		        > 连接的多个图表可以共享组件事件并实现保存图片时的自动拼接。
		        > 多图表联动支持直角系下tooltip的联动
		参  数：<wzGroupName> group 的 id;
		返回值：<错误码>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual int Connect(const wchar_t* wzGroupName) = 0;

		/*@function
		******************************************************************
		功  能：解除图表实例的联动，如果只需要移除单个实例，可以将通过将该图表实例 group 设为空。
		注  意：必须在 Init 之后调用;
		参  数：<wzGroupName> group 的 id;
		返回值：<错误码>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual int Disconnect(const wchar_t* wzGroupName) = 0;

		/*@function
		******************************************************************
		功  能：注册主题，用于初始化图表实例的时候指定;
		注  意：必须在 Init 之后调用;
		参  数：<wzThemeName> 主题名称时，作为实例的 Init() 接口参数使用;
				<wzThemeData> 代表 Theme 的 Json 数据;
		返回值：<错误码>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual int RegisterTheme(const wchar_t* wzThemeName, const wchar_t* wzThemeData) = 0;

		/*@function
		******************************************************************
		功  能：注册主题，用于初始化图表实例的时候指定;
		注  意：必须在 Init 之后调用;
		参  数：<wzThemeName> 主题名称时，作为实例的 Init() 接口参数使用;
				<wzThemeFile> Json 格式的 Theme 数据的文件路径,只支持绝对路径;
		返回值：<错误码>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual int RegisterThemeFromFile(const wchar_t* wzThemeName, const wchar_t* wzThemeFile) = 0;

		/*@function
		******************************************************************
		功  能：注册可用的地图，只在 geo 组件或者 map 图表类型中使用;
		注  意：必须在 Init 之后调用;
		参  数：<wzMapName> 地图名称，在 geo 组件或者 map 图表类型中设置的 map 对应的就是该值;
		        <wzSvgData> SVG DOM 字符串;
		返回值：<错误码>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual int RegisterSvgMap(const wchar_t* wzMapName, const wchar_t* wzSvgData) = 0;

		/*@function
		******************************************************************
		功  能：注册可用的地图，只在 geo 组件或者 map 图表类型中使用;
		注  意：必须在 Init 之后调用;
		参  数：<wzMapName> 地图名称，在 geo 组件或者 map 图表类型中设置的 map 对应的就是该值;
				<wzSvgFile> SVG 数据的文件路径,只支持绝对路径;
		返回值：<错误码>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual int RegisterSvgMapFromFile(const wchar_t* wzMapName, const wchar_t* wzSvgFile) = 0;

		/*@function
		******************************************************************
		功  能：注册可用的地图，只在 geo 组件或者 map 图表类型中使用;
		注  意：必须在 Init 之后调用;
		参  数：<wzMapName> 地图名称，在 geo 组件或者 map 图表类型中设置的 map 对应的就是该值;
		        <wzGeoJSON> GeoJson 格式的数据，具体格式见 https://geojson.org/。可以是 JSON 字符串;
				<wzSpecialAreas> 将地图中的部分区域缩放到合适的位置，可以使得整个地图的显示更加好看。只在 geoJSON 中生效;
		返回值：<IFixedQueue*>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual int RegisterGeoMap(const wchar_t* wzMapName, const wchar_t* wzGeoJSON, const wchar_t* wzSpecialAreas = nullptr) = 0;

		/*@function
		******************************************************************
		功  能：注册可用的地图，只在 geo 组件或者 map 图表类型中使用;
		注  意：必须在 Init 之后调用;
		参  数：<wzMapName> 地图名称，在 geo 组件或者 map 图表类型中设置的 map 对应的就是该值;
				<wzGeoFile> GeoJson 格式数据的文件路径,只支持绝对路径;
				<wzSpecialAreas> 将地图中的部分区域缩放到合适的位置，可以使得整个地图的显示更加好看。只在 geoJSON 中生效。;
		返回值：<IFixedQueue*>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual int RegisterGeoMapFromFile(const wchar_t* wzMapName, const wchar_t* wzGeoFile, const wchar_t* wzSpecialAreas = nullptr) = 0;

		/*@function
		*******************************************************************
		功  能:  销毁实例，销毁后实例无法再被使用。
		参  数:  <无>;
		返回值:  <无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual void Release() = 0;
	};
}


