/***********************************************************************
 * Module:  IGlobalUtility.h
 * Author:  杨鹏辉
 * Modified: 2022年6月30日 16:55:43
 * Purpose: Declaration of the class IChartManager
 ***********************************************************************/
#pragma once 
#include "Common/IEnum.h"
#include "Common/IFixedQueue.h"
#include "Common/IQueue.h"
#include "Options/Common/IColor.h"

namespace IIChart
{
	
	/*@class
	*************************************************************************
	* 类  名: IGlobalUtility
	* 修  改: 2022年7月1日 15:02:44
	* 功  能: 负责创建全局公共对象的接口;
	-----------------------------------------------------------------------
	作  者:  YangPenghui 2022-10-26;
	************************************************************************/
	class IGlobalUtility
	{
	public:
		/*@function
		******************************************************************
		功  能：创建一个固定长度的队列数组;
		注  意：此方法常用于动态显示数据的图表中;
		参  数：<nSize> 队列的长度，可以在使用过程中动态修改;
		返回值：<IFixedQueue*>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual IFixedQueue* CreateFixedQueue(int nSize) = 0;

		/*@function
		******************************************************************
		功  能：创建一个队列数组;
		注  意：此方法常用于动态显示数据的图表中;
		参  数：<nSize> 队列的长度，可以在使用过程中动态修改;
		返回值：<IFixedQueue*>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual IQueue* CreateQueue() = 0;
	
		/*@function
		*******************************************************************
		功  能:  创建一个IColor*;可以用此对象设置纹理;
		注  意:  此功能除了可以设置纯色外，还可以设置渐变色和纹理填充;
		参  数:  <无> ;
		返回值:  <IColor*> ;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual IColor* CreateColor() = 0;

		/*@function
		*******************************************************************
		功  能:  销毁实例，销毁后实例无法再被使用。
		参  数:  <无>;
		返回值:  <无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual void Release() = 0;
	};
}


