#pragma once
/***********************************************************************
 * Module:   IDataZoomAreaStyle.h
 * Author:   杨鹏辉
 * Modified: 2022年7月1日 15:02:44
 * Purpose:  阴影的填充样式
 ***********************************************************************/
#include "Common/IEnum.h"
#include "Options/Common/IColor.h"

namespace IIChart
{
	namespace DataZoom
	{

		/*@class
		*************************************************************************
		* 类  名: IDataZoomAreaStyle
		* 修  改: 2022年7月1日 15:02:44
		* 功  能: 阴影的填充样式
		-----------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		************************************************************************/
		class IDataZoomAreaStyle
		{
		public:

			/*@function
			******************************************************************
			功  能：填充区域的颜色。
			注  意：为颜色值时，可以使用以下形式，
					1. 可以使用 RGB 表示，比如 'rgb(128, 128, 128)'\
					2. 如果想要加上 alpha 通道，可以使用 RGBA，比如 'rgba(128, 128, 128, 0.5)'
					3. 可以使用十六进制格式，比如 '#ccc'
					4. 可以使用 CSS3 预定义的颜色名称，如'red'，'SlateGray';
			参  数：<wzValue> 为 nullptr 或 L"" 时为不指定;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetColor(const wchar_t* wzValue) = 0;
			virtual wchar_t* GetColor() const = 0;

			/*@function
			******************************************************************
			功  能：以 RGBA 方式设置填充区域的颜色
			参  数：<略>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetColor(int nR, int nG, int nB, float nTransparent = 1) = 0;
			virtual void GetColor(int* pnR, int* pnG, int* pnB, float* pnTransparent) = 0;

			/*@function
			******************************************************************
			功  能：设置填充区的颜色，此方式除可设置纯色外还可以设置为渐变色和纹理填充;
			参  数：<无> 字符串模板;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetColor(IColor* pValue) = 0;

			/*@function
			******************************************************************
			功  能：填充区阴影颜色。
			参  数：<wzValue> 为 nullptr 或 L"" 时将不显示任何颜色，支持以下方式的颜色值：
							1. 可以使用 RGB 表示，比如 'rgb(128, 128, 128)'\
							2. 如果想要加上 alpha 通道，可以使用 RGBA，比如 'rgba(128, 128, 128, 0.5)'
							3. 可以使用十六进制格式，比如 '#ccc'
							4. 可以使用 CSS3 预定义的颜色名称，如'red'，'SlateGray';
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetShadowColor(const wchar_t* wzValue) = 0;
			virtual wchar_t* GetShadowColor() const = 0;

			/*@function
			 ******************************************************************
			 功  能：以 RGBA 方式设置填充区阴影颜色
			 参  数：<略>;
			 返回值：<无>;
			 ------------------------------------------------------------------
			 作  者:  YangPenghui 2022-10-26;
			 ******************************************************************/
			virtual void SetShadowColor(int nR, int nG, int nB, float nTransparent = 1) = 0;
			virtual void GetShadowColor(int* pnR, int* pnG, int* pnB, float* pnTransparent) = 0;

			/*@function
			******************************************************************
			功  能：设置填充区的阴影颜色，此方式除可设置纯色外还可以设置为渐变色和纹理填充;
			参  数：<无> 字符串模板;
			返回值：<无>;
			------------------------------------------------------------------
			 作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetShadowColor(IColor* pValue) = 0;

			/*@function
			******************************************************************
			功  能：填充区阴影的模糊大小;
					该属性配合 shadowColor,shadowOffsetX, shadowOffsetY 一起设置填充区的阴影效果。
			参  数：<nValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetShadowBlur(int nValue) = 0;
			virtual int GetShadowBlur() const = 0;


			/*@function
			******************************************************************
			功  能：填充区背景阴影 X 偏移;
			参  数：<nValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetShadowOffsetX(int nValue) = 0;
			virtual int GetShadowOffsetX() const = 0;

			/*@function
			******************************************************************
			功  能：填充区背景阴影 Y 偏移;
			参  数：<nValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetShadowOffsetY(int nValue) = 0;
			virtual int GetShadowOffsetY() const = 0;

			/*@function
			******************************************************************
			功  能：填充区透明度。支持从 0 到 1 的数字，为 0 时不绘制该填充区。
			参  数：<略>;
			返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetOpacity(float nValue) = 0;
			virtual float GetOpacity() const = 0;

		};
	}

}


