#pragma once
/***********************************************************************
 * Module:  IPolar.h
 * Author:  杨鹏辉
 * Modified: 2022年7月1日 15:02:44
 * Purpose: 极坐标系，可以用于散点图和折线图。每个极坐标系拥有一个角度轴和一个半径轴。
 *          
 ***********************************************************************/
#include "Common/ICallback.h"
#include "Options\Common\IBaseArrayElement.h"
#include "Options/GeneralOptions/Polar/IPolarTooltip.h"

namespace IIChart
{
	namespace Polar
	{
		
		 /*@class
		 *************************************************************************
		 * 类  名: IPolar
		 * 修  改: 2022年7月1日 15:02:44
		 * 功  能: 极坐标系;
		 -----------------------------------------------------------------------
		 作  者:  YangPenghui 2022-10-26;
		 ************************************************************************/
		class IPolar : virtual public IBaseArrayElement
		{
		public:
			/*@function
			******************************************************************
			功  能：组件 ID。默认不指定。指定则可用于在 option 或者 API 中引用组件。
			参  数: <wzValue> 为 nullptr 或 L"" 时为不指定;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetId(const wchar_t* wzValue) = 0;
			virtual wchar_t* GetId() const = 0;

			/*@function
			******************************************************************
			功  能：所有图形的 zlevel 值。
			注  意: zlevel用于 Canvas 分层，不同zlevel值的图形会放置在不同的 Canvas 中，
					Canvas 分层是一种常见的优化手段。我们可以把一些图形变化频繁（例如有动画）的
					组件设置成一个单独的zlevel。需要注意的是过多的 Canvas 会引起内存开销的增大，
					在手机端上需要谨慎使用以防崩溃。
					zlevel 大的 Canvas 会放在 zlevel 小的 Canvas 的上面。
			参  数: <nLevel> ;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetZLevel(int nLevel) = 0;
			virtual int  GetZLevel() const = 0;

			/*@function
			******************************************************************
			功  能：组件的所有图形的z值。控制图形的前后顺序。z值小的图形会被z值大的图形覆盖。
			注  意: z相比zlevel优先级更低，而且不会创建新的 Canvas。
			参  数: <nLevel> ;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetZ(int nLevel) = 0;
			virtual int  GetZ() const = 0;

			/*@function
			******************************************************************
			功  能：极坐标系的中心（圆心）坐标。
			参  数: <nX> 横坐标;
			        <nY> 纵坐标;
					<bIsPercent> true 时，nX 为相对于容器宽度的百分比， nY 为相对于容器高度的百分比;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetCenter(int nX, int nY, bool bIsPercent = false) = 0;
			virtual void GetCenter(int* pnX, int* pnY, bool* pbIsPercent) = 0;

			/*@function
			******************************************************************
			功  能：极坐标系的外半径值。
			参  数: <nValue> 外半径值;
					<bIsPercent> true 时，nValue 为外半径为可视区尺寸的百分比;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int  SetRadius(int nValue, bool bIsPercent) = 0;
			virtual void GetRadius(int* pnValue, bool* pbIsPercent) = 0;

			/*@function
			******************************************************************
			功  能：极坐标系的外半径值。
			参  数: <nInner> 内半径;
					<nOutter> 外半径;
					<bIsPercent> true 时，nInner 与 nOutter 为百分比表示;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int  SetRadius(int nInner, int nOutter, bool bIsPercent) = 0;
			virtual void GetRadius(int* pnInner, int* pnOutter, bool* pbIsPercent) = 0;

			/*@function
			******************************************************************
			功  能：本坐标系特定的 tooltip 设定。
			参  数: <无> ;
			返回值：<IPolarTooltip*>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IPolarTooltip* GetTooltip() = 0;

		};
	}
	
}