#pragma once
/***********************************************************************
 * Module:  ICommonActionArgs.h
 * Author:  杨鹏辉
 * Modified: 2022年6月30日 13:22:47
 * Purpose: Declaration of the class IGeoActionArgs
 ***********************************************************************/

#include <vector>
#include <string>
#include "Common/IQueue.h"
#include <ActionArgs/IAction.h>

using namespace std;

namespace IIChart
{
	/*@class
	*******************************************************************
	类名:  ICommonAction;
	功能:  通用 Action。
	备注:  
	作者:  YangPenghui 2022-3-26;
	*******************************************************************/
	class ICommonAction : virtual public IAction
	{
	public:
		/*@function
		*******************************************************************
		功  能：用 index 指定多个系列。
		        每个值之间使用“,”分隔;如：“1,3,8,9”
		参  数：<wzValue> 使用“,”分隔的系列的序号;
		返回值:  <无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual int SetSeriesIndex(const wchar_t* wzValue) = 0;

		/*@function
		************************************************
		功  能：用 index 指定多个系列;
		参  数：<vctValue> 系列的序号;
		返回值：<无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		************************************************/
		virtual void SetSeriesIndex(const std::vector<int>& vctValue) = 0;

		/*@function
		**********************************************
		功  能：用 index 指定多个系列;
		参  数：<pQueue> 系列的序号，只支持int类型值;
		返回值：<无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		**********************************************/
		virtual int SetSeriesIndex(IQueue* pQueue) = 0;

		/*@function
		**********************************************
		功  能：用 index 指定单个系列;
		参  数：<nIndex> 系列序号;
		返回值：<无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		**********************************************/
		virtual void SetSingleSeriesIndex(int nIndex) = 0;

		/*@function
		**********************************************
		功  能：清除设置的index;
		参  数：<无>;
		返回值：<无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		**********************************************/
		virtual void ClearSeriesIndex() = 0;


		/*@function
		*******************************************************************
		功  能：用 Id 指定多个系列。
				每个值之间使用“,”分隔;如：“test1,test3,test8,test9”
		参  数：<wzValue> 使用“,”分隔的系列的Id;
		返回值:  <无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual int SetSeriesId(const wchar_t* wzValue) = 0;

		/*@function
		************************************************
		功  能：用 Id 指定多个系列;
		参  数：<vctValue> 系列的序号;
		返回值：<无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		************************************************/
		virtual void SetSeriesId(const std::vector<wstring>& vctValue) = 0;

		/*@function
		**********************************************
		功  能：用 index 指定多个系列;
		参  数：<pQueue> 系列的序号，只支持wstring类型值;
		返回值：<无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		**********************************************/
		virtual int SetSeriesId(IQueue* pQueue) = 0;

		/*@function
		**********************************************
		功  能：用 Id 指定单个系列;
		参  数：<wzId> 系列Id;
		返回值：<无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		**********************************************/
		virtual int SetSingleSeriesId(const wchar_t* wzId) = 0;

		/*@function
		**********************************************
		功  能：清除设置的Id;
		参  数：<无>;
		返回值：<无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		**********************************************/
		virtual void ClearSeriesId() = 0;

		/*@function
		*******************************************************************
		功  能：用 Name 指定多个系列。
				每个值之间使用“,”分隔;如：“test1,test3,test8,test9”
		参  数：<wzValue> 使用“,”分隔的系列的Id;
		返回值:  <无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual int SetSeriesName(const wchar_t* wzValue) = 0;

		/*@function
		************************************************
		功  能：用 Id 指定多个系列;
		参  数：<vctValue> 系列的序号;
		返回值：<无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		************************************************/
		virtual void SetSeriesName(const std::vector<wstring>& vctValue) = 0;

		/*@function
		**********************************************
		功  能：用 Name 指定多个系列;
		参  数：<pQueue> 系列的序号，只支持wstring类型值;
		返回值：<无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		**********************************************/
		virtual int SetSeriesName(IQueue* pQueue) = 0;

		/*@function
		**********************************************
		功  能：用 Name 指定单个系列;
		参  数：<wzId> 系列Name;
		返回值：<无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		**********************************************/
		virtual int SetSingleSeriesName(const wchar_t* wzName) = 0;

		/*@function
		**********************************************
		功  能：清除设置的Name;
		参  数：<无>;
		返回值：<无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		**********************************************/
		virtual void ClearSeriesName() = 0;

		/*@function
		*******************************************************************
		功  能：用 index 指定多个数据项，如果不指定也可以通过 name 属性根据名称指定数据项
				每个值之间使用“,”分隔;如：“1,3,8,9”
		参  数：<wzValue> 使用“,”分隔的系列的序号;
		返回值:  <无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual int SetDataIndex(const wchar_t* wzValue) = 0;

		/*@function
		************************************************
		功  能：用 index 指定多个数据项;
		参  数：<vctValue> 系列的序号;
		返回值：<无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		************************************************/
		virtual void SetDataIndex(const std::vector<int>& vctValue) = 0;

		/*@function
		**********************************************
		功  能：用 index 指定多个数据项;
		参  数：<pQueue> 系列的序号，只支持int类型值;
		返回值：<无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		**********************************************/
		virtual int SetDataIndex(IQueue* pQueue) = 0;

		/*@function
		**********************************************
		功  能：用 index 指定单个数据项的;
		参  数：<nIndex> 系列序号;
		返回值：<无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		**********************************************/
		virtual void SetSingleDataIndex(int nIndex) = 0;

		/*@function
		**********************************************
		功  能：清除设置的数据项的index;
		参  数：<无>;
		返回值：<无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		**********************************************/
		virtual void ClearDataIndex() = 0;


		/*@function
		*******************************************************************
		功  能：用 数据项名称 指定多个数据项，在有 dataIndex 的时候忽略;
				每个值之间使用“,”分隔;如：“test1,test3,test8,test9”
		参  数：<wzValue> 使用“,”分隔的系列的数据项名称;
		返回值:  <无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual int SetName(const wchar_t* wzValue) = 0;

		/*@function
		************************************************
		功  能：用 数据项名称 指定多个数据项，在有 dataIndex 的时候忽略;
		参  数：<vctValue> 数据项名称;
		返回值：<无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		************************************************/
		virtual void SetName(const std::vector<wstring>& vctValue) = 0;

		/*@function
		**********************************************
		功  能：用 数据项名称 指定多个数据项，在有 dataIndex 的时候忽略;
		参  数：<pQueue> 系列的序号，只支持wstring类型值;
		返回值：<无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		**********************************************/
		virtual int SetName(IQueue* pQueue) = 0;

		/*@function
		**********************************************
		功  能：用 数据项名称 指定单个数据项，在有 dataIndex 的时候忽略;
		参  数：<wzValue> 数据项名称;
		返回值：<无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		**********************************************/
		virtual int SetSingleName(const wchar_t* wzValue) = 0;

		/*@function
		**********************************************
		功  能：清除设置的数据项名称;
		参  数：<无>;
		返回值：<无>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		**********************************************/
		virtual void ClearName() = 0;

	};
}


