#pragma once
/***********************************************************************
 * Module:  IGridTooltipAxisPointerLabel.h
 * Author:  杨鹏辉
 * Modified: 2022年7月1日 15:02:44
 * Purpose: 坐标轴刻度标签的相关设置。
 ***********************************************************************/
#include "Common\IEnum.h"

namespace IIChart
{
	namespace Grid
	{
		/*@class
		*************************************************************************
		* 类  名: IGridTooltipAxisPointer
		* 修  改: 2022年7月1日 15:02:44
		* 功  能: 本坐标系特定的 tooltip 的坐标轴指示器配置项：
		-----------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		************************************************************************/
		class IGridTooltipAxisPointerLabel
		{
		public:

			/*@function
			******************************************************************
			功  能：是否显示文本标签。
			注  意：如果 tooltip.axisPointer.type 设置为 'cross' 则默认显示标签，否则默认不显示。
			参  数：<bShow>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetShow(bool bShow) = 0;
			virtual bool GetShow() const = 0;

			/*@function
			******************************************************************
			功  能：文本标签中数值的小数点精度。
			注  意：默认根据当前轴的值自动判断。也可以指定如 2 表示保留两位小数。
			参  数：<nValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetPrecision(int nValue) = 0;
			virtual int  GetPrecision() const = 0;

			/*@function
			******************************************************************
			 功  能：刻度标签的内容格式器的字符串模板。字符串模板与回调函数返回的字符串均支持用 \n 换行。
			 注  意：字符串模板的模板变量有：
					{a}：系列名。
					{b}：数据名。
					{c}：数据值。
					{@xxx}：数据中名为 'xxx' 的维度的值，如 {@product} 表示名为 'product' 的维度的值。
					{@[n]}：数据中维度 n 的值，如 {@[3]} 表示维度 3 的值，从 0 开始计数。示例：
					formatter: '{b}: {@score}'
			 参  数：<wzValue> 为 nullptr 或 L"" 时原有的值将会被清空;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetFormatter(const wchar_t* wzValue) = 0;
			virtual wchar_t* GetFormatter() const = 0;

			/*@function
			******************************************************************
			 功  能：刻度标签的内容格式器的JavaScript回调函数;字符串模板与回调函数返回的字符串均支持用 \n 换行。
			 注  意：回调函数格式：
					(params: Object|Array) => string
					参数 params 是 formatter 需要的单个数据集。格式如下：
					{
						componentType: 'series',
						// 系列类型
						seriesType: string,
						// 系列在传入的 option.series 中的 index
						seriesIndex: number,
						// 系列名称
						seriesName: string,
						// 数据名，类目名
						name: string,
						// 数据在传入的 data 数组中的 index
						dataIndex: number,
						// 传入的原始数据项
						data: Object,
						// 传入的数据值。在多数系列下它和 data 相同。在一些系列下是 data 中的分量（如 map、radar 中）
						value: number|Array|Object,
						// 坐标轴 encode 映射信息，
						// key 为坐标轴（如 'x' 'y' 'radius' 'angle' 等）
						// value 必然为数组，不会为 null/undefied，表示 dimension index 。
						// 其内容如：
						// {
						//     x: [2] // dimension index 为 2 的数据映射到 x 轴
						//     y: [0] // dimension index 为 0 的数据映射到 y 轴
						// }
						encode: Object,
						// 维度名列表
						dimensionNames: Array<String>,
						// 数据的维度 index，如 0 或 1 或 2 ...
						// 仅在雷达图中使用。
						dimensionIndex: number,
						// 数据图形的颜色
						color: string
					}
					更详细说明，可能参考：https://echarts.apache.org/zh/option.html#series-line.type
			 参  数：<wzValue> 字符串模板;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetFormatterJSFun(const wchar_t* wzValue) = 0;

			/*@function
			******************************************************************
			功  能：label 距离轴的距离。
			参  数：<nValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetMargin(int nValue) = 0;
			virtual int  GetMargin() const = 0;

			/*@function
			******************************************************************
			功  能：文字的颜色。
			注  意：为颜色值时，可以使用以下形式，
					1. 可以使用 RGB 表示，比如 'rgb(128, 128, 128)'\
					2. 如果想要加上 alpha 通道，可以使用 RGBA，比如 'rgba(128, 128, 128, 0.5)'
					3. 可以使用十六进制格式，比如 '#ccc'
					4. 可以使用 CSS3 预定义的颜色名称，如'red'，'SlateGray';
			参  数：<wzValue> 为 nullptr 或 L"" 时原有的值将会被清空;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetColor(const wchar_t* wzValue) = 0;
			virtual wchar_t* GetColor() const = 0;

			/*@function
			******************************************************************
			功  能：文字的颜色，默认取 axisLine.lineStyle.color。
			参  数：<略>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetColor(int nR, int nG, int nB, float nTransparent = 1) = 0;
			virtual void GetColor(int* pnR, int* pnG, int* pnB, float* pnTransparent) = 0;
					
			/*@function
			******************************************************************
			功  能：文字字体的风格
			参  数：<eValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetFontStyle(EFontStyle eValue) = 0;
			virtual EFontStyle GetFontStyle() const = 0;

			/*@function
			******************************************************************
			功  能：文字字体的粗细;
			参  数：<eValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetFontWeight(EFontWeight eValue) = 0;
			virtual EFontWeight GetFontWeight() const = 0;

			/*@function
			******************************************************************
			功  能：文字字体的粗细;
			参  数：<nValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetFontWeight(int nValue) = 0;
			virtual void GetFontWeight(int* pnValue) = 0;

			/*@function
			******************************************************************
			功  能：文字的字体系列;
			参  数：<wzValue> 可以是 'sans-serif','serif', 'monospace', 'Arial', 'Courier New', 'Microsoft YaHei', ...;
			                 为 nullptr 或 L"" 时原有的值将会被清空;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetFontFamily(const wchar_t* wzValue) = 0;
			virtual wchar_t* GetFontFamily() const = 0;

			/*@function
			******************************************************************
			功  能：文字的字体大小;
			参  数：<nValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetFontSize(int nValue) = 0;
			virtual int GetFontSize() const = 0;

			/*@function
			******************************************************************
			功  能：行高;
			注  意：rich 中如果没有设置 lineHeight，则会取父层级的 lineHeight;
			参  数：<nValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetLineHeight(int nValue) = 0;
			virtual int GetLineHeight() const = 0;

			/*@function
			******************************************************************
			功  能：文本显示宽度;
			参  数：<nValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetWidth(int nValue) = 0;
			virtual int GetWidth() const = 0;

			/*@function
			******************************************************************
			功  能：文本显示高度;
			参  数：<nValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetHeight(int nValue) = 0;
			virtual int GetHeight() const = 0;

			/*@function
			******************************************************************
			功  能：设置文字本身的描边颜色。
			注  意：为颜色值时，可以使用以下形式，
					1. 可以使用 RGB 表示，比如 'rgb(128, 128, 128)'\
					2. 如果想要加上 alpha 通道，可以使用 RGBA，比如 'rgba(128, 128, 128, 0.5)'
					3. 可以使用十六进制格式，比如 '#ccc'
					4. 可以使用 CSS3 预定义的颜色名称，如'red'，'SlateGray';
			参  数：<wzValue> 为 nullptr 或 L"" 时原有的值将会被清空;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetTextBorderColor(const wchar_t* wzValue) = 0;
			virtual wchar_t* GetTextBorderColor() const = 0;

			/*@function
			******************************************************************
			功  能：文字本身的描边颜色。
			参  数：<略>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetTextBorderColor(int nR, int nG, int nB, float nTransparent = 1) = 0;
			virtual void GetTextBorderColor(int* pnR, int* pnG, int* pnB, float* pnTransparent) = 0;

			/*@function
			******************************************************************
			功  能：文字本身的描边宽度;
			参  数：<nValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetTextBorderWidth(int nValue) = 0;
			virtual int GetTextBorderWidth() const = 0;

			/*@function
			******************************************************************
			功  能：文字本身的描边类型;
			参  数：<eValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetTextBorderType(EBorderType eValue) = 0;
			virtual EBorderType GetTextBorderType() const = 0;

			/*@function
			*****************************************************************
			 功  能：文字本身描边类型, 用数组以指定线条的 dash array
					 配合 borderDashOffset 可实现更灵活的虚线效果;
			 参  数：<nValue> 线条虚线的 dash array 首地址;
					 <nCount> array 数组大小;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int  SetTextBorderType(int* pnValue, int nCount) = 0;
			virtual void GetTextBorderType(int* pnValue, int* pnCount) = 0;

			/*@function
			*****************************************************************
			 功  能：文字本身描边类型, 用数组以指定线条的 dash array
					 配合 borderDashOffset 可实现更灵活的虚线效果
			 参  数：<wzValue> 以英文“,”隔开的数字序列;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int  SetTextBorderType(const wchar_t* wzValue) = 0;
			virtual void GetTextBorderType(wchar_t** pwzValue) = 0;

			/*@function
			*****************************************************************
			 功  能：文字本身描边类型, 用数组以指定线条的 dash array
					 配合 borderDashOffset 可实现更灵活的虚线效果
			 参  数：<vctValue> 数字序列;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int  SetTextBorderType(const std::vector<int>& vctValue) = 0;

			/*@function
			*****************************************************************
			 功  能：用于设置文字本身每两条虚线段之间的偏移量，可搭配 borderType 指
					 定 dash array 与 borderDashOffset实现灵活的虚线效果;
			 参  数：<nValue>;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetTextBorderDashOffset(int nValue) = 0;
			virtual int GetTextBorderDashOffset() const = 0;

			/*@function
			******************************************************************
			功  能：文字本身的背景阴影颜色。
			注  意：为颜色值时，可以使用以下形式，
					1. 可以使用 RGB 表示，比如 'rgb(128, 128, 128)'\
					2. 如果想要加上 alpha 通道，可以使用 RGBA，比如 'rgba(128, 128, 128, 0.5)'
					3. 可以使用十六进制格式，比如 '#ccc'
					4. 可以使用 CSS3 预定义的颜色名称，如'red'，'SlateGray';
			参  数：<wzValue> 为 nullptr 或 L"" 时原有的值将会被清空;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetTextShadowColor(const wchar_t* wzValue) = 0;
			virtual wchar_t* GetTextShadowColor() const = 0;

			/*@function
			******************************************************************
			功  能：文字本身的背景阴影颜色。
			参  数：<略>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetTextShadowColor(int nR, int nG, int nB, float nTransparent) = 0;
			virtual void GetTextShadowColor(int* pnR, int* pnG, int* pnB, float* pnTransparent) = 0;

			/*@function
			******************************************************************
			功  能：文字本身的背景阴影长度;
			参  数：<nValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetTextShadowBlur(int nValue) = 0;
			virtual int GetTextShadowBlur() const = 0;

			/*@function
			******************************************************************
			功  能：文字本身的背景阴影 X 偏移;
			参  数：<nValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetTextShadowOffsetX(int nValue) = 0;
			virtual int GetTextShadowOffsetX() const = 0;

			/*@function
			******************************************************************
			功  能：文字本身的背景阴影 Y 偏移;
			参  数：<nValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetTextShadowOffsetY(int nValue) = 0;
			virtual int GetTextShadowOffsetY() const = 0;

			/*@function
			******************************************************************
			功  能：文字超出宽度是否截断或者换行。配置width时有效;
			参  数：<nValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetOverflow(EOverflow eValue) = 0;
			virtual EOverflow GetOverflow() const = 0;

			/*@function
			******************************************************************
			功  能：在overflow配置为'truncate'的时候，可以通过该属性配置末尾显示的文本。如"...";
			参  数：<wzValue>为 nullptr 或 L"" 时原有的值将会被清空;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetEllipsis(const wchar_t* wzValue) = 0;
			virtual wchar_t* GetEllipsis() const = 0;

			/*@function
			******************************************************************
			功  能：标题内边距，单位px;
			注  意: 文字块的 width 和 height 指定的是内容高宽，不包含 padding。
			参  数：<nValue> 边距值，例如 4：表示 padding: [4, 4, 4, 4];;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void  SetPadding(int nValue) = 0;
			virtual void  GetPadding(int* pnValue) = 0;

			/*@function
			******************************************************************
			功  能：文本标签内边距，单位px;
			注  意: 文字块的 width 和 height 指定的是内容高宽，不包含 padding。
			参  数：<nValue1> 边距值1
				   <nValue2> 边距值2
				   例如 [3, 4]：表示 padding: [3, 4, 3, 4];
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void  SetPadding(int nValue1, int nValue2) = 0;
			virtual void  GetPadding(int* pnValue1, int* pnValue2) = 0;

			/*@function
			******************************************************************
			功  能：文本标签内边距，单位px;
			注  意: 文字块的 width 和 height 指定的是内容高宽，不包含 padding。
			参  数：<nTop, nRight, nBottom, nLeft> 分别表示 [上, 右, 下, 左] 的边距
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetPadding(int nTop, int nRight, int nBottom, int nLeft) = 0;
			virtual void GetPadding(int* pnTop, int* pnRight, int* pnBottom, int* pnLeft) = 0;

			/*@function
			******************************************************************
			功  能：文本标签背景色，默认透明。
			注  意：为颜色值时，可以使用以下形式，
					1. 可以使用 RGB 表示，比如 'rgb(128, 128, 128)'\
					2. 如果想要加上 alpha 通道，可以使用 RGBA，比如 'rgba(128, 128, 128, 0.5)'
					3. 可以使用十六进制格式，比如 '#ccc'
					4. 可以使用 CSS3 预定义的颜色名称，如'red'，'SlateGray';
			参  数：<wzValue> 为 nullptr 或 L"" 时原有的值将会被清空;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetBackgroundColor(const wchar_t* wzValue) = 0;
			virtual wchar_t* GetBackgroundColor() const = 0;

			/*@function
			******************************************************************
			功  能：文本标签背景色，默认透明。
			参  数：<略>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetBackgroundColor(int nR, int nG, int nB, float fTransparent = 1) = 0;
			virtual void GetBackgroundColor(int* pnR, int* pnG, int* pnB, float* pfTransparent) = 0;

			/*@function
			******************************************************************
			功  能：文本标签的边框颜色。
			注  意：为颜色值时，可以使用以下形式，
					1. 可以使用 RGB 表示，比如 'rgb(128, 128, 128)'\
					2. 如果想要加上 alpha 通道，可以使用 RGBA，比如 'rgba(128, 128, 128, 0.5)'
					3. 可以使用十六进制格式，比如 '#ccc'
					4. 可以使用 CSS3 预定义的颜色名称，如'red'，'SlateGray';
			参  数：<wzValue> 为 nullptr 或 L"" 时原有的值将会被清空;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetBorderColor(const wchar_t* wzValue) = 0;
			virtual wchar_t* GetBorderColor() const = 0;

			/*@function
			******************************************************************
			功  能：文本标签的边框颜色。
			参  数：<略>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetBorderColor(int nR, int nG, int nB, float fTransparent = 1) = 0;
			virtual void GetBorderColor(int* pnR, int* pnG, int* pnB, float* pfTransparent) = 0;

			/*@function
			******************************************************************
			功  能：文本标签的边框线宽。
			参  数：<nValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetBorderWidth(int nValue) = 0;
			virtual int  GetBorderWidth() const = 0;
			
			/*@function
			******************************************************************
			功  能：文本标签的背景阴影颜色。
			注  意：为颜色值时，可以使用以下形式，
					1. 可以使用 RGB 表示，比如 'rgb(128, 128, 128)'\
					2. 如果想要加上 alpha 通道，可以使用 RGBA，比如 'rgba(128, 128, 128, 0.5)'
					3. 可以使用十六进制格式，比如 '#ccc'
					4. 可以使用 CSS3 预定义的颜色名称，如'red'，'SlateGray';
			参  数：<wzValue> 为 nullptr 或 L"" 时原有的值将会被清空;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetShadowColor(const wchar_t* wzValue) = 0;
			virtual wchar_t* GetShadowColor() const = 0;

			/*@function
			******************************************************************
			功  能：文本标签的背景阴影颜色。
			参  数：<略>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetShadowColor(int nR, int nG, int nB, float nTransparent = 1) = 0;
			virtual void GetShadowColor(int* pnR, int* pnG, int* pnB, float* pnTransparent) = 0;

			/*@function
			******************************************************************
			功  能：文本标签阴影的模糊大小。
			参  数：<nValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetShadowBlur(int nValue) = 0;
			virtual int GetShadowBlur() const = 0;

			/*@function
			******************************************************************
			功  能：文本标签的背景阴影 X 偏移;
			参  数：<nValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetShadowOffsetX(int nValue) = 0;
			virtual int GetShadowOffsetX() const = 0;

			/*@function
			******************************************************************
			功  能：文本标签的背景阴影 Y 偏移;
			参  数：<nValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetShadowOffsetY(int nValue) = 0;
			virtual int GetShadowOffsetY() const = 0;
		
			/*@function
			******************************************************************
			功  能：在 rich 里面，可以自定义富文本样式。利用富文本样式，可以在标签中做出非常丰富的效果;
			参  数：<无>;
			返回值：<IRich*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IRich* GetRich() = 0;
		};
	}

}
