#pragma once
/***********************************************************************
 * Module:  IMapTypeMarkAreaData.h
 * Author:  杨鹏辉
 * Modified: 2022年7月1日 15:02:44
 * Purpose: 标域的数据数组。
 * 
 *     标域的数据数组。每个数组项是一个两个项的数组，分别表示标域左上角和右下角的
 *     位置，每个项支持通过下面几种方式指定自己的位置
 *     1. 通过 x, y 属性指定相对容器的屏幕坐标，单位像素，支持百分比。
 *	   2. 用 coord 属性指定数据在相应坐标系上的坐标位置，单个维度支持设置 'min', 'max', 'average'。
		当多个属性同时存在时，优先级按上述的顺序。

		data: [
			[
				{
					name: '两个坐标之间的标域',
					coord: [10, 20]
				},
				{
					coord: [20, 30]
				}
			], [
				{
					name: '60分到80分',
					yAxis: 60
				},
				{
					yAxis: 80
				}
			], [
				{
					name: '所有数据范围区间',
					coord: ['min', 'min']
				},
				{
					coord: ['max', 'max']
				}
			],
		[
				{
					name: '两个屏幕坐标之间的标域',
					x: 100,
					y: 100
				}, {
					x: '90%',
					y: '10%'
				}
			]
		]

 ***********************************************************************/
#include "Common/IEnum.h"
#include "Options/Common/IBaseArrayElement.h"
#include "Options/GeneralOptions/Series/Map/IMapTypeLabel.h"
#include "Options/GeneralOptions/Series/Map/IMapTypeItemStyle.h"
#include "Options/GeneralOptions/Series/Map/IMapTypeBlur.h"
#include "Options/GeneralOptions/Series/Map/IMapTypeEmphasis.h"
#include "Options/GeneralOptions/Series/Map/IMapTypeMarkAreaData.h"



namespace IIChart
{
	namespace Map
	{
		/*@class
		*************************************************************************
		* 类  名: IMapTypeMarkAreaData
		* 修  改: 2022年7月1日 15:02:44
		* 功  能: 图表标域，常用于标记图表中某个范围的数据，例如标出某段时间投放了广告。
		-----------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		************************************************************************/
		class IMapTypeMarkAreaData : virtual public IBaseArrayElement
		{
		public:
			
			/*@function
			******************************************************************
			功  能：在使用 type 时有效，用于指定在哪个维度上指定最大值最小值
				   可以是 0（xAxis, radiusAxis），1（yAxis, angleAxis），默认使用第一个数值轴所在的维度。
			参  数：<nIndex>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetValueIndex(int nIndex) = 0;
			virtual int  GetValueIndex() const = 0;

			/*@function
			******************************************************************
			功  能：在使用 type 时有效，用于指定在哪个维度上指定最大值最小值
			参  数：<eValue>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetValueDim(EValueDim eValue) = 0;
			virtual void GetValueDim(EValueDim* peValue) = 0;

			/*@function
			******************************************************************
			功  能：在使用 type 时有效，用于指定在哪个维度上指定最大值最小值
				   例如折线图时可以是x、angle等、candlestick 图时可以是open、close等维度名称。
			参  数：<nIndex>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetValueDim(const wchar_t* wzValue) = 0;
			virtual void GetValueDim(wchar_t** pwzValue) = 0;

			/*@function
			******************************************************************
			功  能：标注名称，将会作为文字显示。
			参  数：<wzValue>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetName(const wchar_t* wzValue) = 0;
			virtual wchar_t* GetName() const = 0;

			/*@function
			******************************************************************
			功  能：清除掉起点或终点的坐标
			参  数：<无>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void ClearCoord() = 0;

			/*@function
			******************************************************************
			功  能：起点或终点的坐标。坐标格式视系列的坐标系而定:
				   > 可以是直角坐标系上的 x, y，
				   > 可以是极坐标系上的 radius, angle。
			参  数：<fX>;
				   <fY>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetCoord(float fX, float fY) = 0;

			/*@function
			******************************************************************
			功  能：对于 axis.type 为 'category' 类型的轴:
				   1. 如果 coord 值为 number，则表示 axis.data 的 index。
				   2. 如果 coord 值为 string，则表示 axis.data 中具体的值。
					  注意使用这种方式时，xAxis.data 不能写成 [number, number, ...]，
					  而只能写成 [string, string, ...]，否则不能被 markPoint / markLine 用『具体值』索引到。
			参  数：<略>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetCoord(const wchar_t* wzX, float fY) = 0;
			virtual void SetCoord(float fX, const wchar_t* wzY) = 0;
			virtual void SetCoord(const wchar_t* wzX, const wchar_t* wzY) = 0;

			/*@function
			******************************************************************
			功  能：相对容器的屏幕 x 坐标，单位像素。
			参  数：<nValue>;
				   <bIsPercentage> 为 true 时，以百分比设置标签的 x 位置。;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetX(int nValue, bool bIsPercentage) = 0;
			virtual void GetX(int* pnValue, bool* pbIsPercentage) = 0;

			/*@function
			******************************************************************
			功  能：相对容器的屏幕 y 坐标，单位像素。
			参  数：<nValue>;
				   <bIsPercentage> 为 true 时，以百分比设置标签的 y 位置。;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetY(int nValue, bool bIsPercentage) = 0;
			virtual void GetY(int* pnValue, bool* pbIsPercentage) = 0;

			/*@function
			******************************************************************
			功  能：标注值，可以不设。
			参  数：<nValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetValue(int nValue) = 0;
			virtual void GetValue(int* pnValue) const = 0;

			/*@function
			******************************************************************
			功  能：标注值，可以不设。
			参  数：<fValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetValue(float fValue) = 0;
			virtual void GetValue(float* pfValue) const = 0;
			
			/*@function
			******************************************************************
			功  能：该数据项标签的样式，起点和终点项的label会合并到一起。
			参  数：<无>;
			返回值：<IMapTypeLabel*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IMapTypeLabel* GetLabel() = 0;

			/*@function
			******************************************************************
			功  能：该数据项区域的样式，起点和终点项的itemStyle会合并到一起。
			参  数：<无>;
			返回值：<IMapTypeItemStyle*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IMapTypeItemStyle* GetItemStyle() = 0;

			/*@function
			******************************************************************
			功  能：该数据项区域高亮时的样式
			参  数：<无>;
			返回值：<IMapTypeEmphasis*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IMapTypeEmphasis* GetEmphasis() = 0;

			/*@function
			******************************************************************
			功  能：该数据项区域淡出时的样式。
			参  数：<无>;
			返回值：<IMapTypeBlur*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IMapTypeBlur* GetBlur() = 0;
		};
	}
}