#pragma once
/***********************************************************************
 * Module:   IMapTypeLabelLineEx.h
 * Author:   杨鹏辉
 * Modified: 2022年7月1日 15:02:44
 * Purpose:  标签的视觉引导线配置。
 ***********************************************************************/
#include "Common/IEnum.h"
#include "Options/Common/ILineStyle.h"
#include "Options/GeneralOptions/Series/Map/IMapTypeLabelLine.h"

namespace IIChart
{
	namespace Map
	{
		/*@class
		*************************************************************************
		* 类  名: IMapTypeLabelLineEx
		* 修  改: 2022年7月1日 15:02:44
		* 功  能: 标签的视觉引导线配置。
		-----------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		************************************************************************/
		class IMapTypeLabelLineEx 
			: virtual public IMapTypeLabelLine
		{
		public:

			/*@function
			******************************************************************
			功  能：是否显示在图形上方。
			参  数：<bValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetShowAbove(bool bValue) = 0;
			virtual bool GetShowAbove() const = 0;

			/*@function
			******************************************************************
			功  能：视觉引导项第二段的长度。
			参  数：<nValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetLength2(int nValue) = 0;
			virtual int  GetLength2() const = 0;

			/*@function
			******************************************************************
			功  能：是否平滑视觉引导线，默认不平滑。
			参  数：<bValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetSmooth(bool bValue) = 0;
			virtual bool GetSmooth() const = 0;

			/*@function
			******************************************************************
			功  能：平滑视觉引导线,设置为 0 到 1 的值，表示平滑程度
			参  数：<nValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetSmooth(float nValue) = 0;
			virtual void GetSmooth(float* pnValue) const = 0;

			/*@function
			******************************************************************
			功  能：通过调整第二段线的长度，限制引导线两端之间最小的夹角，以防止过小的夹角导致显示不美观。
			参  数：<nValue> 可以设置为 0 - 180 度。;
			返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetMinTurnAngle(int nValue) = 0;
			virtual int GetMinTurnAngle() const = 0;

		};
	}
	
}
