#pragma once
/***********************************************************************
 * Module:   ILegendEmphasis.h
 * Author:   杨鹏辉
 * Modified: 2022年7月1日 15:02:44
 * Purpose:  图例的高亮样式设置。
 ***********************************************************************/
#include "Options/GeneralOptions/Legend/ILegendSelectorLabel.h"


namespace IIChart
{
	namespace Legend
	{
		/*@class
		*************************************************************************
		* 类  名: ILegendEmphasis
		* 修  改: 2022年7月1日 15:02:44
		* 功  能: 图例的高亮样式设置。
		-----------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		************************************************************************/
		class ILegendEmphasis 
		{
		public:
		
			/*@function
			******************************************************************
			功  能：图例组件中的选择器按钮，目前包括全选和反选两种功能。
			       默认不显示，用户可手动开启，也可以手动配置每个按钮的标题。
			参  数: <无>;
			返回值：<ILegendLineStyle* >;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual ILegendSelectorLabel* GetSelectorLabel() = 0;
		};
	}
}
