#pragma once
/***********************************************************************
 * Module:  ILegendAllSelectActionArgs.h
 * Author:  杨鹏辉
 * Modified: 2022年6月30日 11:42:37
 * Purpose: “刷选” 动作完毕时，会自动触发此 action。 
             其参数和 brush action 完全相同。
 ***********************************************************************/
#include <ActionArgs/IBrushAction.h>

namespace IIChart
{

	class IBrushEndAction : virtual public IAction
	{
	public:
		/*@function
		*******************************************************************
		功  能:  创建刷选范围;
		参  数:  <无>;
		返回值:  <IArea*>;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual IArea* CreateArea() = 0;

		/*@function
		*******************************************************************
		功  能:  增加刷选范围;
		参  数:  <无>;
		返回值:  <int> 错误码;
		------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		******************************************************************/
		virtual int AddArea(IArea* pDataArray) = 0;
	};
}


