#pragma once
/***********************************************************************
 * Module:   IScatterTypeMarkPointItemStyle.h
 * Author:   杨鹏辉
 * Modified: 2022年7月1日 15:02:44
 * Purpose:  标注的图形样式。
 ***********************************************************************/
#include "Common/IEnum.h"
#include "Common/ICallback.h"


namespace IIChart
{
	namespace Scatter
	{
		/*@class
		*************************************************************************
		* 类  名: IScatterTypeMarkPointItemStyle
		* 修  改: 2022年7月1日 15:02:44
		* 功  能: 标注的图形样式。
		-----------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		************************************************************************/
		class IScatterTypeMarkPointItemStyle
		{
		public:
			
			/*@function
			******************************************************************
			功  能：图形的颜色。
			注  意：为颜色值时，可以使用以下形式，
					1. 可以使用 RGB 表示，比如 'rgb(128, 128, 128)'\
					2. 如果想要加上 alpha 通道，可以使用 RGBA，比如 'rgba(128, 128, 128, 0.5)'
					3. 可以使用十六进制格式，比如 '#ccc'
					4. 可以使用 CSS3 预定义的颜色名称，如'red'，'SlateGray';
			参  数：<wzValue> 为 nullptr 或 L"" 时为不指定;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetColor(const wchar_t* wzValue) = 0;
			virtual wchar_t* GetColor() const = 0;

			/*@function
			******************************************************************
			功  能：以 RGBA 方式设置图形的颜色，默认取 axisLine.lineStyle.color。
			参  数：<略>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetColor(int nR, int nG, int nB, float nTransparent = 1) = 0;
			virtual void GetColor(int* pnR, int* pnG, int* pnB, float* pnTransparent) = 0;

			/*@function
			******************************************************************
			功  能：设置图形的颜色，此方式除可设置纯色外还可以设置为渐变色和纹理填充;
			参  数：<无> 字符串模板;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetColor(IColor* pValue) = 0;

			/*@function
			******************************************************************
			功  能：图形的边框颜色。
			注  意：为颜色值时，可以使用以下形式，
					 1. 可以使用 RGB 表示，比如 'rgb(128, 128, 128)'\
					 2. 如果想要加上 alpha 通道，可以使用 RGBA，比如 'rgba(128, 128, 128, 0.5)'
					 3. 可以使用十六进制格式，比如 '#ccc'
					 4. 可以使用 CSS3 预定义的颜色名称，如'red'，'SlateGray';
			参  数：<wzValue> 为 nullptr 或 L"" 时为不指定;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetBorderColor(const wchar_t* wzValue) = 0;
			virtual wchar_t* GetBorderColor() const = 0;

			/*@function
			******************************************************************
			功  能：图形的边框颜色。
			参  数：<略>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetBorderColor(int nR, int nG, int nB, float fTransparent = 1) = 0;
			virtual void GetBorderColor(int* pnR, int* pnG, int* pnB, float* pfTransparent) = 0;

			/*@function
			******************************************************************
			功  能：图形的边框线宽。
			参  数：<nValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetBorderWidth(int nValue) = 0;
			virtual int GetBorderWidth() const = 0;

			/*@function
			******************************************************************
			功  能：图形边框的描边类型;
			参  数：<eValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetBorderType(EBorderType eValue) = 0;
			virtual EBorderType GetBorderType() const = 0;

			/*@function
			*****************************************************************
			 功  能：图形边框描边类型, 用数组以指定线条的 dash array
					 配合 borderDashOffset 可实现更灵活的虚线效果;
			 参  数：<nValue> 线条虚线的 dash array 首地址;
					 <nCount> array 数组大小;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int  SetBorderType(int* pnValue, int nCount) = 0;
			virtual void GetBorderType(int* pnValue, int* pnCount) = 0;

			/*@function
			*****************************************************************
			 功  能：图形边框描边类型, 用数组以指定线条的 dash array
					 配合 borderDashOffset 可实现更灵活的虚线效果
			 参  数：<wzValue> 以英文“,”隔开的数字序列;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int  SetBorderType(const wchar_t* wzValue) = 0;
			virtual void GetBorderType(wchar_t** pwzValue) = 0;

			/*@function
			*****************************************************************
			 功  能：图形边框描边类型, 用数组以指定线条的 dash array
					 配合 borderDashOffset 可实现更灵活的虚线效果
			 参  数：<vctValue> 数字序列;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int  SetBorderType(const std::vector<int>& vctValue) = 0;

			/*@function
			 ******************************************************************
			 功  能：用于设置虚线的偏移量，可搭配 borderType 指定 dash array 实现灵活的虚线效果;
			 参  数：<nValue>;
			 返回值：<无>;
			 ------------------------------------------------------------------
			 作  者:  YangPenghui 2022-10-26;
			 ******************************************************************/
			virtual void SetBorderDashOffset(int nValue) = 0;
			virtual int GetBorderDashOffset() const = 0;

			/*@function
			 ******************************************************************
			 功  能：用于指定线段末端的绘制方式,默认值为 'butt'
			 参  数：<eValue>;
			 返回值：<无>;
			 ------------------------------------------------------------------
			 作  者:  YangPenghui 2022-10-26;
			 ******************************************************************/
			virtual void SetBorderCap(EBorderCap eValue) = 0;
			virtual EBorderCap GetBorderCap() const = 0;

			/*@function
			 ******************************************************************
			 功  能：用于设置2个长度不为0的相连部分（线段，圆弧，曲线）如何连接在一起的属性
					（长度为0的变形部分，其指定的末端和控制点在同一位置，会被忽略）。
			 参  数：<eValue>;
			 返回值：<无>;
			 ------------------------------------------------------------------
			 作  者:  YangPenghui 2022-10-26;
			 ******************************************************************/
			virtual void SetBorderJoin(EBorderJoin eValue) = 0;
			virtual EBorderJoin GetBorderJoin() const = 0;

			/*@function
			 ******************************************************************
			 功  能：用于设置斜接面限制比例。只有当 borderJoin 为 miter 时， borderMiterLimit 才有效。
					默认值为 10。负数、0、Infinity 和 NaN 均会被忽略。
			 参  数：<eValue>;
			 返回值：<无>;
			 ------------------------------------------------------------------
			 作  者:  YangPenghui 2022-10-26;
			 ******************************************************************/
			virtual void SetBorderMiterLimit(int nValue) = 0;
			virtual int  GetBorderMiterLimit() const = 0;

			/*@function
			******************************************************************
			功  能：图形的颜色。
			参  数：<wzValue> 为 nullptr 或 L"" 时将不显示任何颜色，支持以下方式的颜色值：
							1. 可以使用 RGB 表示，比如 'rgb(128, 128, 128)'\
							2. 如果想要加上 alpha 通道，可以使用 RGBA，比如 'rgba(128, 128, 128, 0.5)'
							3. 可以使用十六进制格式，比如 '#ccc'
							4. 可以使用 CSS3 预定义的颜色名称，如'red'，'SlateGray';
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetShadowColor(const wchar_t* wzValue) = 0;
			virtual wchar_t* GetShadowColor() const = 0;

			/*@function
			 ******************************************************************
			 功  能：以 RGBA 方式设置图形的阴影颜色
			 参  数：<略>;
			 返回值：<无>;
			 ------------------------------------------------------------------
			 作  者:  YangPenghui 2022-10-26;
			 ******************************************************************/
			virtual void SetShadowColor(int nR, int nG, int nB, float nTransparent = 1) = 0;
			virtual void GetShadowColor(int* pnR, int* pnG, int* pnB, float* pnTransparent) = 0;

			/*@function
			******************************************************************
			功  能：设置图形的阴影颜色，此方式除可设置纯色外还可以设置为渐变色和纹理填充;
			参  数：<无> 字符串模板;
			返回值：<无>;
			------------------------------------------------------------------
			 作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetShadowColor(IColor* pValue) = 0;

			/*@function
			******************************************************************
			功  能：图形的阴影的模糊大小;
				   该属性配合 shadowColor,shadowOffsetX, shadowOffsetY 一起设置图形的阴影效果。
			参  数：<nValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetShadowBlur(int nValue) = 0;
			virtual int GetShadowBlur() const = 0;

			/*@function
			******************************************************************
			功  能：图形的背景阴影 X 偏移;
			参  数：<nValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetShadowOffsetX(int nValue) = 0;
			virtual int GetShadowOffsetX() const = 0;

			/*@function
			******************************************************************
			功  能：图形的背景阴影 Y 偏移;
			参  数：<nValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetShadowOffsetY(int nValue) = 0;
			virtual int GetShadowOffsetY() const = 0;

			/*@function
			******************************************************************
			功  能：图形透明度。支持从 0 到 1 的数字，为 0 时不绘制该图形。
			参  数：<略>;
			返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetOpacity(float nValue) = 0;
			virtual float GetOpacity() const = 0;
		};
	}
}
