#pragma once
/***********************************************************************
 * Module:  IRadiusAxis.h
 * Author:  杨鹏辉
 * Modified: 2022年7月1日 15:02:44
 * Purpose: 极坐标系的径向轴。
 *          
 ***********************************************************************/
#include <vector>
#include "Common/IEnum.h"
#include "Common/ICallback.h"
#include "Options/Common/IBaseArrayElement.h"
#include "Options/GeneralOptions/RadiusAxis/IRadiusAxisNameTextStyle.h"
#include "Options/GeneralOptions/RadiusAxis/IRadiusAxisAxisLine.h"
#include "Options/GeneralOptions/RadiusAxis/IRadiusAxisAxisTick.h"
#include "Options/GeneralOptions/RadiusAxis/IRadiusAxisMinorTick.h"

#include "Options/GeneralOptions/RadiusAxis/IRadiusAxisAxisLabel.h"
#include "Options/GeneralOptions/RadiusAxis/IRadiusAxisSplitLine.h"
#include "Options/GeneralOptions/RadiusAxis/IRadiusAxisMinorSplitLine.h"

#include "Options/GeneralOptions/RadiusAxis/IRadiusAxisSplitArea.h"
#include "Options/GeneralOptions/RadiusAxis/IRadiusAxisAxisPointer.h"

namespace IIChart
{
	namespace RadiusAxis
	{
		/*@class
		*************************************************************************
		* 类  名: IRadiusAxis
		* 修  改: 2022年7月1日 15:02:44
		* 功  能: 极坐标系的角度轴;
		-----------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		************************************************************************/
		class IRadiusAxis : virtual public IBaseArrayElement
		{
		public:
			/*@function
			******************************************************************
			功  能：组件 ID。默认不指定。指定则可用于在 option 或者 API 中引用组件。
			参  数: <wzValue> 为 nullptr 或 L"" 时为不指定;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetId(const wchar_t* wzValue) = 0;
			virtual wchar_t* GetId() const = 0;

			/*@function
			******************************************************************
			功  能：角度轴所在的极坐标系的索引，默认使用第一个极坐标系。
			参  数: <nValue>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetPolarIndex(int nValue) = 0;
			virtual int  GetPolarIndex() const = 0;

			/*@function
			******************************************************************
			功  能：坐标轴类型
			参  数: <nValue>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetType(ERCTAxisType eValue) = 0;
			virtual ERCTAxisType GetType() const = 0;

			/*@function
			******************************************************************
			功  能：坐标轴名称
			参  数: <wzValue>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetName(const wchar_t* wzValue) = 0;
			virtual wchar_t* GetName() const = 0;

			/*@function
			******************************************************************
			功  能：坐标轴名称显示位置
			参  数: <eValue>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetNameLocation(ENameLocation eValue) = 0;
			virtual ENameLocation GetNameLocation() const = 0;

			/*@function
			******************************************************************
			功  能：坐标轴名称的文字样式
			参  数: <无>;
			返回值：<IRadiusAxisNameTextStyle*>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IRadiusAxisNameTextStyle* GetNameTextStyle() = 0;
						
			/*@function
			******************************************************************
			功  能：坐标轴名称与轴线之间的距离
			参  数: <nValue>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetNameGap(int nValue) = 0;
			virtual int GetNameGap() const = 0;

			/*@function
			******************************************************************
			功  能：坐标轴名字旋转，角度值。
			参  数: <nValue>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetNameRotate(int nValue) = 0;
			virtual int  GetNameRotate() const = 0;

			/*@function
			******************************************************************
			功  能：是否是反向坐标轴。
			参  数: <bValue>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetInverse(bool bValue) = 0;
			virtual bool GetInverse() const = 0;

			/*@function
			******************************************************************
			功  能：坐标轴两边留白策略，类目轴和非类目轴的设置和表现不一样。
			参  数: <bValue> 默认为 true;
							 为 true 时这时候刻度只是作为分隔线，标签和数据点都会在两个刻度之间的带(band)中间。
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetBoundaryGap(bool bValue) = 0;
			virtual bool GetBoundaryGap() const = 0;

			/*@function
			******************************************************************
			功  能：设置【非类目轴】坐标轴两边留白策略。
			注  意：【非类目轴】如时间，数值，对数轴；
			参  数: <nMin> 表示数据最小值的延伸范围;
					<nMax> 表示数据最大值延伸范围;
					<bIsPercentage> 为 true 时表示 nMin 与 nMax 都是百分比值;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetBoundaryGap(int nMin, int nMax, bool bIsPercentage) = 0;
			virtual void GetBoundaryGap(int* pnMin, int* pnMax, bool* pbIsPercentage) = 0;

			/*@function
			******************************************************************
			功  能：坐标轴刻度最小值。
			注  意：不设置时会自动计算最小值保证坐标轴刻度的均匀分布。
				   在类目轴中，也可以设置为类目的序数（如类目轴 data: ['类A', '类B', '类C'] 中，序数 2 表示 '类C'。
				   也可以设置为负数，如 -3
			参  数: <nValue>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetMin(int nValue) = 0;
			virtual void SetMin(float fValue) = 0;
			virtual void GetMin(int* pnValue) = 0;
			virtual void GetMin(float* pfValue) = 0;

			/*@function
			******************************************************************
			功  能：坐标轴刻度最小值。
			注  意：可以设置成特殊值 'dataMin'，此时取数据在该轴上的最小值作为最小刻度。
				   在类目轴中，也可以设置为类目的序数（如类目轴 data: ['类A', '类B', '类C'] 中，序数 2 表示 '类C'。
			参  数: <wzValue>;
					<*pwzValue> 此值的内存不需要释放，由内部自动管理;
			返回值：<错误码>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetMin(const wchar_t* wzValue) = 0;
			virtual void GetMin(wchar_t** pwzValue) = 0;

			/*@function
			******************************************************************
			 功  能：坐标轴刻度最小值，此时可以根据计算得出的数据最大最小值设定坐标轴的最小值。
			 注  意：回调函数仅有一个参数：
					value 是一个包含 min 和 max 的对象，分别表示数据的最大最小值，
					这个函数可返回坐标轴的最小值，也可返回 null/undefined 来表示“自动计算最小值”。
					(value: Object) => int
					例如：
					function (value) {
							return value.min - 20;
					}
			 参  数：<wzValue> JS回调;
			 返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetMinJSFun(const wchar_t* wzValue) = 0;

			/*@function
			******************************************************************
			功  能：坐标轴刻度最大值。
			注  意：不设置时会自动计算最大值保证坐标轴刻度的均匀分布。
					在类目轴中，也可以设置为类目的序数（如类目轴 data: ['类A', '类B', '类C'] 中，序数 2 表示 '类C'。
					也可以设置为负数，如 -3
			参  数: <nValue>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetMax(int nValue) = 0;
			virtual void SetMax(float fValue) = 0;
			virtual void GetMax(int* pnValue) = 0;
			virtual void GetMax(float* pfValue) = 0;

			/*@function
			******************************************************************
			功  能：坐标轴刻度最大值。
			注  意：可以设置成特殊值 'dataMax'，此时取数据在该轴上的最大值作为最小刻度。
				   在类目轴中，也可以设置为类目的序数（如类目轴 data: ['类A', '类B', '类C'] 中，序数 2 表示 '类C'。
			参  数: <wzValue>;
					<*pwzValue> 此值的内存不需要释放，由内部自动管理;
			返回值：<错误码>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetMax(const wchar_t* wzValue) = 0;
			virtual void GetMax(wchar_t** pwzValue) = 0;

			/*@function
			******************************************************************
			 功  能：坐标轴刻度最大值，此时可以根据计算得出的数据最大最小值设定坐标轴的最小值。
			 注  意：回调函数仅有一个参数：
					value 是一个包含 min 和 max 的对象，分别表示数据的最大最小值，
					这个函数可返回坐标轴的最小值，也可返回 null/undefined 来表示“自动计算最小值”。
					(value: Object) => int
					例如：
					function (value) {
							return value.max - 20;
					}
			 参  数：<wzValue> JS回调;
			 返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetMaxJSFun(const wchar_t* wzValue) = 0;

			/*@function
			******************************************************************
			功  能：是否是脱离 0 值比例。
			注  意：只在数值轴中（type: 'value'）有效。在双数值轴的散点图中比较有用。
					在设置 min 和 max 之后该配置项无效。
			参  数: <bValue> 设置成 true 后坐标刻度不会强制包含零刻度;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetScale(bool bValue) = 0;
			virtual bool GetScale() const = 0;

			/*@function
			******************************************************************
			功  能：坐标轴的分割段数。
			注  意：需要注意的是这个分割段数只是个预估值，最后实际显示的段数会在这个
				   基础上根据分割后坐标轴刻度显示的易读程度作调整，并且在类目轴中无效。
			参  数: <nValue>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetSplitNumber(int nValue) = 0;
			virtual int  GetSplitNumber() const = 0;

			/*@function
			******************************************************************
			功  能：自动计算的坐标轴最小间隔大小。
			注  意：例如,可以设置成1保证坐标轴分割刻度显示成整数。
				   只在数值轴或时间轴中（type: 'value' 或 'time'）有效。
			参  数: <nValue>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetMinInterval(int nValue) = 0;
			virtual void SetMinInterval(float fValue) = 0;
			virtual void GetMinInterval(int* pnValue) = 0;
			virtual void GetMinInterval(float* pfValue) = 0;

			/*@function
			******************************************************************
			功  能：自动计算的坐标轴最大间隔大小。
			注  意：例如,在时间轴（（type: 'time'））可以设置成 3600 * 24 * 1000 保证坐标轴分割刻度最大为一天
				   只在数值轴或时间轴中（type: 'value' 或 'time'）有效。
			参  数: <nValue>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetMaxInterval(int nValue) = 0;
			virtual void SetMaxInterval(float fValue) = 0;
			virtual void GetMaxInterval(int* pnValue) = 0;
			virtual void GetMaxInterval(float* pfValue) = 0;

			/*@function
			******************************************************************
			功  能：强制设置坐标轴分割间隔。
			说  明：因为 splitNumber 是预估的值，实际根据策略计算出来的刻度可能无法达到想要的效果，
				   这时候可以使用 interval 配合 min、max 强制设定刻度划分，一般不建议使用。
			注  意：无法在类目轴中使用。
				   在时间轴（type : 'time'）中需要传时间戳，
				   在对数轴（type : 'log'）中需要传指数值。
			参  数: <nValue>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetInterval(int nValue) = 0;
			virtual void SetInterval(float fValue) = 0;
			virtual void GetInterval(int* pnValue) = 0;
			virtual void GetInterval(float* pfValue) = 0;

			/*@function
			******************************************************************
			功  能：对数轴的底数。
			注  意：只在对数轴中（type: 'log'）有效
			参  数: <nValue>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetLogBase(int nValue) = 0;
			virtual int  GetLogBase() const = 0;

			/*@function
			******************************************************************
			功  能：坐标轴是否是静态无法交互。
			参  数: <bValue>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetSilent(bool bValue) = 0;
			virtual bool GetSilent() const = 0;

			/*@function
			******************************************************************
			功  能：坐标轴的标签是否响应和触发鼠标事件。
			参  数: <bValue> 默认为 false 不响应;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetTriggerEvent(bool bValue) = 0;
			virtual bool GetTriggerEvent() const = 0;

			/*@function
			******************************************************************
			功  能：坐标轴轴线相关设置。
			参  数: <无>;
			返回值：<IRadiusAxisAxisLine*>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IRadiusAxisAxisLine* GetAxisLine() = 0;

			/*@function
			******************************************************************
			功  能：坐标轴刻度相关设置。
			参  数: <无>;
			返回值：<IRadiusAxisAxisTick*>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IRadiusAxisAxisTick* GetAxisTick() = 0;

			/*@function
			******************************************************************
			功  能：坐标轴次刻度线相关设置。
			注  意：次刻度线无法在类目轴（type: 'category'）中使用。
			参  数: <无>;
			返回值：<IRadiusAxisMinorTick*>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IRadiusAxisMinorTick* GetMinorTick() = 0;
		
			/*@function
			******************************************************************
			功  能：坐标轴刻度标签的相关设置。
			参  数: <无>;
			返回值：<IRadiusAxisAxisLabel*>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IRadiusAxisAxisLabel* GetAxisLabel() = 0;

			/*@function
			******************************************************************
			功  能：坐标轴在 grid 区域中的分隔线。
			参  数: <无>;
			返回值：<IRadiusAxisSplitLine*>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IRadiusAxisSplitLine* GetSplitLine() = 0;

			/*@function
			******************************************************************
			功  能：坐标轴在 grid 区域中的次分隔线。次分割线会对齐次刻度线 minorTick。
			参  数: <无>;
			返回值：<IRadiusAxisMinorSplitLine*>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IRadiusAxisMinorSplitLine* GetMinorSplitLine() = 0;
				    
			/*@function
			******************************************************************
			功  能：坐标轴在 grid 区域中的分隔区域，默认不显示。
			参  数: <无>;
			返回值：<IRadiusAxisSplitArea*>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IRadiusAxisSplitArea* GetSplitArea() = 0;

			/*@function
			******************************************************************
			功  能：类目数据，在类目轴（type: 'E_Category'）中有效;
			参  数: <无>;
			返回值：<ICategoryData*>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual ICategoryData* CreateData() = 0;

			/*@function
			******************************************************************
			功  能：清除所有类目数据
			参  数: <无>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void ClearData() = 0;

			/*@function
			******************************************************************
			功  能：在原有的类目数据后增加新的数据，此方法可以定义要增加的数据的样式;
			参  数: <pData> 单个类目数据;
			返回值：<错误码>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int AddData(ICategoryData* pData) = 0;

			/*@function
			******************************************************************
			功  能：在原有的类目数据后增加新的数据。
			参  数：<wzValue> 可以是单个数据，也可以是用“,”分隔的多个类目数据;
			返回值：<错误码>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int AddData(const wchar_t* wzValue) = 0;

			/*@function
			******************************************************************
			功  能：在原有的类目数据后增加新的数据;
			参  数: <vctValue> 所有维度的值，单个元素为单个类目数据;
			返回值：<错误码>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int AddData(const std::vector<std::wstring>& vctData) = 0;

			/*@function
			******************************************************************
			功  能：在原有的类目数据后增加新的数据;
			参  数: <pQueue> 新的数据,其元素可以是 ICategoryData* 类型的数据，也可以是 wchar_t* 类型数据;
			返回值：<错误码>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int AddData(IFixedQueue* pQueue) = 0;

			/*@function
			******************************************************************
			功  能：设置类目数据;原有的类目数据将被覆盖。
					每个数据的值之间使用“,”分隔;如：“周一,周二,周三,周四,周五”
			 参  数：<wzValue> 用“,”分隔的所有类目数据;
			返回值：<错误码>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetData(const wchar_t* wzValue) = 0;

			/*@function
			******************************************************************
			功  能：设置类目数据;原有的类目数据将被覆盖。
			参  数：<vctValue> 所有维度的值，单个元素为单个类目数据;
			返回值：<错误码>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetData(const std::vector<std::wstring>& vctValue) = 0;

			/*@function
			******************************************************************
			功  能：设置类目数据，此值为一个一维数组;
			注  意：系列原来的数据将被覆盖掉;
				   此接口可以方便的实现动态图表显示;
			参  数：<pQueue> 其元素可以是 ICategoryData* 类型的数据，也可以是 wchar_t* 类型数据;
			返回值：<错误码>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetData(IFixedQueue* pQueue) = 0;

			/*@function
			******************************************************************
			功  能：坐标轴指示器配置项;
			参  数: <无>;
			返回值：<ICategoryData*>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IRadiusAxisAxisPointer* GetAxisPointer() = 0;

			/*@function
			******************************************************************
			功  能：是否开启动画;
			参  数: <bValue>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetAnimation(bool bValue) = 0;
			virtual bool GetAnimation() const = 0;

			/*@function
			******************************************************************
			功  能：是否开启动画的阈值，当单个系列显示的图形数量大于这个阈值时会关闭动画;
			参  数: <nValue>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetAnimationThreshold(int nValue) = 0;
			virtual int  GetAnimationThreshold() const = 0;

			/*@function
			******************************************************************
			功  能：初始动画的时长;
			参  数: <nValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetAnimationDuration(int nValue) = 0;
			virtual int  GetAnimationDuration() const = 0;

			/*@function
			******************************************************************
			功  能：设置 初始动画的时长 的 JavaScript 回调函数
			注  意：可以通过每个数据返回不同的时长实现更戏剧的初始动画效果，例如：
					animationDuration: function (idx) {
						// 越往后的数据时长越大
						return idx * 100;
					}
			参  数：<wzValue> JavaScript 函数字符串，不能为空;
			返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetAnimationDurationJSFun(const wchar_t* wzValue) = 0;

			/*@function
			******************************************************************
			功  能：设置 初始动画的时长 的回调函数
			注  意：可以通过每个数据返回不同的时长实现更戏剧的初始动画效果，例如：
			参  数：<pCallback> ;
			返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetAnimationDurationCallback(AnimationDurationCallback* pCallback) = 0;

			/*@function
			******************************************************************
			功  能：初始动画的缓动效果;
			参  数: <eValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetAnimationEasing(EAnimationEasing eValue) = 0;
			virtual EAnimationEasing GetAnimationEasing() const = 0;

			/*@function
			******************************************************************
			功  能：初始动画的延迟;
			参  数: <nValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetAnimationDelay(int nValue) = 0;
			virtual int  GetAnimationDelay() const = 0;

			/*@function
			******************************************************************
			功  能：设置 初始动画的延迟 的 JavaScript 回调函数
			注  意：可以通过每个数据返回不同的 delay 时间实现更戏剧的初始动画效果。例如：
					animationDelay: function (idx) {
						// 越往后的数据延迟越大
						return idx * 100;
					}
			参  数：<wzValue> JavaScript 函数字符串，不能为空;
			返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetAnimationDelayJSFun(const wchar_t* wzValue) = 0;

			/*@function
			******************************************************************
			功  能：设置 初始动画的延迟 的回调函数
			注  意：可以通过每个数据返回不同的时长实现更戏剧的初始动画效果
			参  数：<pCallback> ;
			返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetAnimationDelayCallback(AnimationDelayCallback* pCallback) = 0;

			/*@function
			******************************************************************
			功  能：数据更新动画的时长
			注  意：可以通过每个数据返回不同的时长实现更戏剧的初始动画效果
			参  数：<nValue> ;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetAnimationDurationUpdate(int nValue) = 0;
			virtual int  GetAnimationDurationUpdate() const = 0;

			/*@function
			******************************************************************
			功  能：设置 数据更新动画的时长 的 JavaScript 回调函数
			注  意：可以通过每个数据返回不同的时长实现更戏剧的更新动画效果。例如：
					animationDurationUpdate: function (idx) {
						// 越往后的数据延迟越大
						return idx * 100;
					}
			参  数：<wzValue> JavaScript 函数字符串, 不能为空;
			返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetAnimationDurationUpdateJSFun(const wchar_t* wzValue) = 0;

			/*@function
			******************************************************************
			功  能：数据更新动画的时长
			注  意：以通过每个数据返回不同的 delay 时间实现更戏剧的初始动画效果。
			参  数：<nValue> ;
			返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetAnimationDurationUpdateCallback(AnimationDurationUpdateCallback* pCallback) = 0;

			/*@function
			******************************************************************
			功  能：数据更新动画的缓动效果
			参  数：<eValue> ;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetAnimationEasingUpdate(EAnimationEasing eValue) = 0;
			virtual EAnimationEasing GetAnimationEasingUpdate() const = 0;

			/*@function
			******************************************************************
			功  能：数据更新动画的延迟
			参  数：<nValue> ;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetAnimationDelayUpdate(int nValue) = 0;
			virtual int  GetAnimationDelayUpdate() const = 0;

			/*@function
			******************************************************************
			功  能：设置 数据更新动画的延迟 的 JavaScript 回调函数
			注  意：可以通过每个数据返回不同的 delay 时间实现更戏剧的更新动画效果。例如：
					animationDelayUpdate: function (idx) {
						// 越往后的数据延迟越大
						return idx * 100;
					}
			参  数：<wzValue> JavaScript 函数字符串;
			返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetAnimationDelayUpdateJSFun(const wchar_t* wzValue) = 0;

			/*@function
			******************************************************************
			功  能：数据更新动画的延迟
			注  意：以通过每个数据返回不同的 delay 时间实现更戏剧的初始动画效果。
			参  数：<nValue> ;
			返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetAnimationDelayUpdateCallback(AnimationDelayUpdateCallback* pCallback) = 0;

			/*@function
			******************************************************************
			功  能：所有图形的 zlevel 值。
			注  意: zlevel用于 Canvas 分层，不同zlevel值的图形会放置在不同的 Canvas 中，
					Canvas 分层是一种常见的优化手段。我们可以把一些图形变化频繁（例如有动画）的
					组件设置成一个单独的zlevel。需要注意的是过多的 Canvas 会引起内存开销的增大，
					在手机端上需要谨慎使用以防崩溃。
					zlevel 大的 Canvas 会放在 zlevel 小的 Canvas 的上面。
			参  数: <nLevel> ;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetZLevel(int nLevel) = 0;
			virtual int  GetZLevel() const = 0;

			/*@function
			******************************************************************
			功  能：组件的所有图形的z值。控制图形的前后顺序。z值小的图形会被z值大的图形覆盖。
			注  意: z相比zlevel优先级更低，而且不会创建新的 Canvas。
			参  数: <nLevel> ;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetZ(int nLevel) = 0;
			virtual int  GetZ() const = 0;

		};
	}
	
}