#pragma once
/***********************************************************************
 * Module:  ISunburstType.h
 * Author:  杨鹏辉
 * Modified: 2022年7月1日 15:02:44
 * Purpose: 旭日图（Sunburst）
 
	由多层的环形图组成，在数据结构上，内圈是外圈的父节点。因此，它既能像
	饼图一样表现局部和整体的占比，又能像矩形树图一样表现层级关系。

	数据下钻:
	旭日图默认支持数据下钻，也就是说，当用户点击了某个扇形块之后，将会以该节点作为根结点显示
	并且在中间出现一个返回上层节点的圆。如果不希望有数据下钻功能，可以通过将 series-sunburst.nodeClick 设置为 false 实现。

 ***********************************************************************/
#include "Common/ICallback.h"
#include "Common/IFixedQueue.h"

#include "Options/Common/ILineStyle.h"
#include "Options/Common/IEncode.h"
#include "Options/Common/IBaseArrayElement.h"
#include "Options/Common/ICompactTooltip.h"
#include "Options/GeneralOptions/Series/Sunburst/ISunburstTypeData.h"
#include "Options/GeneralOptions/Series/Sunburst/ISunburstTypeLabel.h"
#include "Options/GeneralOptions/Series/Sunburst/ISunburstTypeLabelLineEx.h"
#include "Options/GeneralOptions/Series/Sunburst/ISunburstTypeLabelLayout.h"
#include "Options/GeneralOptions/Series/Sunburst/ISunburstTypeItemStyleEx.h"
#include "Options/GeneralOptions/Series/Sunburst/ISunburstTypeEmphasis.h"
#include "Options/GeneralOptions/Series/Sunburst/ISunburstTypeBlur.h"
#include "Options/GeneralOptions/Series/Sunburst/ISunburstTypeSelect.h"
#include "Options/GeneralOptions/Series/Sunburst/ISunburstTypeLevel.h"

namespace IIChart
{
	namespace Sunburst
	{
		/*@class
		*************************************************************************
		* 类  名: ISunburstType
		* 修  改: 2022年7月1日 15:02:44
		* 功  能: 旭日图;
		-----------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		************************************************************************/
		class ISunburstType : public IBaseArrayElement
		{
		public:

			/*@function
			*******************************************************************
			功  能:  系列类型;
			参  数:  <无>;
			返回值:  <L"SunburstType">;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual wchar_t* GetType() const = 0;

			/*@function
			*******************************************************************
			功  能:  组件 ID。默认不指定。指定则可用于在 option 或者 API 中引用组件;
			参  数:  <wzValue>;
			返回值:  <无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetId(const wchar_t* wzValue) = 0;
			virtual wchar_t* GetId() const = 0;

			/*@function
			*******************************************************************
			功  能:  系列名称，用于tooltip的显示，legend 的图例筛选，
					 在 setOption 更新数据和配置项时用于指定对应的系列;
			参  数:  <wzValue>;
			返回值:  <无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetName(const wchar_t* wzValue) = 0;
			virtual wchar_t* GetName() const = 0;
			
			/*@function
			******************************************************************
			功  能：所有图形的 zlevel 值。
			注  意: zlevel用于 Canvas 分层，不同zlevel值的图形会放置在不同的 Canvas 中，
					Canvas 分层是一种常见的优化手段。我们可以把一些图形变化频繁（例如有动画）的
					组件设置成一个单独的zlevel。需要注意的是过多的 Canvas 会引起内存开销的增大，
					在手机端上需要谨慎使用以防崩溃。
					zlevel 大的 Canvas 会放在 zlevel 小的 Canvas 的上面。
			参  数: <nLevel> ;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetZLevel(int nLevel) = 0;
			virtual int  GetZLevel() const = 0;

			/*@function
			******************************************************************
			功  能：组件的所有图形的z值。控制图形的前后顺序。z值小的图形会被z值大的图形覆盖。
			注  意: z相比zlevel优先级更低，而且不会创建新的 Canvas。
			参  数: <nLevel> ;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetZ(int nLevel) = 0;
			virtual int  GetZ() const = 0;

			/*@function
			*******************************************************************
			功  能:  旭日图的中心（圆心）坐标，数组的第一项是横坐标，第二项是纵坐标。
					 支持设置成百分比，设置成百分比时第一项是相对于容器宽度，第二项是相对于容器高度。
			参  数:  <nX>;
					 <nY>;
					 <bIsPercentage>;
			返回值:  <无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetCenter(int nX, int nY, bool bIsPercentage = false) = 0;
			virtual void GetCenter(int* pnX, int* pnY, bool* pbIsPercentage) = 0;

			/*@function
			*******************************************************************
			功  能:  旭日图的半径。支持设置成百分比，设置成百分比时第一项是相对于
					 容器宽度，第二项是相对于容器高度。
			参  数:  <nValue>;
					 <bIsPercentage>为 true 时，表示外半径为可视区尺寸（容器高宽中较小一项）;
			返回值:  <无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetRadius(int nValue, bool bIsPercent) = 0;
			virtual void GetRadius(int* pnValue, bool* pbIsPercent) = 0;

			/*@function
			*******************************************************************
			功  能:  数组的第一项是内半径，第二项是外半径。
			参  数:  <nInner>;
					 <nOutter>;
					 <bIsPercentage>为 true 时，表示内外半径为可视区尺寸（容器高宽中较小一项）;
			返回值:  <无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetRadius(int nInner, int nOutter, bool bIsPercent) = 0;
			virtual void GetRadius(int* pnInner, int* pnOutter, bool* pbIsPercent) = 0;

			/*@function
			*******************************************************************
			* 功  能：实例化单个数据项，通过此方式可以灵活定制要添加的数据的详图样式，使显示更为细腻丰富。
			* 注  意：此接口创建的数据项可以作为IFixedQueue的元素
			*         -- 使用完后需要调用 Release 释放相资源;
			*         -- IFixedQueue中的元素将由其自动进行内存回收管理;
			* 参  数：<无> ;
			* 返回值：IPieTypeData*;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual ISunburstTypeData* CreateData() = 0;

			/************************************************
			* 功  能：清除所有的数据;
			* 参  数：<无>;
			* 返回值：<无>;
			*************************************************/
			virtual void ClearData() = 0;

			/************************************************
			* 功  能：以JSON格式设置此系列数据，原有数据将会被替换。
			*         数据格式是树状的，例如：
			*	[{
			*		name: 'parent1',
			*		value: 10,          // 可以不写父元素的 value，则为子元素之和；
			*							// 如果写了，并且大于子元素之和，可以用来表示还有其他子元素未显示
			*		children: [{
			*			value: 5,
			*			name: 'child1',
			*			children: [{
			*				value: 2,
			*				name: 'grandchild1',
			*				itemStyle: {
			*					// 每个数据可以有自己的样式，覆盖 series.itemStyle 和 level.itemStyle
			*				},
			*				label: {
			*					// 标签样式，同上
			*				}
			*			}]
			*		}, {
			*			value: 3,
			*			name: 'child2'
			*		}],
			*		itemStyle: {
			*			// parent1 的图形样式，不会被后代继承
			*		},
			*		label: {
			*			// parent1 的标签样式，不会被后代继承
			*		}
			*	}, {
			*		name: 'parent2',
			*		value: 4
			*	}]
			* 
			* 参  数：<wzJson> JSON格式的数据;
			* 返回值：<无>;
			*************************************************/
			virtual int SetDataWithJson(const wchar_t* wzJson) = 0;

			/************************************************
			* 功  能：以 JSON格式显示已添加的数据;
			* 参  数：<无>;
			* 返回值：<无>;
			*************************************************/
			virtual wchar_t* GetDataAsJson() = 0;

			/*@function
			*******************************************************************
			* 功  能：添加一个数据
			* 参  数：<wzName> 显示在扇形块中的描述文字;
			*         <nValue/fValue> 数据值，如果包含 children，则可以不写 value 值
									  这时，将使用子元素的 value 之和作为父元素的 value。
									  如果 value 大于子元素之和，可以用来表示还有其他子元素未显示。;
			* 返回值：<ISunburstTypeData*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int AddData(const wchar_t* wzName) = 0;
			virtual int AddData(const wchar_t* wzName, int nValue) = 0;
			virtual int AddData(const wchar_t* wzName, float fValue) = 0;

			/*@function
			*******************************************************************
			* 功  能：向系列中添加一个数据
			* 参  数：<pValue>;
			* 返回值：<ISunburstTypeData*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int AddData(ISunburstTypeData* pValue) = 0;

			/*@function
			******************************************************************
			* 功  能：向系列中添加数据,新加的数据将在原来数据的后面;
			* 注  意：-- 此方法增加的数据只是一个一组数组;
			*         -- 由于原有的数据没有被消除，此方法会使显示的数据量一直增大
			* 参  数：<pQueue>;
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int AddData(IFixedQueue* pQueue) = 0;

			/*@function
			******************************************************************
			* 功  能：设置多个子节点，原来的子节点将被覆盖掉;
			* 注  意：系列原来的数据将被覆盖掉;
			*         此接口可以方便的实现动态图表显示;
			* 参  数：<pQueue> 新的数据;
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetData(IFixedQueue* pQueue) = 0;

			/*@function
			******************************************************************
			功  能：点击节点后的行为
			参  数：<eValue> ;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetNodeClick(ESunburstNodeClick eValue) = 0;
			virtual ESunburstNodeClick GetNodeClick() const = 0;

			/*@function
			******************************************************************
			* 功  能：点扇形块根据数据 value 的排序方式，如果未指定 value，则其值为子元素 value 之和。
			* 参  数：<eValue>;
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetSort(ESunburstSort eValue) = 0;
			virtual ESunburstSort GetSort() const = 0;

			/*@function
			******************************************************************
			* 功  能：点扇形块根据数据 value 排序方式的回调函数
			* 注  意：回调函数的格式为
			*         function(nodeA, nodeB) {
			*               return nodeA.getValue() - nodeB.getValue();
			*         }
			* 参  数：<eValue>;
			* 返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetSortJSFun(const wchar_t* wzValue) = 0;

			/*@function
			******************************************************************
			* 功  能：如果数据没有 name，是否需要渲染文字。
			* 参  数：<bValue>;
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetRenderLabelForZeroData(bool bValue) = 0;
			virtual bool GetRenderLabelForZeroData() const = 0;

			/*@function
			******************************************************************
			* 功  能：描述了每个扇形块中，文本标签的样式。
			* 参  数：<无>;
			* 返回值：<ISunburstTypeLabel*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual ISunburstTypeLabel* GetLabel() = 0;

			/*@function
			******************************************************************
			* 功  能：标签的视觉引导线配置。
			* 注  意：该配置项是在每个系列默认的标签布局基础上，统一调整标签的(x, y)位置，
			*         标签对齐等属性以实现想要的标签布局效果。
			* 参  数：<无>;
			* 返回值：<ISunburstTypeLabelLineEx*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual ISunburstTypeLabelLineEx* GetLabelLine() = 0;

			/*@function
			******************************************************************
			* 功  能：标签的统一布局配置。
			* 参  数：<无>;
			* 返回值：<ISunburstTypeLabelLayout*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual ISunburstTypeLabelLayout* GetLabelLayout() = 0;

			/*@function
			******************************************************************
			* 功  能：标签的统一布局配置。
			* 注  意：该配置项是在每个系列默认的标签布局基础上，统一调整标签的(x, y)位置，
			*         标签对齐等属性以实现想要的标签布局效果。回调函数格式为：
			*         function(params){ return rstParams}
			*         其中 params 属性如下：
			*           // 标签对应数据的 dataIndex
			*			dataIndex: number
			*			// 标签对应的数据类型，只在关系图中会有 node 和 edge 数据类型的区分
			*			dataType?: string
			*			// 标签对应的系列的 index
			*			seriesIndex: number
			*			// 标签显示的文本
			*			text: string
			*			// 默认的标签的包围盒，由系列默认的标签布局决定
			*			labelRect: {x: number, y: number, width: number, height: number}
			*			// 默认的标签水平对齐
			*			align: 'left' | 'center' | 'right'
			*			// 默认的标签垂直对齐
			*			verticalAlign: 'top' | 'middle' | 'bottom'
			*			// 标签所对应的数据图形的包围盒，可用于定位标签位置
			*			rect: {x: number, y: number, width: number, height: number}
			*			// 默认引导线的位置，目前只有饼图(pie)和漏斗图(funnel)有默认标签位置
			*			// 如果没有该值则为 null
			*			labelLinePoints?: number[][]
			*        
			*           rstParams 属性如下：
			* 参  数：<无>;
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetLabelLayoutJSFun(const wchar_t* wzValue) = 0;

			/*@function
			******************************************************************
			* 功  能：旭日图扇形块的样式。
			* 参  数：<无>;
			* 返回值：<ISunburstTypeItemStyleEx*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual ISunburstTypeItemStyleEx* GetItemStyle() = 0;

			/*@function
			******************************************************************
			* 功  能：高亮状态配置。
			* 参  数：<无>;
			* 返回值：<ISunburstTypeEmphasis*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual ISunburstTypeEmphasis* GetEmphasis() = 0;

			/*@function
			******************************************************************
			* 功  能：淡出状态配置。开启 emphasis.focus 后有效。
			* 参  数：<无>;
			* 返回值：<ISunburstTypeBlur*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual ISunburstTypeBlur* GetBlur() = 0;

			/*@function
			******************************************************************
			* 功  能：选中状态配置。开启 selectedMode 后有效。
			* 参  数：<无>;
			* 返回值：<ISunburstTypeSelect*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual ISunburstTypeSelect* GetSelect() = 0;

			/*@function
			******************************************************************
			* 功  能：选中模式的配置，表示是否支持多个选中，默认关闭
			* 参  数：<无>;
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetSelectedMode(ESelectedMode eValue) = 0;
			virtual ESelectedMode GetSelectedMode() const = 0;

			/*@function
			******************************************************************
			* 功  能：多层配置
			* 注  意：此接口创建的数据项可以作为IFixedQueue的元素
			*         -- 使用完后需要调用 Release 释放相资源;
			*         -- IFixedQueue中的元素将由其自动进行内存回收管理;
			* 参  数：<无> ;
			* 返回值：<ISunburstTypeLevel*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual ISunburstTypeLevel* CreateLevel() = 0;

			/*@function
			******************************************************************
			* 功  能：清除所有的数据;
			* 参  数：<无>;
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void ClearLevels() = 0;

			/*@function
			******************************************************************
			* 功  能：向系列中添加一层配置
			* 参  数：<pValue>;
			* 返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int AddLevel(ISunburstTypeLevel* pValue) = 0;

			/*@function
			******************************************************************
			* 功  能：向系列中添加多层配置
			* 注  意：-- 此方法增加的数据只是一个一组数组;
			*         -- 由于原有的数据没有被消除，此方法会使显示的数据量一直增大
			* 参  数：<pQueue>;
			* 返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int AddLevel(IFixedQueue* pQueue) = 0;

			/*@function
			******************************************************************
			* 功  能：设置多层配置，系列原来的多层配置将被覆盖掉;
			* 注  意：系列原来的数据将被覆盖掉;
			*         此接口可以方便的实现动态图表显示;
			* 参  数：<pQueue> 新的数据;
			* 返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetLevel(IFixedQueue* pQueue) = 0;


			/*@function
			******************************************************************
			功  能：是否开启动画;
			参  数: <bValue>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetAnimation(bool bValue) = 0;
			virtual bool GetAnimation() const = 0;

			/*@function
			******************************************************************
			功  能：是否开启动画的阈值，当单个系列显示的图形数量大于这个阈值时会关闭动画;
			参  数: <nValue>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetAnimationThreshold(int nValue) = 0;
			virtual int  GetAnimationThreshold() const = 0;

			/*@function
			******************************************************************
			功  能：初始动画的时长;
			参  数: <nValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetAnimationDuration(int nValue) = 0;
			virtual int  GetAnimationDuration() const = 0;

			/*@function
			******************************************************************
			功  能：设置 初始动画的时长 的 JavaScript 回调函数
			注  意：可以通过每个数据返回不同的时长实现更戏剧的初始动画效果，例如：
					animationDuration: function (idx) {
						// 越往后的数据时长越大
						return idx * 100;
					}
			参  数：<wzValue> JavaScript 函数字符串，不能为空;
			返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetAnimationDurationJSFun(const wchar_t* wzValue) = 0;

			/*@function
			******************************************************************
			功  能：设置 初始动画的时长 的回调函数
			注  意：可以通过每个数据返回不同的时长实现更戏剧的初始动画效果，例如：
			参  数：<pCallback> ;
			返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetAnimationDurationCallback(AnimationDurationCallback* pCallback) = 0;

			/*@function
			******************************************************************
			功  能：初始动画的缓动效果;
			参  数: <eValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetAnimationEasing(EAnimationEasing eValue) = 0;
			virtual EAnimationEasing GetAnimationEasing() const = 0;

			/*@function
			******************************************************************
			功  能：初始动画的延迟;
			参  数: <nValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetAnimationDelay(int nValue) = 0;
			virtual int  GetAnimationDelay() const = 0;

			/*@function
			******************************************************************
			功  能：设置 初始动画的延迟 的 JavaScript 回调函数
			注  意：可以通过每个数据返回不同的 delay 时间实现更戏剧的初始动画效果。例如：
					animationDelay: function (idx) {
						// 越往后的数据延迟越大
						return idx * 100;
					}
			参  数：<wzValue> JavaScript 函数字符串，不能为空;
			返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetAnimationDelayJSFun(const wchar_t* wzValue) = 0;

			/*@function
			******************************************************************
			功  能：设置 初始动画的延迟 的回调函数
			注  意：可以通过每个数据返回不同的时长实现更戏剧的初始动画效果
			参  数：<pCallback> ;
			返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetAnimationDelayCallback(AnimationDelayCallback* pCallback) = 0;

			/*@function
			******************************************************************
			功  能：数据更新动画的时长
			注  意：可以通过每个数据返回不同的时长实现更戏剧的初始动画效果
			参  数：<nValue> ;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetAnimationDurationUpdate(int nValue) = 0;
			virtual int  GetAnimationDurationUpdate() const = 0;

			/*@function
			******************************************************************
			功  能：设置 数据更新动画的时长 的 JavaScript 回调函数
			注  意：可以通过每个数据返回不同的时长实现更戏剧的更新动画效果。例如：
					animationDurationUpdate: function (idx) {
						// 越往后的数据延迟越大
						return idx * 100;
					}
			参  数：<wzValue> JavaScript 函数字符串, 不能为空;
			返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetAnimationDurationUpdateJSFun(const wchar_t* wzValue) = 0;

			/*@function
			******************************************************************
			功  能：数据更新动画的时长
			注  意：以通过每个数据返回不同的 delay 时间实现更戏剧的初始动画效果。
			参  数：<nValue> ;
			返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetAnimationDurationUpdateCallback(AnimationDurationUpdateCallback* pCallback) = 0;

			/*@function
			******************************************************************
			功  能：数据更新动画的缓动效果
			参  数：<eValue> ;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetAnimationEasingUpdate(EAnimationEasing eValue) = 0;
			virtual EAnimationEasing GetAnimationEasingUpdate() const = 0;

			/*@function
			******************************************************************
			功  能：数据更新动画的延迟
			参  数：<nValue> ;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetAnimationDelayUpdate(int nValue) = 0;
			virtual int  GetAnimationDelayUpdate() const = 0;

			/*@function
			******************************************************************
			功  能：设置 数据更新动画的延迟 的 JavaScript 回调函数
			注  意：可以通过每个数据返回不同的 delay 时间实现更戏剧的更新动画效果。例如：
					animationDelayUpdate: function (idx) {
						// 越往后的数据延迟越大
						return idx * 100;
					}
			参  数：<wzValue> JavaScript 函数字符串;
			返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetAnimationDelayUpdateJSFun(const wchar_t* wzValue) = 0;

			/*@function
			******************************************************************
			功  能：数据更新动画的延迟
			注  意：以通过每个数据返回不同的 delay 时间实现更戏剧的初始动画效果。
			参  数：<nValue> ;
			返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetAnimationDelayUpdateCallback(AnimationDelayUpdateCallback* pCallback) = 0;

			/*@function
			******************************************************************
			功  能：本系列特定的 tooltip 设定。
			参  数：<无> ;
			返回值：<ICompactTooltip*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual ICompactTooltip* GetTooltip() = 0;

		};
	}

	
}
