#pragma once
/***********************************************************************
 * Module:  IRadarType.h
 * Author:  杨鹏辉
 * Modified: 2022年7月1日 15:02:44
 * Purpose: 雷达图

	雷达图主要用于表现多变量的数据，例如球员的各个属性分析。依赖 radar 组件。
 ***********************************************************************/
#include "Common/IEnum.h"
#include "Common/ICallback.h"
#include "Options/Common/ILineStyle.h"
#include "Options/Common/IBaseArrayElement.h"
#include "Options/Common/ICompactTooltip.h"
#include "Options/Common/IUniversalTransition.h"
#include "Options/GeneralOptions/Series/Radar/IRadarTypeLabel.h"
#include "Options/GeneralOptions/Series/Radar/IRadarTypeAreaStyle.h"
#include "Options/GeneralOptions/Series/Radar/IRadarTypeLabelLayout.h"
#include "Options/GeneralOptions/Series/Radar/IRadarTypeItemStyle.h"
#include "Options/GeneralOptions/Series/Radar/IRadarTypeEmphasis.h"
#include "Options/GeneralOptions/Series/Radar/IRadarTypeBlur.h"
#include "Options/GeneralOptions/Series/Radar/IRadarTypeSelect.h"
#include "Options/GeneralOptions/Series/Radar/IRadarTypeData.h"

namespace IIChart
{
	namespace Radar
	{
		/*@class
		*************************************************************************
		* 类  名: IRadarType
		* 修  改: 2022年7月1日 15:02:44
		* 功  能: 雷达图;
		-----------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		************************************************************************/
		class IRadarType : public IBaseArrayElement
		{
		public:

			/*@function
			*******************************************************************
			功  能:  系列类型;
			参  数:  <无>;
			返回值:  <L"RadarType">;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual wchar_t* GetType() const = 0;

			/*@function
			*******************************************************************
			功  能:  组件 ID。默认不指定。指定则可用于在 option 或者 API 中引用组件;
			参  数:  <wzValue>;
			返回值:  <无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetId(const wchar_t* wzValue) = 0;
			virtual wchar_t* GetId() const = 0;

			/*@function
			*******************************************************************
			功  能:  系列名称，用于tooltip的显示，legend 的图例筛选，
					 在 setOption 更新数据和配置项时用于指定对应的系列;
			参  数:  <wzValue>;
			返回值:  <无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetName(const wchar_t* wzValue) = 0;
			virtual wchar_t* GetName() const = 0;

			/*@function
			*******************************************************************
			功  能:  从调色盘 option.color 中取色的策略，
			参  数:  <eValue>可取值为：
							 'series'：按照系列分配调色盘中的颜色，同一系列中的所有数据都是用相同的颜色；
							 'data'：按照数据项分配调色盘中的颜色，每个数据项都使用不同的颜色。
			返回值:  <无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetColorBy(EColorBy eValue) = 0;
			virtual EColorBy GetColorBy() const = 0;

			/*@function
			*******************************************************************
			功  能:  使用的 x 轴的 index，在单个图表实例中存在多个 x 轴的时候有用。
			参  数:  <nValue>可取值为：
			返回值:  <无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetRadarIndex(int nValue) = 0;
			virtual int  GetRadarIndex() const = 0;

			/*@function
			*******************************************************************
			 功  能：设置 标记的图形
			 参  数：<nValue>;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetSymbol(ESymbol nValue) = 0;
			virtual ESymbol GetSymbol() const = 0;

			/*@function
			*******************************************************************
			 功  能：用图片设置 标记的图形
			 注  意：本接口参数只能是以下几种形式：
					 1. 图片链接：
					 'image://http://example.website/a/b.png'
					 2. dataURI：
					 'image://data:image/gif;base64,R0lGODlhEAAQAMQAAORHHOVSKudfOulrSOp3WOyDZu6QdvCchPGolfO0o/XBs/fNwfjZ0frl3/zy7////wAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAACH5BAkAABAALAAAAAAQABAAAAVVICSOZGlCQAosJ6mu7fiyZeKqNKToQGDsM8hBADgUXoGAiqhSvp5QAnQKGIgUhwFUYLCVDFCrKUE1lBavAViFIDlTImbKC5Gm2hB0SlBCBMQiB0UjIQA7'
					 3. 矢量路径：（可以参考 https://www.w3.org/TR/SVG/paths.html#PathData）
					 'path://M30.9,53.2C16.8,53.2,5.3,41.7,5.3,27.6S16.8,2,30.9,2C45,2,56.4,13.5,56.4,27.6S45,53.2,30.9,53.2z M30.9,3.5C17.6,3.5,6.8,14.4,6.8,27.6c0,13.3,10.8,24.1,24.101,24.1C44.2,51.7,55,40.9,55,27.6C54.9,14.4,44.1,3.5,30.9,3.5z M36.9,35.8c0,0.601-0.4,1-0.9,1h-1.3c-0.5,0-0.9-0.399-0.9-1V19.5c0-0.6,0.4-1,0.9-1H36c0.5,0,0.9,0.4,0.9,1V35.8z M27.8,35.8 c0,0.601-0.4,1-0.9,1h-1.3c-0.5,0-0.9-0.399-0.9-1V19.5c0-0.6,0.4-1,0.9-1H27c0.5,0,0.9,0.4,0.9,1L27.8,35.8L27.8,35.8z'
			 参  数：<wzValue>图片的 URL 或 dataURI也可以是 Path;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetSymbolImage(const wchar_t* wzValue) = 0;
			virtual wchar_t* GetSymbolImage() const = 0;

			/*@function
			*******************************************************************
			 功  能：设置 标记的图形 的 JavaScript 回调函数
			 注  意：此方法可以让每个数据的图形不一样，回调类型
					 (value: Array|number, params: Object) => string
					 其中第一个参数 value 为 data 中的数据值。第二个参数params 是其它的数据项参数。
			 参  数：<无>;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetSymbolJSFun(const wchar_t* wzValue) = 0;

			/*@function
			*******************************************************************
			 功  能：设置 标记的图形 的 C++ 回调函数
			 注  意：此方法可以让每个数据的图形不一样，回调类型
					 (value: Array|number, params: Object) => string
					 其中第一个参数 value 为 data 中的数据值。第二个参数params 是其它的数据项参数。
			 参  数：<无>;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetSymbolCallback(SymbolCallback* pCallback) = 0;

			/*@function
			*******************************************************************
			 功  能：标记的大小，可以设置成诸如 10 这样单一的数字
			 参  数：<nSize>;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetSymbolSize(int nSize) = 0;
			virtual int GetSymbolSize() const = 0;

			/*@function
			*******************************************************************
			 功  能：标记的大小，可以设置成诸如 10 这样单一的数字
			 参  数：<nHeight>;
					<nWidth>;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetSymbolSize(int nHeight, int nWidth) = 0;
			virtual void GetSymbolSize(int& nHeight, int& nWidth) = 0;

			/*@function
			*******************************************************************
			 功  能：设置 标记的图形大小 的 JavaScript 回调函数
			 注  意：此方法可以让每个数据的图形大小不一样，回调类型
					 (value: Array|number, params: Object) => number|Array
					 其中第一个参数 value 为 data 中的数据值。第二个参数params 是其它的数据项参数。
			 参  数：<无>;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetSymbolSizeJSFun(const wchar_t* wzValue) = 0;

			/*@function
			*******************************************************************
			 功  能：设置 标记的图形大小 的 C++ 回调函数
			 注  意：此方法可以让每个数据的图形大小不一样，回调类型
					 (value: Array|number, params: Object) => number|Array
					 其中第一个参数 value 为 data 中的数据值。第二个参数params 是其它的数据项参数。
			 参  数：<无>;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetSymbolSizeCallback(SymbolSizeCallback* pCallback) = 0;

			/*@function
			*******************************************************************
			 功  能：标记的旋转角度（而非弧度）,正值表示逆时针旋转。
			 注  意：在 markLine 中当 symbol 为 'arrow' 时会忽略 symbolRotate 强制设置为切线的角度。
			 参  数：<nHeight>;
					<nWidth>;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetSymbolRotate(int nRotate) = 0;
			virtual int GetSymbolRotate() const = 0;

			/*@function
			*******************************************************************
			 功  能：设置 标记数据的旋转角度 的 JavaScript 回调函数
			 注  意：此方法可以让每个数据的旋转角度不一样，回调类型
					 (value: Array|number, params: Object) => number|Array
					 其中第一个参数 value 为 data 中的数据值。第二个参数params 是其它的数据项参数。
			 参  数：<无>;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetSymbolRotateJSFun(const wchar_t* wzValue) = 0;

			/*@function
			*******************************************************************
			 功  能：设置 数据的旋转角度 的 C++ 回调函数
			 注  意：此方法可以让每个数据的旋转角度不一样，回调类型
					 (value: Array|number, params: Object) => number|Array
					 其中第一个参数 value 为 data 中的数据值。第二个参数params 是其它的数据项参数。
			 参  数：<无>;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetSymbolRotateCallback(SymbolRotateCallback* pCallback) = 0;

			/*@function
			*******************************************************************
			 功  能：如果 symbol 是 path:// 的形式，是否在缩放时保持该图形的长宽比。
			 参  数：<bValue>;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetSymbolKeepAspect(bool bValue) = 0;
			virtual bool GetSymbolKeepAspect() const = 0;

			/*@function
			*******************************************************************
			 功  能：标记相对于原本位置的偏移。
			 注  意：默认情况下，标记会居中置放在数据对应的位置
					 但是如果 symbol 是自定义的矢量路径或者图片，就有可能不希望 symbol 居中。
					 这时候可以使用该配置项配置 symbol 相对于原本居中的偏移，此处为绝对的像素值，
			 参  数：<nX> 水平偏移;
					 <nY> 垂直偏移;
					 <bIsPercentage> 默认为false，表示偏移值为像素，否则为百分比;
			 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetSymbolOffset(int nX, int nY, bool bIsPercentage) = 0;
			virtual void GetSymbolOffset(int* pnX, int* pnY, bool* pbIsPercentage) = 0;

			/*@function
			*******************************************************************
			功  能：图形上的文本标签，可用于说明图形的一些数据信息，比如值，名称等。
			参  数：<无>;
			返回值：<IRadarTypeLabel*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IRadarTypeLabel* GetLabel() = 0;

			/*@function
			*******************************************************************
			功  能：标签的统一布局配置
			参  数：<无>;
			返回值：<IRadarTypeLabelLayout*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IRadarTypeLabelLayout* GetLabelLayout() = 0;

			/*@function
			*******************************************************************
			功  能：折线拐点标志的样式
			参  数：<无>;
			返回值：<IRadarTypeLabelLayout*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IRadarTypeItemStyle* GetItemStyle() = 0;

			/*@function
			*******************************************************************
			功  能：线条样式
			参  数：<无>;
			返回值：<ILineStyle*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual ILineStyle* GetLineStyle() = 0;

			/*@function
			*******************************************************************
			功  能：区域填充样式
			参  数：<无>;
			返回值：<IRadarTypeAreaStyle*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IRadarTypeAreaStyle* GetAreaStyle() = 0;

			/*@function
			*******************************************************************
			功  能：折线图的高亮状态
			参  数：<无>;
			返回值：<IRadarTypeEmphasis*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IRadarTypeEmphasis* GetEmphasis() = 0;

			/*@function
			*******************************************************************
			功  能：折线图的淡出状态
			参  数：<无>;
			返回值：<IRadarTypeBlur*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IRadarTypeBlur* GetBlur() = 0;

			/*@function
			*******************************************************************
			功  能：折线图的选中状态
			参  数：<无>;
			返回值：<IRadarTypeSelect*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IRadarTypeSelect* GetSelect() = 0;

			/*@function
			*******************************************************************
			功  能:  选中模式的配置，表示是否支持多个选中，默认关闭
			参  数:  <eValue>：
			返回值:  <无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetSelectMode(ESelectedMode eValue) = 0;
			virtual ESelectedMode GetSelectMode() const = 0;

			/*@function
			*******************************************************************
			功  能：该系列所有数据共有的组 ID。组 ID 会被用于分类数据，并在全局过渡动画中决定如何进行合并和分裂动画。
				    如果你使用了dataset组件来表达数据，推荐使用encode.itemGroupID来指定哪个维度被编码为组 ID。
			参  数：<wzValue> ;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetDataGroupId(const wchar_t* wzValue) = 0;
			virtual wchar_t* GetDataGroupId() const = 0;

			/*@function
			*******************************************************************
			功  能：实例化单个数据项，通过此方式可以灵活定制要添加的数据的详图样式，使显示更为细腻丰富。
			注  意：此接口创建的数据项可以作为IFixedQueue的元素
					-- 使用完后需要调用 Release 释放相资源;
					-- IFixedQueue中的元素将由其自动进行内存回收管理;
			参  数：<无> ;
			返回值：IRadarTypeData*;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IRadarTypeData* CreateData() = 0;
			virtual IRadarTypeData* CreateData(const wchar_t* wzName, int nValue) = 0;
			virtual IRadarTypeData* CreateData(const wchar_t* wzName, float nValue) = 0;

			/*@function
			*******************************************************************
			* 功  能：清除所有的数据;
			* 参  数：<无>;
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void ClearData() = 0;

			/*@function
			*******************************************************************
			* 功  能：清除指定行的数据;
			* 参  数：<nRowIndex> 指定的行号，第一行为 0;
			* 返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int ClearRow(int nRowIndex) = 0;

			/*@function
			*******************************************************************
			* 功  能：以JSON格式设置此系列数据，原有数据将会被替换。例如：
			* 一维数据格式：
			*     "[7.2, 8.8, 18, 57]"
			* 二维数据格式：
			*     "[
			*         [3.4, 4.5, 15, 43],
			*         [4.2, 2.3, 20, 91],
			*         [10.8, 9.5, 30, 18],
			*         [7.2, 8.8, 18, 57]
			*    ]"
			* 注  意：原有的数据将会被替换;
			*         此方法增加的数据元素可是JSON对象,例如：
			*     "[
			*         12,
			*         34,
			*         {value:56, label: {},itemStyle:{}},
			*         57
			*     ]"
			* 参  数：<wzJson> JSON格式的数据;
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetDataWithJson(const wchar_t* wzJson) = 0;

			/*@function
			*******************************************************************
			* 功  能：以 JSON格式显示已添加的数据;
			* 参  数：<无>;
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual wchar_t* GetDataAsJson() = 0;

			/*@function
			*******************************************************************
			* 功  能：雷达图的数据为多变量（维度）时，此接口向系列中增加一维数据; 
			*         例如下图中增加了两个维度的数据：
			*         data : [
			*			{
			*				value : [4300, 10000, 28000, 35000, 50000, 19000],
			*				name : '预算分配（Allocated Budget）'
			*			},
			*			{
			*				value : [5000, 14000, 28000, 31000, 42000, 21000],
			*				name : '实际开销（Actual Spending）'
			*			}
			*		]
			* 注  意：此方法增加的数据只是一个一组数组;
			* 参  数：<wzName> 新的数据;
			          <vctValues> 新的数据;
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int AddOneDimensionData(const wchar_t* wzName, const std::vector<int>& vctValues) = 0;
			virtual int AddOneDimensionData(const wchar_t* wzName, const std::vector<float>& vctValues) = 0;
			virtual int AddOneDimensionData(const wchar_t* wzName, const std::vector<std::wstring>& vctValues) = 0;

			/*@function
			******************************************************************
			* 功  能：雷达图的数据为多变量（维度）时，此接口向系列中增加一维数据; 
			*         例如下图中增加了两个维度的数据：
			*         data : [
			*			{
			*				value : [4300, 10000, 28000, 35000, 50000, 19000],
			*				name : '预算分配（Allocated Budget）'
			*			},
			*			{
			*				value : [5000, 14000, 28000, 31000, 42000, 21000],
			*				name : '实际开销（Actual Spending）'
			*			}
			*		]
			* 参  数：<wzValue> 以“,”隔开的数据，也可以Json数组，或是Json对象数组;例如：
			*                  1. L"['2012', '2013', '2014', '2015']" // Json数组;
			*                  2. L"[\"2012\", \"2013\", \"2014\", \"2015\"]" // Json数组;
			*                  3. L"12, 44, 55, 66, 2"
			*                  4. L"'2015', '2016', '2017'" // 每个值为字符串
			*                     L"43.3, 85.8, 93.7"       // 每个值为数字
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int AddOneDimensionData(const wchar_t* wzName, const wchar_t* wzValue) = 0;

			/*@function
			*******************************************************************
			* 功  能：向系列中添加数据，新加的数据将在原来数据的后面;
			* 参  数：<nValue/fValue> 数据值;
			*         <wzName> 数据项名称;
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int AddData(IRadarTypeData* pData) = 0;
			virtual void AddData(const wchar_t* wzName, int nValue) = 0;
			virtual void AddData(const wchar_t* wzName, float fValue) = 0;

			/*@function
			*******************************************************************
			* 功  能：向系列中添加数据，新加的数据将在原来数据的后面;
			* 注  意：-- 当只有一个轴为类目轴（axis.type 为 'category'）的时候，
			*            使用此类方法增加数据
			*         -- 此方法增加的数据只是一个一组数组;
			*         -- 由于原有的数据没有被消除，此方法会使显示的数据量一直增大
			*            如果没有同时增加相应的坐标轴类目数据 data，图表的显示会出问题;
			* 参  数：<pQueue> 其中的数据类型可同时支持 int | float | wstring | object;
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int AddData(const std::vector<int>& vctValues) = 0;
			virtual int AddData(const std::vector<float>& vctValues) = 0;
			virtual int AddData(const std::vector<std::wstring>& vctValues) = 0;
			virtual int AddData(IFixedQueue* pQueue) = 0;
			virtual int AddData(int* pnValue, int nCount) = 0;
			virtual int AddData(float* pfValue, int nCount) = 0;

			/*@function
			******************************************************************
			* 功  能：向系列中添加数据，新加的数据将在原来数据的后面;
			* 参  数：<wzValue> 以“,”隔开的数据，也可以Json数组，或是Json对象数组;例如：
			*                  1. L"['2012', '2013', '2014', '2015']" // Json数组;
			*                  2. L"[\"2012\", \"2013\", \"2014\", \"2015\"]" // Json数组;
			*                  3. L"12, 44, 55, 66, 2"
			*                  4. L"'2015', '2016', '2017'"
			*                     L"43.3, 85.8, 93.7"
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int AddData(const wchar_t* wzValue) = 0;

			/*@function
			*******************************************************************
			* 功  能：给系列赋值，系列原来的数据将被覆盖掉;
			* 注  意：此方法增加的数据只是一个一组数组;
			* 参  数：<vctValues> 新的数据;
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetData(const std::vector<int>& vctValues) = 0;
			virtual int SetData(const std::vector<float>& vctValues) = 0;
			virtual int SetData(const std::vector<std::wstring>& vctValues) = 0;

			/*@function
			*******************************************************************
			* 功  能：给系列赋值，此值为一个一维数组;
			* 注  意：系列原来的数据将被覆盖掉;
			*         此接口可以方便的实现动态图表显示;
			* 参  数：<pQueue> 其中的数据类型可同时支持 int | float | wstring;
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetData(IFixedQueue* pQueue) = 0;

			/*@function
			******************************************************************
			* 功  能：给系列赋值，系列原来的数据将被覆盖掉;
			* 参  数：<wzValue> 以“,”隔开的数据，也可以Json数组，或是Json对象数组;例如：
			*                  1. L"['2012', '2013', '2014', '2015']" // Json数组;
			*                  2. L"[\"2012\", \"2013\", \"2014\", \"2015\"]" // Json数组;
			*                  3. L"12, 44, 55, 66, 2"
			*                  4. L"'2015', '2016', '2017'" // 每个值为字符串
			*                     L"43.3, 85.8, 93.7"       // 每个值为数字
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetData(const wchar_t* wzValue) = 0;

			/*@function
			*******************************************************************
			* 功  能：取数据拥有的行数;
			* 注  意：此行数据元素个数需要与已添的保持一致，否则图表无法正常显示;
			* 参  数：<无>;
			* 返回值：<行数>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int GetDataRowCount() = 0;

			/*@function
			*******************************************************************
			* 功  能：取数据拥有的行数;
			* 注  意：此行数据元素个数需要与已添的保持一致，否则图表无法正常显示;
			* 参  数：<无>;
			* 返回值：<每行数据元素个数>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int GetDataRowElementCount() = 0;

			/*@function
			*******************************************************************
			* 功  能：向系列中添加一行数据;
			* 注  意：此行数据元素个数需要与已添的保持一致，否则图表无法正常显示;
			* 参  数：<vctValues> 添加的数据;
			* 返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int AddRowData(const std::vector<int>& vctValues) = 0;
			virtual int AddRowData(const std::vector<float>& vctValues) = 0;
			virtual int AddRowData(const std::vector<std::wstring>& vctValues) = 0;
			virtual int AddRowData(IFixedQueue* pQueue) = 0;

			/*@function
			******************************************************************
			* 功  能：向系列中添加一行数据;
			* 参  数：<wzValue> 以“,”隔开的数据，也可以Json数组，或是Json对象数组;例如：
			*                  1. L"['2012', '2013', '2014', '2015']" // Json数组;
			*                  2. L"[\"2012\", \"2013\", \"2014\", \"2015\"]" // Json数组;
			*                  3. L"12, 44, 55, 66, 2"
			*                  4. L"'2015', '2016', '2017'" // 每个值为字符串
			*                     L"43.3, 85.8, 93.7"       // 每个值为数字
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int AddRowData(const wchar_t* wzValue) = 0;

			/*@function
			*******************************************************************
			* 功  能：向系列中添加一行数据;
			* 注  意：此行数据元素个数需要与已添的保持一致，否则图表无法正常显示;
			* 参  数：<pnValue> 添加的数据的首地址;
			*         <nCount>  添加的数据的个数;
			* 返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int AddRowData(int* pnValue, int nCount) = 0;
			virtual int AddRowData(float* pfValue, int nCount) = 0;

			/*@function
			*******************************************************************
			* 功  能：设置指定行的数据，此行原来的数据会被替换掉；
			* 注  意：此行数据元素个数需要与已添的保持一致，否则图表无法正常显示;
			* 参  数：<nRowIndex> 指定行的行号;
			*         <vctValues> ;
			* 返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetRowData(int nRowIndex, const std::vector<int>& vctValues) = 0;
			virtual int SetRowData(int nRowIndex, const std::vector<float>& vctValues) = 0;
			virtual int SetRowData(int nRowIndex, const std::vector<std::wstring>& vctValues) = 0;

			/*@function
			*******************************************************************
			* 功  能：设置指定行的数据，此行原来的数据会被替换掉；
			* 注  意：此行数据元素个数需要与已添的保持一致，否则图表无法正常显示;
			*         此接口可以方便的实现动态图表;
			* 参  数：<nRowIndex> 指定行的行号;
			*         <pQueue> 其中的数据类型可同时支持 int | float | wstring;
			* 返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetRowData(int nRowIndex, IFixedQueue* pQueue) = 0;

			/*@function
			******************************************************************
			* 功  能：设置指定行的数据，此行原来的数据会被替换掉；
			* 注  意：此行数据元素个数需要与已添的保持一致，否则图表无法正常显示;
			* 参  数：<wzValue> 以“,”隔开的数据，也可以Json数组，或是Json对象数组;例如：
			*                  1. L"['2012', '2013', '2014', '2015']" // Json数组;
			*                  2. L"[\"2012\", \"2013\", \"2014\", \"2015\"]" // Json数组;
			*                  3. L"12, 44, 55, 66, 2"
			*                  4. L"'2015', '2016', '2017'" // 每个值为字符串
			*                     L"43.3, 85.8, 93.7"       // 每个值为数字
			* 返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetRowData(int nRowIndex, const wchar_t* wzValue) = 0;

			/*@function
			*******************************************************************
			* 功  能：设置指定行的数据，此行原来的数据会被替换掉；
			* 注  意：此行数据元素个数需要与已添的保持一致，否则图表无法正常显示;
			* 参  数：<nRowIndex> 指定行的行号;
			*         <pnValue> 添加的数据的首地址;
			*         <nCount>  添加的数据的个数;
			* 返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetRowData(int nRowIndex, int* pnValue, int nCount) = 0;
			virtual int SetRowData(int nRowIndex, float* pfValue, int nCount) = 0;

			
			/*@function
			******************************************************************
			功  能：所有图形的 zlevel 值。
			注  意: zlevel用于 Canvas 分层，不同zlevel值的图形会放置在不同的 Canvas 中，
					Canvas 分层是一种常见的优化手段。我们可以把一些图形变化频繁（例如有动画）的
					组件设置成一个单独的zlevel。需要注意的是过多的 Canvas 会引起内存开销的增大，
					在手机端上需要谨慎使用以防崩溃。
					zlevel 大的 Canvas 会放在 zlevel 小的 Canvas 的上面。
			参  数: <nLevel> ;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetZLevel(int nLevel) = 0;
			virtual int  GetZLevel() const = 0;

			/*@function
			******************************************************************
			功  能：组件的所有图形的z值。控制图形的前后顺序。z值小的图形会被z值大的图形覆盖。
			注  意: z相比zlevel优先级更低，而且不会创建新的 Canvas。
			参  数: <nLevel> ;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetZ(int nLevel) = 0;
			virtual int  GetZ() const = 0;

			/*@function
			******************************************************************
			功  能：图形是否不响应和触发鼠标事件，默认为 false，即响应和触发鼠标事件。
			参  数: <bValue> ;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetSilent(bool bValue) = 0;
			virtual bool GetSilent() const = 0;

			/*@function
			******************************************************************
			功  能：是否开启动画;
			参  数: <bValue>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetAnimation(bool bValue) = 0;
			virtual bool GetAnimation() const = 0;

			/*@function
			******************************************************************
			功  能：是否开启动画的阈值，当单个系列显示的图形数量大于这个阈值时会关闭动画;
			参  数: <nValue>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetAnimationThreshold(int nValue) = 0;
			virtual int  GetAnimationThreshold() const = 0;

			/*@function
			******************************************************************
			功  能：初始动画的时长;
			参  数: <nValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetAnimationDuration(int nValue) = 0;
			virtual int  GetAnimationDuration() const = 0;

			/*@function
			******************************************************************
			功  能：设置 初始动画的时长 的 JavaScript 回调函数
			注  意：可以通过每个数据返回不同的时长实现更戏剧的初始动画效果，例如：
					animationDuration: function (idx) {
						// 越往后的数据时长越大
						return idx * 100;
					}
			参  数：<wzValue> JavaScript 函数字符串，不能为空;
			返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetAnimationDurationJSFun(const wchar_t* wzValue) = 0;

			/*@function
			******************************************************************
			功  能：设置 初始动画的时长 的回调函数
			注  意：可以通过每个数据返回不同的时长实现更戏剧的初始动画效果，例如：
			参  数：<pCallback> ;
			返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetAnimationDurationCallback(AnimationDurationCallback* pCallback) = 0;

			/*@function
			******************************************************************
			功  能：初始动画的缓动效果;
			参  数: <eValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetAnimationEasing(EAnimationEasing eValue) = 0;
			virtual EAnimationEasing GetAnimationEasing() const = 0;

			/*@function
			******************************************************************
			功  能：初始动画的延迟;
			参  数: <nValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetAnimationDelay(int nValue) = 0;
			virtual int  GetAnimationDelay() const = 0;

			/*@function
			******************************************************************
			功  能：设置 初始动画的延迟 的 JavaScript 回调函数
			注  意：可以通过每个数据返回不同的 delay 时间实现更戏剧的初始动画效果。例如：
					animationDelay: function (idx) {
						// 越往后的数据延迟越大
						return idx * 100;
					}
			参  数：<wzValue> JavaScript 函数字符串，不能为空;
			返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetAnimationDelayJSFun(const wchar_t* wzValue) = 0;

			/*@function
			******************************************************************
			功  能：设置 初始动画的延迟 的回调函数
			注  意：可以通过每个数据返回不同的时长实现更戏剧的初始动画效果
			参  数：<pCallback> ;
			返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetAnimationDelayCallback(AnimationDelayCallback* pCallback) = 0;

			/*@function
			******************************************************************
			功  能：数据更新动画的时长
			注  意：可以通过每个数据返回不同的时长实现更戏剧的初始动画效果
			参  数：<nValue> ;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetAnimationDurationUpdate(int nValue) = 0;
			virtual int  GetAnimationDurationUpdate() const = 0;

			/*@function
			******************************************************************
			功  能：设置 数据更新动画的时长 的 JavaScript 回调函数
			注  意：可以通过每个数据返回不同的时长实现更戏剧的更新动画效果。例如：
					animationDurationUpdate: function (idx) {
						// 越往后的数据延迟越大
						return idx * 100;
					}
			参  数：<wzValue> JavaScript 函数字符串, 不能为空;
			返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetAnimationDurationUpdateJSFun(const wchar_t* wzValue) = 0;

			/*@function
			******************************************************************
			功  能：数据更新动画的时长
			注  意：以通过每个数据返回不同的 delay 时间实现更戏剧的初始动画效果。
			参  数：<nValue> ;
			返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetAnimationDurationUpdateCallback(AnimationDurationUpdateCallback* pCallback) = 0;

			/*@function
			******************************************************************
			功  能：数据更新动画的缓动效果
			参  数：<eValue> ;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetAnimationEasingUpdate(EAnimationEasing eValue) = 0;
			virtual EAnimationEasing GetAnimationEasingUpdate() const = 0;

			/*@function
			******************************************************************
			功  能：数据更新动画的延迟
			参  数：<nValue> ;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetAnimationDelayUpdate(int nValue) = 0;
			virtual int  GetAnimationDelayUpdate() const = 0;

			/*@function
			******************************************************************
			功  能：设置 数据更新动画的延迟 的 JavaScript 回调函数
			注  意：可以通过每个数据返回不同的 delay 时间实现更戏剧的更新动画效果。例如：
					animationDelayUpdate: function (idx) {
						// 越往后的数据延迟越大
						return idx * 100;
					}
			参  数：<wzValue> JavaScript 函数字符串;
			返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetAnimationDelayUpdateJSFun(const wchar_t* wzValue) = 0;

			/*@function
			******************************************************************
			功  能：数据更新动画的延迟
			注  意：以通过每个数据返回不同的 delay 时间实现更戏剧的初始动画效果。
			参  数：<nValue> ;
			返回值：<错误码>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual int SetAnimationDelayUpdateCallback(AnimationDelayUpdateCallback* pCallback) = 0;

			/*@function
			******************************************************************
			功  能：全局过渡动画相关的配置。
			参  数: <无> ;
			返回值：<IUniversalTransition*>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IUniversalTransition* GetUniversalTransition() = 0;

			/*@function
			******************************************************************
			功  能：本系列特定的 tooltip 设定。
			参  数: <无> ;
			返回值：<ICompactTooltip*>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual ICompactTooltip* GetTooltip() = 0;
		};
	}
	
}
