#pragma once
/***********************************************************************
 * Module:  IAxisLine.h
 * Author:  杨鹏辉
 * Modified: 2022年7月1日 15:02:44
 * Purpose: 
 ***********************************************************************/
#include "Common/IEnum.h"
#include "Options/GeneralOptions/Axis/IAxisLineStyle.h"

namespace IIChart
{
	namespace Axis
	{
		/*@class
		*************************************************************************
		* 类  名: IAxisLine
		* 修  改: 2022年7月1日 15:02:44
		* 功  能: 坐标轴轴线相关设置。
		-----------------------------------------------------------------------
		作  者:  YangPenghui 2022-10-26;
		************************************************************************/
		class IAxisLine
		{
		public:

			/*@function
			******************************************************************
			功  能：是否显示坐标轴轴线。
			参  数：<bShow>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetShow(bool bShow) = 0;
			virtual bool GetShow() const = 0;

			/*@function
			******************************************************************
			功  能：X 轴或者 Y 轴的轴线是否在另一个轴的 0 刻度上，只有在另一个轴为数值轴且包含 0 刻度时有效。
			参  数：<bShow>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetOnZero(bool bShow) = 0;
			virtual bool GetOnZero() const = 0;

			/*@function
			******************************************************************
			功  能：当有双轴时，可以用这个属性手动指定，在哪个轴的 0 刻度上。
			参  数：<bShow>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetOnZeroAxisIndex(int nValue) = 0;
			virtual int  GetOnZeroAxisIndex() const = 0;

			/*@function
			******************************************************************
			功  能：轴线两边的箭头。此时两边的箭头是一样的。
			参  数：<eValue>;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetSymbol(ESymbol eValue) = 0;
			virtual ESymbol GetSymbol() const = 0;

			/*@function
			******************************************************************
			功  能：轴线两边的箭头,默认为不显示箭头;
			参  数：<eHead> 头部箭头;
			       <eTail> 尾部箭头;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetSymbol(ESymbol eHead, ESymbol eTail) = 0;
			virtual void GetSymbol(ESymbol* peHead, ESymbol* peTail) = 0;

			/*@function
			******************************************************************
			功  能：轴线两边的箭头的大小;
			参  数：<nWidth> 表示宽度（垂直坐标轴方向）;
				   <nHeight> 表示高度（平行坐标轴方向）;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetSymbolSize(int nWidth, int nHeight) = 0;
			virtual void GetSymbolSize(int* pnWidth, int* pnHeight) const = 0;

			/*@function
			******************************************************************
			功  能：轴线两边的箭头的偏移;
			参  数：<nValue> 两个箭头使用同样的偏移;
				   <nHeight> 表示高度（平行坐标轴方向）;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetSymbolOffset(int nValue) = 0;
			virtual void GetSymbolOffset(int* pnValue) = 0;

			/*@function
			******************************************************************
			功  能：轴线两边的箭头的偏移;
			参  数：<nHead> 起始箭头的偏移;
				   <nTail> 末端箭头的偏移;
			返回值：<无>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetSymbolOffset(int nHead, int nTail, bool bIsPercentage = false) = 0;
			virtual void GetSymbolOffset(int* pnHead, int* pnTail, bool* pbIsPercentage) = 0;

			/*@function
			******************************************************************
			功  能：轴线的样式;
			参  数：<无>;
			返回值：<IAxisLineStyle*>;
			------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IAxisLineStyle* GetLineStyle() = 0;
		};
	}
	
}
