#pragma once
/***********************************************************************
 * Module:  IAxisPointer.h
 * Author:  杨鹏辉
 * Modified: 2022年7月1日 15:02:44
 * Purpose: 坐标轴指示器配置项。
 ***********************************************************************/
#include "Common/IEnum.h"
#include "Options/Common/IHandle.h"
#include "Options/Common/IShadowStyle.h"
#include "Options/GeneralOptions/Axis/IAxisLineStyle.h"
#include "Options/GeneralOptions/Axis/IAxisPointerLabel.h"

namespace IIChart
{
	namespace Axis
	{
		/*@class
		***********************************************************************
		* 类  名: IAxisPointer
		* 修  改: 2022年7月1日 15:02:44
		* 功  能: 坐标轴指示器配置项。
		-----------------------------------------------------------------------
		* 作  者:  YangPenghui 2022-10-26;
		************************************************************************/
		class IAxisPointer
		{
		public:

			/*@function
			******************************************************************
			功  能：默认不显示。但是如果 tooltip.trigger 设置为 'axis' 或者 tooltip.axisPointer.type 设置为 'cross'，则自动显示 axisPointer。
			注  意：坐标系会自动选择显示显示哪个轴的 axisPointer，也可以使用 tooltip.axisPointer.axis 改变这种选择。
			参  数：<bValue>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetShow(bool bValue) = 0;
			virtual bool GetShow() const = 0;

			/*@function
			******************************************************************
			功  能：指示器类型
			参  数：<eValue>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetType(EAxisPointerType eValue) = 0;
			virtual EAxisPointerType GetType() const = 0;

			/*@function
			******************************************************************
			功  能：坐标轴指示器是否自动吸附到点上, 默认自动判断
			注  意：这个功能在数值轴和时间轴上比较有意义，可以自动寻找细小的数值点。
			参  数：<eValue>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetSnap(bool bValue) = 0;
			virtual bool GetSnap() const = 0;

			/*@function
			******************************************************************
			功  能：X 轴组件的所有图形的z值。控制图形的前后顺序。z值小的图形会被z值大的图形覆盖。
			参  数：<nValue>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetZ(int nValue) = 0;
			virtual int  GetZ()const = 0;

			/*@function
			******************************************************************
			功  能：是否触发 tooltip。如果不想触发 tooltip 可以关掉。
			参  数：<eValue>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetTriggerTooltip (bool bValue) = 0;
			virtual bool GetTriggerTooltip () const = 0;

			/*@function
			******************************************************************
			功  能：当前的 value
			注  意：在使用 axisPointer.handle 时，可以设置此值进行初始值设定，从而决定 axisPointer 的初始位置。
			参  数：<eValue>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetValue(int nValue) = 0;
			virtual void SetValue(float fValue) = 0;
			virtual void GetValue(int* pnValue) = 0;
			virtual void GetValue(float* pfValue) = 0;

			/*@function
			******************************************************************
			功  能：当前的状态
			参  数：<bValue>;
			返回值：<无>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual void SetStatus(bool bValue) = 0;
			virtual bool GetStatus()const = 0;

			/*@function
			******************************************************************
			功  能：拖拽手柄，适用于触屏的环境
			参  数：<无>;
			返回值：<IHandle*>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IHandle* GetHandle() = 0;

			/*@function
			******************************************************************
			功  能：线的样式
			参  数：<无>;
			返回值：<IAxisLineStyle*>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IAxisLineStyle* GetLineStyle() = 0;

			/*@function
			******************************************************************
			功  能：axisPointer.type 为 'shadow' 时有效。
			参  数：<无>;
			返回值：<IAxisLineStyle*>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IShadowStyle* GetShadowStyle() = 0;

			/*@function
			******************************************************************
			功  能：坐标轴指示器的文本标签。
			参  数：<无>;
			返回值：<IAxisLineStyle*>;
			 ------------------------------------------------------------------
			作  者:  YangPenghui 2022-10-26;
			******************************************************************/
			virtual IAxisPointerLabel* GetLabel() = 0;
		};
	}

	
}
